<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!-- Generated by Apache Maven Doxia Site Renderer 1.7.4 at 2017-11-01 -->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en">
  <head>
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
    <title>language-feature &#x2013; </title>
    <style type="text/css" media="all">
      @import url("./css/maven-base.css");
      @import url("./css/maven-theme.css");
      @import url("./css/site.css");
    </style>
    <link rel="stylesheet" href="./css/print.css" type="text/css" media="print" />
    <meta http-equiv="Content-Language" content="en" />
        
        </head>
  <body class="composite">
    <div id="banner">
                    <div id="bannerLeft">
                language-feature
                </div>
                    <div class="clear">
        <hr/>
      </div>
    </div>
    <div id="breadcrumbs">
          
                <div class="xleft">
        <span id="publishDate">Last Published: 2017-11-01</span>
                  &nbsp;| <span id="projectVersion">Version: 1.0-SNAPSHOT</span>
                      </div>
            <div class="xright">                    <a href="./" title="language-feature">language-feature</a>
            
      </div>
      <div class="clear">
        <hr/>
      </div>
    </div>
    <div id="leftColumn">
      <div id="navcolumn">
           
                                <h5>Parent Project</h5>
                  <ul>
                  <li class="none">
                          <a href="../index.html" title="java-learn">java-learn</a>
            </li>
          </ul>
                       <h5>Project Documentation</h5>
                  <ul>
                                                                                                                                                                                                                                                        <li class="collapsed">
                          <a href="project-info.html" title="Project Information">Project Information</a>
                  </li>
          </ul>
                             <a href="http://maven.apache.org/" title="Built by Maven" class="poweredBy">
        <img class="poweredBy" alt="Built by Maven" src="./images/logos/maven-feather.png" />
      </a>
                 
            </div>
    </div>
    <div id="bodyColumn">
      <div id="contentBox">
        <p># java 8 &#x65e5;&#x671f;/&#x65f6;&#x95f4; &#x5b66;&#x4e60;</p>
<div class="section">
<h2><a name="a1_"></a>1 &#x5305;&#x7ed3;&#x6784;&#x5b9a;&#x4e49;</h2>

<blockquote>
<p>Java 8&#x65e5;&#x671f;/&#x65f6;&#x95f4;&#xff08; Date/Time&#xff09;API&#x662f;&#x5f00;&#x53d1;&#x4eba;&#x5458;&#x6700;&#x53d7;&#x8ffd;&#x6367;&#x7684;&#x53d8;&#x5316;&#x4e4b;&#x4e00;&#xff0c; Java&#x4ece;&#x4e00;&#x5f00;&#x59cb;&#x5c31;&#x6ca1;&#x6709;&#x5bf9;&#x65e5;&#x671f;&#x65f6;&#x95f4;&#x5904;&#x7406;&#x7684;&#x4e00;&#x81f4;&#x6027;&#x65b9;&#x6cd5;&#xff0c; &#x56e0;&#x6b64;&#x65e5;&#x671f;/&#x65f6;&#x95f4;API&#x4e5f;&#x662f;&#x9664;Java&#x6838;&#x5fc3;API&#x4ee5;&#x5916;&#x53e6;&#x4e00;&#x9879;&#x500d;&#x53d7;&#x6b22;&#x8fce;&#x7684;&#x5185;&#x5bb9;&#x3002;&#x8be6;&#x60c5;&#x8bf7;&#x53c2;&#x8003;<a class="externalLink" href="http://www.importnew.com/14140.html">Java8 &#x65e5;&#x671f;/&#x65f6;&#x95f4;&#xff08;Date Time&#xff09;API&#x6307;&#x5357;</a></p>
<p>java 8 &#x4e2d;&#x65b0;&#x589e;&#x52a0;&#x7684;java.time &#x5305;&#x542b;&#x5bf9;&#x65e5;&#x671f;&#xff0c;&#x65f6;&#x95f4;&#xff0c;&#x77ac;&#x95f4;&#x3001;&#x6301;&#x7eed;&#x65f6;&#x95f4;&#x64cd;&#x4f5c;&#x7684;&#x4e3b;&#x8981;API&#x3002;java.time.* &#x5305;&#x7ed3;&#x6784;&#x5982;&#x4e0b;&#xff1a;</p>
</blockquote>

<table border="0" class="bodyTable">
  <thead>
    
<tr class="a">
      
<th>&#x5305;&#x540d; </th>
      
<th>&#x63cf;&#x8ff0;</th>
    </tr>
  </thead>
  <tbody>
    
<tr class="b">
      
<td>java.time </td>
      
<td>&#x8fd9;&#x662f;&#x65b0;&#x7684;Java&#x65e5;&#x671f;/&#x65f6;&#x95f4;API&#x7684;&#x57fa;&#x7840;&#x5305;&#xff0c;&#x6240;&#x6709;&#x7684;&#x4e3b;&#x8981;&#x57fa;&#x7840;&#x7c7b;&#x90fd;&#x662f;&#x8fd9;&#x4e2a;&#x5305;&#x7684;&#x4e00;&#x90e8;&#x5206;&#xff0c;&#x5982; LocalDate, LocalTime, LocalDateTime, Instant, Period, Duration&#x7b49;&#x7b49;&#x3002;&#x6240;&#x6709;&#x8fd9;&#x4e9b;&#x7c7b;&#x90fd;&#x662f;&#x4e0d;&#x53ef;&#x53d8;&#x7684;&#x548c;&#x7ebf;&#x7a0b;&#x5b89;&#x5168;&#x7684;&#xff0c;&#x5728;&#x7edd;&#x5927;&#x591a;&#x6570;&#x60c5;&#x51b5;&#x4e0b;&#xff0c;&#x8fd9;&#x4e9b;&#x7c7b;&#x80fd;&#x591f;&#x6709;&#x6548;&#x5730;&#x5904;&#x7406;&#x4e00;&#x4e9b;&#x516c;&#x5171;&#x7684;&#x9700;&#x6c42;&#x3002;</td>
    </tr>
    
<tr class="a">
      
<td>java.time.chrono </td>
      
<td>&#x8fd9;&#x4e2a;&#x5305;&#x4e3a;&#x975e;ISO&#x7684;&#x65e5;&#x5386;&#x7cfb;&#x7edf;&#x5b9a;&#x4e49;&#x4e86;&#x4e00;&#x4e9b;&#x6cdb;&#x5316;&#x7684;API&#xff0c;&#x6211;&#x4eec;&#x53ef;&#x4ee5;&#x6269;&#x5c55;AbstractChronology&#x7c7b;&#x6765;&#x521b;&#x5efa;&#x81ea;&#x5df1;&#x7684;&#x65e5;&#x5386;&#x7cfb;&#x7edf;&#x3002;</td>
    </tr>
    
<tr class="b">
      
<td>java.time.format </td>
      
<td>&#x8fd9;&#x4e2a;&#x5305;&#x5305;&#x542b;&#x80fd;&#x591f;&#x683c;&#x5f0f;&#x5316;&#x548c;&#x89e3;&#x6790;&#x65e5;&#x671f;&#x65f6;&#x95f4;&#x5bf9;&#x8c61;&#x7684;&#x7c7b;&#xff0c;&#x5728;&#x7edd;&#x5927;&#x591a;&#x6570;&#x60c5;&#x51b5;&#x4e0b;&#xff0c;&#x6211;&#x4eec;&#x4e0d;&#x5e94;&#x8be5;&#x76f4;&#x63a5;&#x4f7f;&#x7528;&#x5b83;&#x4eec;&#xff0c;&#x56e0;&#x4e3a;java.time&#x5305;&#x4e2d;&#x76f8;&#x5e94;&#x7684;&#x7c7b;&#x5df2;&#x7ecf;&#x63d0;&#x4f9b;&#x4e86;&#x683c;&#x5f0f;&#x5316;&#x548c;&#x89e3;&#x6790;&#x7684;&#x65b9;&#x6cd5;&#x3002;</td>
    </tr>
    
<tr class="a">
      
<td>java.time.temporal </td>
      
<td>&#x8fd9;&#x4e2a;&#x5305;&#x5305;&#x542b;&#x4e00;&#x4e9b;&#x65f6;&#x6001;&#x5bf9;&#x8c61;&#xff0c;&#x6211;&#x4eec;&#x53ef;&#x4ee5;&#x7528;&#x5176;&#x627e;&#x51fa;&#x5173;&#x4e8e;&#x65e5;&#x671f;/&#x65f6;&#x95f4;&#x5bf9;&#x8c61;&#x7684;&#x67d0;&#x4e2a;&#x7279;&#x5b9a;&#x65e5;&#x671f;&#x6216;&#x65f6;&#x95f4;&#xff0c;&#x6bd4;&#x5982;&#x8bf4;&#xff0c;&#x53ef;&#x4ee5;&#x627e;&#x5230;&#x67d0;&#x6708;&#x7684;&#x7b2c;&#x4e00;&#x5929;&#x6216;&#x6700;&#x540e;&#x4e00;&#x5929;&#x3002;&#x4f60;&#x53ef;&#x4ee5;&#x975e;&#x5e38;&#x5bb9;&#x6613;&#x5730;&#x8ba4;&#x51fa;&#x8fd9;&#x4e9b;&#x65b9;&#x6cd5;&#xff0c;&#x56e0;&#x4e3a;&#x5b83;&#x4eec;&#x90fd;&#x5177;&#x6709;&#x201c;withXXX&#x201d;&#x7684;&#x683c;&#x5f0f;&#x3002;</td>
    </tr>
    
<tr class="b">
      
<td>java.time.zone </td>
      
<td>&#x8fd9;&#x4e2a;&#x5305;&#x5305;&#x542b;&#x652f;&#x6301;&#x4e0d;&#x540c;&#x65f6;&#x533a;&#x4ee5;&#x53ca;&#x76f8;&#x5173;&#x89c4;&#x5219;&#x7684;&#x7c7b;&#x3002;</td>
    </tr>
  </tbody>
</table></div>
<div class="section">
<h2><a name="a2_"></a>2 &#x5e38;&#x7528;&#x7684;&#x51e0;&#x4e2a;&#x7c7b;</h2>

<table border="0" class="bodyTable">
  <thead>
    
<tr class="a">
      
<th>&#x7c7b;&#x540d; </th>
      
<th>&#x63cf;&#x8ff0;</th>
    </tr>
  </thead>
  <tbody>
    
<tr class="b">
      
<td>Instant </td>
      
<td>&#x8868;&#x793a;&#x67d0;&#x4e00;&#x4e2a;&#x65f6;&#x95f4;&#x70b9;&#x7684;&#x65f6;&#x95f4;&#x6233;&#xff0c;&#x53ef;&#x4ee5;&#x7c7b;&#x6bd4;&#x4e8e;java.uti.Date&#x3002;&#x652f;&#x6301;&#x5404;&#x79cd;&#x8fd0;&#x7b97;&#x64cd;&#x4f5c;</td>
    </tr>
    
<tr class="a">
      
<td>Duration </td>
      
<td>&#x8868;&#x793a;Instant&#x4e4b;&#x95f4;&#x7684;&#x65f6;&#x95f4;&#x5dee;&#xff0c;&#x53ef;&#x4ee5;&#x7528;&#x6765;&#x7edf;&#x8ba1;&#x4efb;&#x52a1;&#x7684;&#x6267;&#x884c;&#x65f6;&#x95f4;&#xff0c;&#x4e5f;&#x652f;&#x6301;&#x5404;&#x79cd;&#x8fd0;&#x7b97;&#x64cd;&#x4f5c;</td>
    </tr>
    
<tr class="b">
      
<td>LocalDate </td>
      
<td>&#x7528;&#x4e8e;&#x8868;&#x793a;&#x65e5;&#x671f;&#xff0c;&#x4e0e;&#x65f6;&#x533a;(TimeZone)&#x65e0;&#x5173;&#x3002;</td>
    </tr>
    
<tr class="a">
      
<td>Period </td>
      
<td>&#x7528;&#x6765;&#x8868;&#x793a;&#x4e24;&#x4e2a;LocalDate&#x4e4b;&#x95f4;&#x7684;&#x65f6;&#x95f4;&#x5dee;&#xff0c;&#x652f;&#x6301;&#x5404;&#x79cd;&#x8fd0;&#x7b97;&#x64cd;&#x4f5c;</td>
    </tr>
    
<tr class="b">
      
<td>TemporalAdjusters </td>
      
<td>&#x7528;&#x4e8e;&#x8868;&#x793a;&#x67d0;&#x4e2a;&#x6708;&#x7b2c;&#x4e00;&#x5929;&#x3001;&#x4e0b;&#x4e2a;&#x5468;&#x4e00;&#x7b49;&#x65e5;&#x671f;</td>
    </tr>
    
<tr class="a">
      
<td>LocalTime </td>
      
<td>&#x8868;&#x793a;&#x65f6;&#x95f4;&#xff0c;&#x6ca1;&#x6709;&#x65e5;&#x671f;&#xff0c;&#x4e0e;&#x65f6;&#x533a;(TimeZone)&#x65e0;&#x5173;</td>
    </tr>
    
<tr class="b">
      
<td>LocalDateTime </td>
      
<td>&#x8868;&#x793a;&#x65e5;&#x671f;&#x548c;&#x65f6;&#x95f4;&#xff0c;&#x9002;&#x7528;&#x4e8e;&#x65f6;&#x533a;&#x56fa;&#x5b9a;&#x4e0d;&#x53d8;&#x7684;&#x573a;&#x5408;(LocalDateTime&#x4f7f;&#x7528;&#x7cfb;&#x7edf;&#x9ed8;&#x8ba4;&#x7684;&#x65f6;&#x533a;)&#xff0c;&#x5982;&#x679c;&#x9700;&#x8981;&#x6839;&#x636e;&#x65f6;&#x533a;&#x8c03;&#x6574;&#x65e5;&#x671f;&#x548c;&#x65f6;&#x95f4;&#xff0c;&#x5e94;&#x8be5;&#x4f7f;&#x7528;ZonedDateTime</td>
    </tr>
    
<tr class="a">
      
<td>ZonedDateTime </td>
      
<td>&#x8868;&#x793a;&#x5e26;&#x65f6;&#x533a;&#x7684;&#x65e5;&#x671f;&#x548c;&#x65f6;&#x95f4;&#xff0c;&#x652f;&#x6301;&#x7684;&#x64cd;&#x4f5c;&#x4e0e;LocalDateTime&#x975e;&#x5e38;&#x7c7b;&#x4f3c;</td>
    </tr>
  </tbody>
</table>
<div class="section">
<h3><a name="a2.1_java.time.LocalDate"></a>2.1 java.time.LocalDate</h3>

<blockquote>
<p>&#x5728;ISO-8601&#x65e5;&#x5386;&#x7cfb;&#x7edf;&#x4e2d;&#x6ca1;&#x6709;&#x65f6;&#x533a;&#x7684;&#x65e5;&#x671f;&#xff0c;&#x5982;2007-12-03&#x3002;</p>
<p>LocalDate&#x662f;&#x4e00;&#x4e2a;&#x4e0d;&#x53ef;&#x53d8;&#x7684;&#x65e5;&#x671f;&#x65f6;&#x95f4;&#x5bf9;&#x8c61;&#xff0c;&#x8868;&#x793a;&#x65e5;&#x671f;&#xff0c;&#x901a;&#x5e38;&#x88ab;&#x89c6;&#x4e3a;<b>&#x5e74;&#x6708;&#x65e5;</b>&#x3002; &#x4e5f;&#x53ef;&#x4ee5;&#x8bbf;&#x95ee;&#x5176;&#x4ed6;&#x65e5;&#x671f;&#x5b57;&#x6bb5;&#xff0c;&#x4f8b;&#x5982;&#x65e5;&#x671f;&#xff0c;&#x661f;&#x671f;&#x51e0;&#x548c;&#x661f;&#x671f;&#x3002; &#x4f8b;&#x5982;&#xff0c;&#x201c;2007&#x5e74;10&#x6708;2&#x65e5;&#x201d;&#x53ef;&#x4ee5;&#x5b58;&#x50a8;&#x5728;LocalDate&#x4e2d;&#x3002;</p>
<p>&#x8be5;&#x7c7b;&#x4e0d;&#x5b58;&#x50a8;&#x6216;&#x8868;&#x793a;&#x65f6;&#x95f4;&#x6216;&#x65f6;&#x533a;&#x3002;&#x76f8;&#x53cd;&#xff0c;&#x5b83;&#x662f;&#x65e5;&#x671f;&#x7684;&#x63cf;&#x8ff0;&#xff0c;&#x7528;&#x4e8e;&#x751f;&#x65e5;&#x3002;&#x5b83;&#x4e0d;&#x80fd;&#x8868;&#x793a;&#x65f6;&#x95f4;&#x7ebf;&#x4e0a;&#x7684;&#x77ac;&#x65f6;&#xff0c;&#x6ca1;&#x6709;&#x9644;&#x52a0;&#x4fe1;&#x606f;&#xff0c;&#x5982;&#x504f;&#x79fb;&#x6216;&#x65f6;&#x533a;&#x3002;</p>
<p>ISO-8601&#x65e5;&#x5386;&#x7cfb;&#x7edf;&#x662f;&#x5f53;&#x4eca;&#x4e16;&#x754c;&#x7edd;&#x5927;&#x591a;&#x6570;&#x7684;&#x73b0;&#x4ee3;&#x6c11;&#x7528;&#x65e5;&#x5386;&#x7cfb;&#x7edf;&#x3002;&#x5b83;&#x76f8;&#x5f53;&#x4e8e;&#x5982;&#x4eca;&#x7684;&#x95f0;&#x5e74;&#x89c4;&#x5219;&#x4e00;&#x76f4;&#x9002;&#x7528;&#x4e8e;&#x65e5;&#x5e38;&#x751f;&#x6d3b;&#x7684;&#x516c;&#x5386;&#x65e5;&#x5386;&#x7cfb;&#x7edf;&#x3002; &#x5bf9;&#x4e8e;&#x5f53;&#x524d;&#x5199;&#x7684;&#x5927;&#x591a;&#x6570;&#x5e94;&#x7528;&#xff0c;ISO-8601&#x89c4;&#x5219;&#x662f;&#x5b8c;&#x5168;&#x5408;&#x9002;&#x7684;&#x3002;&#x7136;&#x800c;&#xff0c;&#x4efb;&#x4f55;&#x5229;&#x7528;&#x5386;&#x53f2;&#x65e5;&#x671f;&#x5e76;&#x8981;&#x6c42;&#x5b83;&#x4eec;&#x51c6;&#x786e;&#x7684;&#x5e94;&#x7528;&#x7a0b;&#x5e8f;&#x90fd;&#x5c06;&#x53d1;&#x73b0;ISO-8601&#x65b9;&#x6cd5;&#x4e0d;&#x5408;&#x9002;&#x3002;</p>
</blockquote></div>
<div class="section">
<h3><a name="a2.2_java.time.LocalTime"></a>2.2 java.time.LocalTime</h3>

<blockquote>
<p>LocalTime &#x548c; LocalDate &#x5177;&#x6709;&#x6bd4;&#x8f83;&#x76f8;&#x4f3c;&#x7684;API&#x63a5;&#x53e3;&#x3002;&#x8868;&#x793a; ISO-8601&#x65e5;&#x5386;&#x7cfb;&#x7edf;&#x4e2d;&#x6ca1;&#x6709;&#x65f6;&#x533a;&#x7684;&#x65f6;&#x95f4;&#xff0c;&#x5982;10:15:30&#x3002;</p>
<p>LocalTime&#x662f;&#x4e00;&#x4e2a;&#x4e0d;&#x53ef;&#x53d8;&#x7684;&#x65e5;&#x671f;&#x65f6;&#x95f4;&#x5bf9;&#x8c61;&#xff0c;&#x4ee3;&#x8868;&#x4e00;&#x4e2a;&#x65f6;&#x95f4;&#xff0c;&#x901a;&#x5e38;&#x88ab;&#x89c6;&#x4e3a;&#x65f6;&#x5206;&#x79d2;&#x3002; &#x65f6;&#x95f4;&#x8868;&#x793a;&#x4e3a;&#x7eb3;&#x79d2;&#x7cbe;&#x5ea6;&#x3002; &#x4f8b;&#x5982;&#xff0c;&#x503c;&#x201c;13&#xff1a;45.30.123456789&#x201d;&#x53ef;&#x4ee5;&#x5b58;&#x50a8;&#x5728;LocalTime&#x4e2d;&#x3002;</p>
<p>ISO-8601&#x65e5;&#x5386;&#x7cfb;&#x7edf;&#x662f;&#x5f53;&#x4eca;&#x4e16;&#x754c;&#x7edd;&#x5927;&#x591a;&#x6570;&#x7684;&#x73b0;&#x4ee3;&#x6c11;&#x7528;&#x65e5;&#x5386;&#x7cfb;&#x7edf;&#x3002; &#x8be5;API&#x5047;&#x5b9a;&#x6240;&#x6709;&#x65e5;&#x5386;&#x7cfb;&#x7edf;&#x5728;&#x65f6;&#x95f4;&#x4e0a;&#x4f7f;&#x7528;&#x76f8;&#x540c;&#x7684;&#x8868;&#x793a;&#xff0c;&#x8fd9;&#x4e2a;&#x7c7b;&#x3002;</p>
<p>&#x8be5;&#x7c7b;&#x4e0d;&#x5b58;&#x50a8;&#x6216;&#x8868;&#x793a;&#x65e5;&#x671f;&#x6216;&#x65f6;&#x533a;&#x3002;&#x76f8;&#x53cd;&#xff0c;&#x5b83;&#x662f;&#x5f53;&#x5730;&#x65f6;&#x95f4;&#x7684;&#x63cf;&#x8ff0;&#xff0c;&#x5982;&#x5728;&#x6302;&#x949f;&#x4e0a;&#x770b;&#x5230;&#x7684;&#x3002; &#x5b83;&#x4e0d;&#x80fd;&#x8868;&#x793a;&#x65f6;&#x95f4;&#x7ebf;&#x4e0a;&#x7684;&#x77ac;&#x65f6;&#xff0c;&#x6ca1;&#x6709;&#x9644;&#x52a0;&#x4fe1;&#x606f;&#xff0c;&#x5982;&#x504f;&#x79fb;&#x6216;&#x65f6;&#x533a;&#x3002;</p>
</blockquote></div>
<div class="section">
<h3><a name="a2.3_java.time.LocalDateTime"></a>2.3 java.time.LocalDateTime</h3>

<blockquote>
<p>&#x63d0;&#x4f9b;&#x5305;&#x542b;&#x65e5;&#x671f;&#x548c;&#x65f6;&#x95f4;&#x7684;API&#x63a5;&#x53e3;&#x3002;LocalDateTime&#x662f;&#x4e00;&#x4e2a;&#x4e0d;&#x53ef;&#x53d8;&#x7684;&#x65e5;&#x671f;-&#x65f6;&#x95f4;&#x5bf9;&#x8c61;&#xff0c;&#x5b83;&#x8868;&#x793a;&#x4e00;&#x7ec4;&#x65e5;&#x671f;-&#x65f6;&#x95f4;&#xff0c;&#x9ed8;&#x8ba4;&#x683c;&#x5f0f;&#x662f;yyyy-MM-dd-HH-mm-ss.zzz&#x3002; &#x5b83;&#x63d0;&#x4f9b;&#x4e86;&#x4e00;&#x4e2a;&#x5de5;&#x5382;&#x65b9;&#x6cd5;&#xff0c;&#x63a5;&#x6536;LocalDate&#x548c;LocalTime&#x8f93;&#x5165;&#x53c2;&#x6570;&#xff0c;&#x521b;&#x5efa;LocalDateTime&#x5b9e;&#x4f8b;&#x3002;</p>
</blockquote></div>
<div class="section">
<h3><a name="a2.4_java.time.ZonedDateTime"></a>2.4 java.time.ZonedDateTime</h3>

<blockquote>
<p>ISO-8601&#x65e5;&#x5386;&#x7cfb;&#x7edf;&#x4e2d;&#x7684;&#x65e5;&#x671f;&#x65f6;&#x95f4;&#xff0c;&#x5982;2007-12-03T10&#xff1a;15&#xff1a;30 + 01&#xff1a;00&#x6b27;&#x6d32;/&#x5df4;&#x9ece;&#x3002;</p>
<p>ZonedDateTime&#x662f;&#x5177;&#x6709;&#x65f6;&#x533a;&#x7684;&#x65e5;&#x671f;&#x65f6;&#x95f4;&#x7684;&#x4e0d;&#x53ef;&#x53d8;&#x8868;&#x793a;&#x3002; &#x6b64;&#x7c7b;&#x5b58;&#x50a8;&#x6240;&#x6709;&#x65e5;&#x671f;&#x548c;&#x65f6;&#x95f4;&#x5b57;&#x6bb5;&#xff0c;&#x7cbe;&#x5ea6;&#x4e3a;&#x7eb3;&#x79d2;&#xff0c;&#x65f6;&#x533a;&#x4e3a;&#x533a;&#x57df;&#x504f;&#x79fb;&#x91cf;&#xff0c;&#x7528;&#x4e8e;&#x5904;&#x7406;&#x6a21;&#x7cca;&#x7684;&#x672c;&#x5730;&#x65e5;&#x671f;&#x65f6;&#x95f4;&#x3002; &#x4f8b;&#x5982;&#xff0c;&#x503c;&#x201c;2007&#x5e74;10&#x6708;2&#x65e5;&#x5728;13&#xff1a;45.30.123456789 +&#x6b27;&#x6d32;/&#x5df4;&#x9ece;&#x65f6;&#x533a;&#x7684;+02&#xff1a;00&#x201d;&#x53ef;&#x4ee5;&#x5b58;&#x50a8;&#x5728;ZonedDateTime&#x4e2d;&#x3002;</p>
</blockquote></div>
<div class="section">
<h3><a name="a2.5_java.time.Clock"></a>2.5 java.time.Clock</h3>

<blockquote>
<p>&#x4f7f;&#x7528;&#x65f6;&#x533a;&#x63d0;&#x4f9b;&#x5bf9;&#x5f53;&#x524d;&#x5373;&#x65f6;&#xff0c;&#x65e5;&#x671f;&#x548c;&#x65f6;&#x95f4;&#x7684;&#x8bbf;&#x95ee;&#x7684;&#x65f6;&#x949f;&#x3002;</p>
<p>&#x8be5;&#x7c7b;&#x7684;&#x5b9e;&#x4f8b;&#x7528;&#x4e8e;&#x67e5;&#x627e;&#x5f53;&#x524d;&#x65f6;&#x523b;&#xff0c;&#x53ef;&#x4ee5;&#x4f7f;&#x7528;&#x5b58;&#x50a8;&#x7684;&#x65f6;&#x533a;&#x6765;&#x89e3;&#x91ca;&#x5f53;&#x524d;&#x65f6;&#x523b;&#xff0c;&#x4ee5;&#x67e5;&#x627e;&#x5f53;&#x524d;&#x65e5;&#x671f;&#x548c;&#x65f6;&#x95f4;&#x3002; &#x56e0;&#x6b64;&#xff0c;&#x53ef;&#x4ee5;&#x4f7f;&#x7528;&#x65f6;&#x949f;&#x4ee3;&#x66ff;System.currentTimeMillis()&#x548c;TimeZone.getDefault()&#x3002;</p>
<p>&#x4f7f;&#x7528;&#x65f6;&#x949f;&#x662f;&#x53ef;&#x9009;&#x7684;&#x3002;&#x6240;&#x6709;&#x5173;&#x952e;&#x7684;&#x65e5;&#x671f;&#x65f6;&#x95f4;&#x7c7b;&#x4e5f;&#x6709;&#x4e00;&#x4e2a;now()&#x5de5;&#x5382;&#x65b9;&#x6cd5;&#xff0c;&#x5b83;&#x4f7f;&#x7528;&#x9ed8;&#x8ba4;&#x65f6;&#x533a;&#x4e2d;&#x7684;&#x7cfb;&#x7edf;&#x65f6;&#x949f;&#x3002; &#x8fd9;&#x79cd;&#x62bd;&#x8c61;&#x7684;&#x4e3b;&#x8981;&#x76ee;&#x7684;&#x662f;&#x5141;&#x8bb8;&#x5728;&#x9700;&#x8981;&#x65f6;&#x63d2;&#x5165;&#x5907;&#x7528;&#x65f6;&#x949f;&#x3002; &#x5e94;&#x7528;&#x7a0b;&#x5e8f;&#x4f7f;&#x7528;&#x5bf9;&#x8c61;&#x83b7;&#x53d6;&#x5f53;&#x524d;&#x65f6;&#x95f4;&#xff0c;&#x800c;&#x4e0d;&#x662f;&#x9759;&#x6001;&#x65b9;&#x6cd5;&#x3002;&#x8fd9;&#x53ef;&#x4ee5;&#x7b80;&#x5316;&#x6d4b;&#x8bd5;&#x3002;</p>
</blockquote></div>
<div class="section">
<h3><a name="a2.6_java.time.Instant"></a>2.6 java.time.Instant</h3>

<blockquote>
<p>Instant&#x7c7b;&#x662f;&#x7528;&#x5728;&#x673a;&#x5668;&#x53ef;&#x8bfb;&#x7684;&#x65f6;&#x95f4;&#x683c;&#x5f0f;&#x4e0a;&#x7684;&#xff0c;&#x5b83;&#x4ee5;Unix&#x65f6;&#x95f4;&#x6233;&#x7684;&#x5f62;&#x5f0f;&#x5b58;&#x50a8;&#x65e5;&#x671f;&#x65f6;&#x95f4;&#x3002; Instant&#x8868;&#x793a;&#x67d0;&#x4e00;&#x4e2a;&#x65f6;&#x95f4;&#x70b9;&#x7684;&#x65f6;&#x95f4;&#x6233;&#xff0c;&#x53ef;&#x4ee5;&#x7c7b;&#x6bd4;&#x4e8e;java.uti.Date&#x3002;</p>
</blockquote></div></div>
<div class="section">
<h2><a name="a3_"></a>3 &#x5e38;&#x7528;&#x7684;&#x65e5;&#x671f;&#x64cd;&#x4f5c;</h2>
<div class="section">
<h3><a name="a3.1_"></a>3.1 &#x65e5;&#x671f;&#x8ba1;&#x7b97;</h3></div>
<div class="section">
<h3><a name="a3.2_"></a>3.2 &#x65e5;&#x671f;&#x683c;&#x5f0f;&#x5316;</h3>

<blockquote>
<p>java.time.format &#x5305;&#x63d0;&#x4f9b;&#x6253;&#x5370;&#x548c;&#x89e3;&#x6790;&#x65e5;&#x671f;&#x548c;&#x65f6;&#x95f4;&#x7684;&#x7c7b;&#x3002;</p>
</blockquote></div></div>
      </div>
    </div>
    <div class="clear">
      <hr/>
    </div>
    <div id="footer">
      <div class="xright">
              Copyright &#169;                   2017.
          All rights reserved.    
                  </div>
      <div class="clear">
        <hr/>
      </div>
    </div>
  </body>
</html>
