<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!-- Generated by Apache Maven Doxia Site Renderer 1.7.4 at 2018-05-05 -->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en">
  <head>
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
    <title>language-feature &#x2013; Synchronized 和 volatile区别</title>
    <style type="text/css" media="all">
      @import url("./css/maven-base.css");
      @import url("./css/maven-theme.css");
      @import url("./css/site.css");
    </style>
    <link rel="stylesheet" href="./css/print.css" type="text/css" media="print" />
    <meta http-equiv="Content-Language" content="en" />
        
        </head>
  <body class="composite">
    <div id="banner">
                    <div id="bannerLeft">
                language-feature
                </div>
                    <div class="clear">
        <hr/>
      </div>
    </div>
    <div id="breadcrumbs">
          
                <div class="xleft">
        <span id="publishDate">Last Published: 2018-05-05</span>
                  &nbsp;| <span id="projectVersion">Version: 1.0-SNAPSHOT</span>
                      </div>
            <div class="xright">                    <a href="./" title="language-feature">language-feature</a>
            
      </div>
      <div class="clear">
        <hr/>
      </div>
    </div>
    <div id="leftColumn">
      <div id="navcolumn">
           
                                <h5>Parent Project</h5>
                  <ul>
                  <li class="none">
                          <a href="../index.html" title="java-learn">java-learn</a>
            </li>
          </ul>
                       <h5>Project Documentation</h5>
                  <ul>
                                                                                                                                                                                                                                                        <li class="collapsed">
                          <a href="project-info.html" title="Project Information">Project Information</a>
                  </li>
                                                                                      <li class="collapsed">
                          <a href="project-reports.html" title="Project Reports">Project Reports</a>
                  </li>
          </ul>
                             <a href="http://maven.apache.org/" title="Built by Maven" class="poweredBy">
        <img class="poweredBy" alt="Built by Maven" src="./images/logos/maven-feather.png" />
      </a>
                 
            </div>
    </div>
    <div id="bodyColumn">
      <div id="contentBox">
        <h1>Synchronized &#x548c; volatile&#x533a;&#x522b;</h1>
<div class="section">
<h2><a name="volatile"></a>volatile</h2>
<p>volatile&#x539f;&#x7406;&#x662f;&#x57fa;&#x4e8e;CPU&#x5185;&#x5b58;&#x5c4f;&#x969c;&#x6307;&#x4ee4;&#x5b9e;&#x73b0;&#x7684;&#x3002;</p></div>
<div class="section">
<h2><a name="synchronized"></a>synchronized</h2>
<p>synchronized&#x4ee3;&#x7801;&#x5757;&#x4e5f;&#x80fd;&#x4fdd;&#x8bc1;&#x4ee3;&#x7801;&#x5757;&#x4e2d;&#x6240;&#x6709;&#x53d8;&#x91cf;&#x90fd;&#x5c06;&#x4f1a;&#x4ece;&#x4e3b;&#x5b58;&#x4e2d;&#x8bfb;&#xff0c;&#x5f53;&#x7ebf;&#x7a0b;&#x9000;&#x51fa;&#x4ee3;&#x7801;&#x5757;&#x65f6;&#xff0c;&#x5bf9;&#x6240;&#x6709;&#x53d8;&#x91cf;&#x7684;&#x66f4;&#x65b0;&#x5c06;&#x4f1a;flush&#x5230;&#x4e3b;&#x5b58;&#xff0c;&#x4e0d;&#x7ba1;&#x8fd9;&#x4e9b;&#x53d8;&#x91cf;&#x662f;&#x4e0d;&#x662f;volatile&#x7c7b;&#x578b;&#x7684;&#x3002;</p></div>
<div class="section">
<h2><a name="aJava"></a>&#x652f;&#x6491;Java&#x5185;&#x5b58;&#x6a21;&#x578b;&#x7684;&#x57fa;&#x7840;&#x539f;&#x7406;</h2>
<div class="section">
<h3><a name="a"></a>&#x6307;&#x4ee4;&#x91cd;&#x6392;&#x5e8f;</h3>

<blockquote>
<p>&#x5728;&#x6267;&#x884c;&#x7a0b;&#x5e8f;&#x65f6;&#xff0c;&#x4e3a;&#x4e86;&#x63d0;&#x9ad8;&#x6027;&#x80fd;&#xff0c;&#x7f16;&#x8bd1;&#x5668;&#x548c;&#x5904;&#x7406;&#x5668;&#x4f1a;&#x5bf9;&#x6307;&#x4ee4;&#x505a;&#x91cd;&#x6392;&#x5e8f;&#x3002;&#x4f46;&#x662f;&#xff0c;JMM&#x786e;&#x4fdd;&#x5728;&#x4e0d;&#x540c;&#x7684;&#x7f16;&#x8bd1;&#x5668;&#x548c;&#x4e0d;&#x540c;&#x7684;&#x5904;&#x7406;&#x5668;&#x5e73;&#x53f0;&#x4e4b;&#x4e0a;&#xff0c;&#x901a;&#x8fc7;&#x63d2;&#x5165;&#x7279;&#x5b9a;&#x7c7b;&#x578b;&#x7684;Memory Barrier&#x6765;&#x7981;&#x6b62;&#x7279;&#x5b9a;&#x7c7b;&#x578b;&#x7684;&#x7f16;&#x8bd1;&#x5668;&#x91cd;&#x6392;&#x5e8f;&#x548c;&#x5904;&#x7406;&#x5668;&#x91cd;&#x6392;&#x5e8f;&#xff0c;&#x4e3a;&#x4e0a;&#x5c42;&#x63d0;&#x4f9b;&#x4e00;&#x81f4;&#x7684;&#x5185;&#x5b58;&#x53ef;&#x89c1;&#x6027;&#x4fdd;&#x8bc1;&#x3002;</p>
  
<ul>
    
<li>&#x7f16;&#x8bd1;&#x5668;&#x4f18;&#x5316;&#x91cd;&#x6392;&#x5e8f;&#xff1a;&#x7f16;&#x8bd1;&#x5668;&#x5728;&#x4e0d;&#x6539;&#x53d8;&#x5355;&#x7ebf;&#x7a0b;&#x7a0b;&#x5e8f;&#x8bed;&#x4e49;&#x7684;&#x524d;&#x63d0;&#x4e0b;&#xff0c;&#x53ef;&#x4ee5;&#x91cd;&#x65b0;&#x5b89;&#x6392;&#x8bed;&#x53e5;&#x7684;&#x6267;&#x884c;&#x987a;&#x5e8f;&#x3002;</li>
    
<li>&#x6307;&#x4ee4;&#x7ea7;&#x5e76;&#x884c;&#x7684;&#x91cd;&#x6392;&#x5e8f;&#xff1a;&#x5982;&#x679c;&#x4e0d;&#x5b58;l&#x5728;&#x6570;&#x636e;&#x4f9d;&#x8d56;&#x6027;&#xff0c;&#x5904;&#x7406;&#x5668;&#x53ef;&#x4ee5;&#x6539;&#x53d8;&#x8bed;&#x53e5;&#x5bf9;&#x5e94;&#x673a;&#x5668;&#x6307;&#x4ee4;&#x7684;&#x6267;&#x884c;&#x987a;&#x5e8f;&#x3002;</li>
    
<li>&#x5185;&#x5b58;&#x7cfb;&#x7edf;&#x7684;&#x91cd;&#x6392;&#x5e8f;&#xff1a;&#x5904;&#x7406;&#x5668;&#x4f7f;&#x7528;&#x7f13;&#x5b58;&#x548c;&#x8bfb;&#x5199;&#x7f13;&#x51b2;&#x533a;&#xff0c;&#x8fd9;&#x4f7f;&#x5f97;&#x52a0;&#x8f7d;&#x548c;&#x5b58;&#x50a8;&#x64cd;&#x4f5c;&#x770b;&#x4e0a;&#x53bb;&#x53ef;&#x80fd;&#x662f;&#x5728;&#x4e71;&#x5e8f;&#x6267;&#x884c;&#x3002;</li>
  </ul>
</blockquote>
<div class="section">
<h4><a name="a"></a>&#x6570;&#x636e;&#x4f9d;&#x8d56;&#x6027;</h4>
<p>&#x5982;&#x679c;&#x4e24;&#x4e2a;&#x64cd;&#x4f5c;&#x8bbf;&#x95ee;&#x540c;&#x4e00;&#x4e2a;&#x53d8;&#x91cf;&#xff0c;&#x5176;&#x4e2d;&#x4e00;&#x4e2a;&#x4e3a;&#x5199;&#x64cd;&#x4f5c;&#xff0c;&#x6b64;&#x65f6;&#x8fd9;&#x4e24;&#x4e2a;&#x64cd;&#x4f5c;&#x4e4b;&#x95f4;&#x5b58;&#x5728;&#x6570;&#x636e;&#x4f9d;&#x8d56;&#x6027;&#x3002; &#x7f16;&#x8bd1;&#x5668;&#x548c;&#x5904;&#x7406;&#x5668;&#x4e0d;&#x4f1a;&#x6539;&#x53d8;&#x5b58;&#x5728;&#x6570;&#x636e;&#x4f9d;&#x8d56;&#x6027;&#x5173;&#x7cfb;&#x7684;&#x4e24;&#x4e2a;&#x64cd;&#x4f5c;&#x7684;&#x6267;&#x884c;&#x987a;&#x5e8f;&#xff0c;&#x5373;&#x4e0d;&#x4f1a;&#x91cd;&#x6392;&#x5e8f;&#x3002;</p></div>
<div class="section">
<h4><a name="as-if-serial"></a>as-if-serial</h4>
<p>&#x4e0d;&#x7ba1;&#x600e;&#x4e48;&#x91cd;&#x6392;&#x5e8f;&#xff0c;&#x5355;&#x7ebf;&#x7a0b;&#x4e0b;&#x7684;&#x6267;&#x884c;&#x7ed3;&#x679c;&#x4e0d;&#x80fd;&#x88ab;&#x6539;&#x53d8;&#xff0c;&#x7f16;&#x8bd1;&#x5668;&#x3001;runtime&#x548c;&#x5904;&#x7406;&#x5668;&#x90fd;&#x5fc5;&#x987b;&#x9075;&#x5b88;as-if-serial&#x8bed;&#x4e49;&#x3002;</p></div></div>
<div class="section">
<h3><a name="a"></a>&#x5185;&#x5b58;&#x5c4f;&#x969c;</h3>

<blockquote>
<p>&#x4e0a;&#x9762;&#x8bb2;&#x5230;&#x4e86;&#xff0c;&#x901a;&#x8fc7;&#x5185;&#x5b58;&#x5c4f;&#x969c;&#x53ef;&#x4ee5;&#x7981;&#x6b62;&#x7279;&#x5b9a;&#x7c7b;&#x578b;&#x5904;&#x7406;&#x5668;&#x7684;&#x91cd;&#x6392;&#x5e8f;&#xff0c;&#x4ece;&#x800c;&#x8ba9;&#x7a0b;&#x5e8f;&#x6309;&#x6211;&#x4eec;&#x9884;&#x60f3;&#x7684;&#x6d41;&#x7a0b;&#x53bb;&#x6267;&#x884c;&#x3002;&#x5185;&#x5b58;&#x5c4f;&#x969c;&#xff0c;&#x53c8;&#x79f0;&#x5185;&#x5b58;&#x6805;&#x680f;&#xff0c;&#x662f;&#x4e00;&#x4e2a;CPU&#x6307;&#x4ee4;&#xff0c;&#x57fa;&#x672c;&#x4e0a;&#x5b83;&#x662f;&#x4e00;&#x6761;&#x8fd9;&#x6837;&#x7684;&#x6307;&#x4ee4;&#xff1a;</p>
  
<ul>
    
<li>&#x4fdd;&#x8bc1;&#x7279;&#x5b9a;&#x64cd;&#x4f5c;&#x7684;&#x6267;&#x884c;&#x987a;&#x5e8f;&#x3002;</li>
    
<li>&#x5f71;&#x54cd;&#x67d0;&#x4e9b;&#x6570;&#x636e;&#xff08;&#x6216;&#x5219;&#x662f;&#x67d0;&#x6761;&#x6307;&#x4ee4;&#x7684;&#x6267;&#x884c;&#x7ed3;&#x679c;&#xff09;&#x7684;&#x5185;&#x5b58;&#x53ef;&#x89c1;&#x6027;&#x3002;</li>
    
<li>&#x7f16;&#x8bd1;&#x5668;&#x548c;CPU&#x80fd;&#x591f;&#x91cd;&#x6392;&#x5e8f;&#x6307;&#x4ee4;&#xff0c;&#x4fdd;&#x8bc1;&#x6700;&#x7ec8;&#x76f8;&#x540c;&#x7684;&#x7ed3;&#x679c;&#xff0c;&#x5c1d;&#x8bd5;&#x4f18;&#x5316;&#x6027;&#x80fd;&#x3002;&#x63d2;&#x5165;&#x4e00;&#x6761;Memory Barrier&#x4f1a;&#x544a;&#x8bc9;&#x7f16;&#x8bd1;&#x5668;&#x548c;CPU&#xff1a;&#x4e0d;&#x7ba1;&#x4ec0;&#x4e48;&#x6307;&#x4ee4;&#x90fd;&#x4e0d;&#x80fd;&#x548c;&#x8fd9;&#x6761;Memory Barrier&#x6307;&#x4ee4;&#x91cd;&#x6392;&#x5e8f;&#x3002;</li>
  </ul>
<p>Memory Barrier&#x6240;&#x505a;&#x7684;&#x53e6;&#x5916;&#x4e00;&#x4ef6;&#x4e8b;&#x662f;&#x5f3a;&#x5236;&#x5237;&#x51fa;&#x5404;&#x79cd;CPU cache&#xff0c;&#x5982;&#x4e00;&#x4e2a;Write-Barrier&#xff08;&#x5199;&#x5165;&#x5c4f;&#x969c;&#xff09;&#x5c06;&#x5237;&#x51fa;&#x6240;&#x6709;&#x5728;Barrier&#x4e4b;&#x524d;&#x5199;&#x5165; cache &#x7684;&#x6570;&#x636e;&#xff0c;&#x56e0;&#x6b64;&#xff0c;&#x4efb;&#x4f55;CPU&#x4e0a;&#x7684;&#x7ebf;&#x7a0b;&#x90fd;&#x80fd;&#x8bfb;&#x53d6;&#x5230;&#x8fd9;&#x4e9b;&#x6570;&#x636e;&#x7684;&#x6700;&#x65b0;&#x7248;&#x672c;&#x3002;</p>
<p>&#x8fd9;&#x548c;java&#x6709;&#x4ec0;&#x4e48;&#x5173;&#x7cfb;&#xff1f;&#x4e0a;&#x9762;java&#x5185;&#x5b58;&#x6a21;&#x578b;&#x4e2d;&#x8bb2;&#x5230;&#x7684;volatile&#x662f;&#x57fa;&#x4e8e;Memory Barrier&#x5b9e;&#x73b0;&#x7684;&#x3002;</p>
<p>&#x5982;&#x679c;&#x4e00;&#x4e2a;&#x53d8;&#x91cf;&#x662f;volatile&#x4fee;&#x9970;&#x7684;&#xff0c;JMM&#x4f1a;&#x5728;&#x5199;&#x5165;&#x8fd9;&#x4e2a;&#x5b57;&#x6bb5;&#x4e4b;&#x540e;&#x63d2;&#x8fdb;&#x4e00;&#x4e2a;Write-Barrier&#x6307;&#x4ee4;&#xff0c;&#x5e76;&#x5728;&#x8bfb;&#x8fd9;&#x4e2a;&#x5b57;&#x6bb5;&#x4e4b;&#x524d;&#x63d2;&#x5165;&#x4e00;&#x4e2a;Read-Barrier&#x6307;&#x4ee4;&#x3002;&#x8fd9;&#x610f;&#x5473;&#x7740;&#xff0c;&#x5982;&#x679c;&#x5199;&#x5165;&#x4e00;&#x4e2a;volatile&#x53d8;&#x91cf;&#xff0c;&#x5c31;&#x53ef;&#x4ee5;&#x4fdd;&#x8bc1;&#xff1a;</p>
</blockquote>
<p>&#x4e00;&#x4e2a;&#x7ebf;&#x7a0b;&#x5199;&#x5165;&#x53d8;&#x91cf;a&#x540e;&#xff0c;&#x4efb;&#x4f55;&#x7ebf;&#x7a0b;&#x8bbf;&#x95ee;&#x8be5;&#x53d8;&#x91cf;&#x90fd;&#x4f1a;&#x62ff;&#x5230;&#x6700;&#x65b0;&#x503c;&#x3002; &#x5728;&#x5199;&#x5165;&#x53d8;&#x91cf;a&#x4e4b;&#x524d;&#x7684;&#x5199;&#x5165;&#x64cd;&#x4f5c;&#xff0c;&#x5176;&#x66f4;&#x65b0;&#x7684;&#x6570;&#x636e;&#x5bf9;&#x4e8e;&#x5176;&#x4ed6;&#x7ebf;&#x7a0b;&#x4e5f;&#x662f;&#x53ef;&#x89c1;&#x7684;&#x3002;&#x56e0;&#x4e3a;Memory Barrier&#x4f1a;&#x5237;&#x51fa;cache&#x4e2d;&#x7684;&#x6240;&#x6709;&#x5148;&#x524d;&#x7684;&#x5199;&#x5165;&#x3002;</p>
<div class="section">
<h4><a name="happens-before"></a>happens-before</h4>

<blockquote>
<p>&#x4ece;jdk5&#x5f00;&#x59cb;&#xff0c;java&#x4f7f;&#x7528;&#x65b0;&#x7684;JSR-133&#x5185;&#x5b58;&#x6a21;&#x578b;&#xff0c;&#x57fa;&#x4e8e;happens-before&#x7684;&#x6982;&#x5ff5;&#x6765;&#x9610;&#x8ff0;&#x64cd;&#x4f5c;&#x4e4b;&#x95f4;&#x7684;&#x5185;&#x5b58;&#x53ef;&#x89c1;&#x6027;&#x3002;</p>
<p>&#x5728;JMM&#x4e2d;&#xff0c;&#x5982;&#x679c;&#x4e00;&#x4e2a;&#x64cd;&#x4f5c;&#x7684;&#x6267;&#x884c;&#x7ed3;&#x679c;&#x9700;&#x8981;&#x5bf9;&#x53e6;&#x4e00;&#x4e2a;&#x64cd;&#x4f5c;&#x53ef;&#x89c1;&#xff0c;&#x90a3;&#x4e48;&#x8fd9;&#x4e24;&#x4e2a;&#x64cd;&#x4f5c;&#x4e4b;&#x95f4;&#x5fc5;&#x987b;&#x8981;&#x5b58;&#x5728;happens-before&#x5173;&#x7cfb;&#xff0c;&#x8fd9;&#x4e2a;&#x7684;&#x4e24;&#x4e2a;&#x64cd;&#x4f5c;&#x65e2;&#x53ef;&#x4ee5;&#x5728;&#x540c;&#x4e00;&#x4e2a;&#x7ebf;&#x7a0b;&#xff0c;&#x4e5f;&#x53ef;&#x4ee5;&#x5728;&#x4e0d;&#x540c;&#x7684;&#x4e24;&#x4e2a;&#x7ebf;&#x7a0b;&#x4e2d;&#x3002;</p>
<p>&#x4e0e;&#x7a0b;&#x5e8f;&#x5458;&#x5bc6;&#x5207;&#x76f8;&#x5173;&#x7684;happens-before&#x89c4;&#x5219;&#x5982;&#x4e0b;&#xff1a;</p>
  
<ul>
    
<li>&#x7a0b;&#x5e8f;&#x987a;&#x5e8f;&#x89c4;&#x5219;&#xff1a;&#x4e00;&#x4e2a;&#x7ebf;&#x7a0b;&#x4e2d;&#x7684;&#x6bcf;&#x4e2a;&#x64cd;&#x4f5c;&#xff0c;happens-before&#x4e8e;&#x8be5;&#x7ebf;&#x7a0b;&#x4e2d;&#x4efb;&#x610f;&#x7684;&#x540e;&#x7eed;&#x64cd;&#x4f5c;&#x3002;</li>
    
<li>&#x76d1;&#x89c6;&#x5668;&#x9501;&#x89c4;&#x5219;&#xff1a;&#x5bf9;&#x4e00;&#x4e2a;&#x9501;&#x7684;&#x89e3;&#x9501;&#x64cd;&#x4f5c;&#xff0c;happens-before&#x4e8e;&#x968f;&#x540e;&#x5bf9;&#x8fd9;&#x4e2a;&#x9501;&#x7684;&#x52a0;&#x9501;&#x64cd;&#x4f5c;&#x3002;</li>
    
<li>volatile&#x57df;&#x89c4;&#x5219;&#xff1a;&#x5bf9;&#x4e00;&#x4e2a;volatile&#x57df;&#x7684;&#x5199;&#x64cd;&#x4f5c;&#xff0c;happens-before&#x4e8e;&#x4efb;&#x610f;&#x7ebf;&#x7a0b;&#x540e;&#x7eed;&#x5bf9;&#x8fd9;&#x4e2a;volatile&#x57df;&#x7684;&#x8bfb;&#x3002;</li>
    
<li>&#x4f20;&#x9012;&#x6027;&#x89c4;&#x5219;&#xff1a;&#x5982;&#x679c; A happens-before B&#xff0c;&#x4e14; B happens-before C&#xff0c;&#x90a3;&#x4e48;A happens-before C&#x3002;</li>
    
<li>&#x6ce8;&#x610f;&#xff1a;&#x4e24;&#x4e2a;&#x64cd;&#x4f5c;&#x4e4b;&#x95f4;&#x5177;&#x6709;happens-before&#x5173;&#x7cfb;&#xff0c;&#x5e76;&#x4e0d;&#x610f;&#x5473;&#x524d;&#x4e00;&#x4e2a;&#x64cd;&#x4f5c;&#x5fc5;&#x987b;&#x8981;&#x5728;&#x540e;&#x4e00;&#x4e2a;&#x64cd;&#x4f5c;&#x4e4b;&#x524d;&#x6267;&#x884c;&#xff01;&#x4ec5;&#x4ec5;&#x8981;&#x6c42;&#x524d;&#x4e00;&#x4e2a;&#x64cd;&#x4f5c;&#x7684;&#x6267;&#x884c;&#x7ed3;&#x679c;&#xff0c;&#x5bf9;&#x4e8e;&#x540e;&#x4e00;&#x4e2a;&#x64cd;&#x4f5c;&#x662f;&#x53ef;&#x89c1;&#x7684;&#xff0c;&#x4e14;&#x524d;&#x4e00;&#x4e2a;&#x64cd;&#x4f5c;&#x6309;&#x987a;&#x5e8f;&#x6392;&#x5728;&#x540e;&#x4e00;&#x4e2a;&#x64cd;&#x4f5c;&#x4e4b;&#x524d;&#x3002;</li>
  </ul>
</blockquote></div></div></div>
<div class="section">
<h2><a name="a"></a>&#x533a;&#x522b;</h2>

<blockquote>
  
<ul>
    
<li>volatile&#x672c;&#x8d28;&#x662f;&#x5728;&#x544a;&#x8bc9;jvm&#x5f53;&#x524d;&#x53d8;&#x91cf;&#x5728;&#x5bc4;&#x5b58;&#x5668;&#xff08;&#x5de5;&#x4f5c;&#x5185;&#x5b58;&#xff09;&#x4e2d;&#x7684;&#x503c;&#x662f;&#x4e0d;&#x786e;&#x5b9a;&#x7684;&#xff0c;&#x9700;&#x8981;&#x4ece;&#x4e3b;&#x5b58;&#x4e2d;&#x8bfb;&#x53d6;&#xff1b; synchronized&#x5219;&#x662f;&#x9501;&#x5b9a;&#x5f53;&#x524d;&#x53d8;&#x91cf;&#xff0c;&#x53ea;&#x6709;&#x5f53;&#x524d;&#x7ebf;&#x7a0b;&#x53ef;&#x4ee5;&#x8bbf;&#x95ee;&#x8be5;&#x53d8;&#x91cf;&#xff0c;&#x5176;&#x4ed6;&#x7ebf;&#x7a0b;&#x88ab;&#x963b;&#x585e;&#x4f4f;&#x3002;</li>
    
<li>volatile&#x4ec5;&#x80fd;&#x4f7f;&#x7528;&#x5728;&#x53d8;&#x91cf;&#x7ea7;&#x522b;&#xff1b; synchronized&#x5219;&#x53ef;&#x4ee5;&#x4f7f;&#x7528;&#x5728;&#x53d8;&#x91cf;&#x3001;&#x65b9;&#x6cd5;&#x3001;&#x548c;&#x7c7b;&#x7ea7;&#x522b;&#x7684;</li>
    
<li>volatile&#x4ec5;&#x80fd;&#x5b9e;&#x73b0;&#x53d8;&#x91cf;&#x7684;&#x4fee;&#x6539;&#x53ef;&#x89c1;&#x6027;&#xff0c;&#x4e0d;&#x80fd;&#x4fdd;&#x8bc1;&#x539f;&#x5b50;&#x6027;&#xff1b; &#x800c;synchronized&#x5219;&#x53ef;&#x4ee5;&#x4fdd;&#x8bc1;&#x53d8;&#x91cf;&#x7684;&#x4fee;&#x6539;&#x53ef;&#x89c1;&#x6027;&#x548c;&#x539f;&#x5b50;&#x6027;</li>
    
<li>volatile&#x4e0d;&#x4f1a;&#x9020;&#x6210;&#x7ebf;&#x7a0b;&#x7684;&#x963b;&#x585e;&#xff1b;synchronized&#x53ef;&#x80fd;&#x4f1a;&#x9020;&#x6210;&#x7ebf;&#x7a0b;&#x7684;&#x963b;&#x585e;&#x3002;</li>
    
<li>volatile&#x6807;&#x8bb0;&#x7684;&#x53d8;&#x91cf;&#x4e0d;&#x4f1a;&#x88ab;&#x7f16;&#x8bd1;&#x5668;&#x4f18;&#x5316;&#xff1b;synchronized&#x6807;&#x8bb0;&#x7684;&#x53d8;&#x91cf;&#x53ef;&#x4ee5;&#x88ab;&#x7f16;&#x8bd1;&#x5668;&#x4f18;&#x5316;</li>
  </ul>
</blockquote></div>
      </div>
    </div>
    <div class="clear">
      <hr/>
    </div>
    <div id="footer">
      <div class="xright">
              Copyright &#169;                   2018.
          All rights reserved.    
                  </div>
      <div class="clear">
        <hr/>
      </div>
    </div>
  </body>
</html>
