<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!-- Generated by Apache Maven Doxia Site Renderer 1.7.4 at 2018-03-24 -->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en">
  <head>
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
    <title>java-design-pattern-learn &#x2013; 工厂方法模式</title>
    <style type="text/css" media="all">
      @import url("./css/maven-base.css");
      @import url("./css/maven-theme.css");
      @import url("./css/site.css");
    </style>
    <link rel="stylesheet" href="./css/print.css" type="text/css" media="print" />
    <meta http-equiv="Content-Language" content="en" />
        
        </head>
  <body class="composite">
    <div id="banner">
                    <div id="bannerLeft">
                java-design-pattern-learn
                </div>
                    <div class="clear">
        <hr/>
      </div>
    </div>
    <div id="breadcrumbs">
          
                <div class="xleft">
        <span id="publishDate">Last Published: 2018-03-24</span>
                  &nbsp;| <span id="projectVersion">Version: 1.0-SNAPSHOT</span>
                      </div>
            <div class="xright">                    <a href="./" title="java-design-pattern-learn">java-design-pattern-learn</a>
            
      </div>
      <div class="clear">
        <hr/>
      </div>
    </div>
    <div id="leftColumn">
      <div id="navcolumn">
           
                                <h5>Parent Project</h5>
                  <ul>
                  <li class="none">
                          <a href="../index.html" title="design-pattern">design-pattern</a>
            </li>
          </ul>
                       <h5>Project Documentation</h5>
                  <ul>
                                                                                                                                                                                                                                                        <li class="collapsed">
                          <a href="project-info.html" title="Project Information">Project Information</a>
                  </li>
                                                                                      <li class="collapsed">
                          <a href="project-reports.html" title="Project Reports">Project Reports</a>
                  </li>
          </ul>
                             <a href="http://maven.apache.org/" title="Built by Maven" class="poweredBy">
        <img class="poweredBy" alt="Built by Maven" src="./images/logos/maven-feather.png" />
      </a>
                 
            </div>
    </div>
    <div id="bodyColumn">
      <div id="contentBox">
        <h1>&#x5de5;&#x5382;&#x65b9;&#x6cd5;&#x6a21;&#x5f0f;</h1>

<blockquote>
<p>&#x5de5;&#x5382;&#x6a21;&#x5f0f;&#xff08;Factory Pattern&#xff09;&#x662f; Java &#x4e2d;&#x6700;&#x5e38;&#x7528;&#x7684;&#x8bbe;&#x8ba1;&#x6a21;&#x5f0f;&#x4e4b;&#x4e00;&#x3002; &#x8fd9;&#x79cd;&#x7c7b;&#x578b;&#x7684;&#x8bbe;&#x8ba1;&#x6a21;&#x5f0f;&#x5c5e;&#x4e8e;&#x521b;&#x5efa;&#x578b;&#x6a21;&#x5f0f;&#xff0c;&#x5b83;&#x63d0;&#x4f9b;&#x4e86;&#x4e00;&#x79cd;&#x521b;&#x5efa;&#x5bf9;&#x8c61;&#x7684;&#x6700;&#x4f73;&#x65b9;&#x5f0f;&#x3002;</p>
</blockquote>
<div class="section">
<h2><a name="a1_"></a>1 &#x4ecb;&#x7ecd;</h2>
<div class="section">
<h3><a name="a1.1_"></a>1.1 &#x6a21;&#x5f0f;&#x52a8;&#x673a;</h3>

<blockquote>
<p>&#x5b9a;&#x4e49;&#x4e00;&#x4e2a;&#x521b;&#x5efa;&#x5bf9;&#x8c61;&#x7684;&#x63a5;&#x53e3;&#xff0c;&#x8ba9;&#x5176;&#x5b50;&#x7c7b;&#x81ea;&#x5df1;&#x51b3;&#x5b9a;&#x5b9e;&#x4f8b;&#x5316;&#x54ea;&#x4e00;&#x4e2a;&#x5de5;&#x5382;&#x7c7b;&#xff0c;&#x5de5;&#x5382;&#x6a21;&#x5f0f;&#x4f7f;&#x5176;&#x521b;&#x5efa;&#x8fc7;&#x7a0b;&#x5ef6;&#x8fdf;&#x5230;&#x5b50;&#x7c7b;&#x8fdb;&#x884c;&#x3002;</p>
</blockquote></div>
<div class="section">
<h3><a name="a1.2_"></a>1.2 &#x6a21;&#x5f0f;&#x5b9a;&#x4e49;</h3>

<blockquote>
<p>&#x5de5;&#x5382;&#x65b9;&#x6cd5;&#x6a21;&#x5f0f;(Factory Method Pattern)&#x53c8;&#x79f0;&#x4e3a;&#x5de5;&#x5382;&#x6a21;&#x5f0f;&#xff0c; &#x4e5f;&#x53eb;&#x865a;&#x62df;&#x6784;&#x9020;&#x5668;(Virtual Constructor)&#x6a21;&#x5f0f;&#x6216;&#x8005;&#x591a;&#x6001;&#x5de5;&#x5382;(Polymorphic Factory)&#x6a21;&#x5f0f;&#xff0c; &#x5b83;&#x5c5e;&#x4e8e;&#x7c7b;&#x521b;&#x5efa;&#x578b;&#x6a21;&#x5f0f;&#x3002;&#x5728;&#x5de5;&#x5382;&#x65b9;&#x6cd5;&#x6a21;&#x5f0f;&#x4e2d;&#xff0c;&#x5de5;&#x5382;&#x7236;&#x7c7b;&#x8d1f;&#x8d23;&#x5b9a;&#x4e49;&#x521b;&#x5efa;&#x4ea7;&#x54c1;&#x5bf9;&#x8c61;&#x7684;&#x516c;&#x5171;&#x63a5;&#x53e3;&#xff0c; &#x800c;&#x5de5;&#x5382;&#x5b50;&#x7c7b;&#x5219;&#x8d1f;&#x8d23;&#x751f;&#x6210;&#x5177;&#x4f53;&#x7684;&#x4ea7;&#x54c1;&#x5bf9;&#x8c61;&#xff0c;&#x8fd9;&#x6837;&#x505a;&#x7684;&#x76ee;&#x7684;&#x662f;&#x5c06;&#x4ea7;&#x54c1;&#x7c7b;&#x7684;&#x5b9e;&#x4f8b;&#x5316;&#x64cd;&#x4f5c;&#x5ef6;&#x8fdf;&#x5230;&#x5de5;&#x5382;&#x5b50;&#x7c7b;&#x4e2d;&#x5b8c;&#x6210;&#xff0c; &#x5373;&#x901a;&#x8fc7;&#x5de5;&#x5382;&#x5b50;&#x7c7b;&#x6765;&#x786e;&#x5b9a;&#x7a76;&#x7adf;&#x5e94;&#x8be5;&#x5b9e;&#x4f8b;&#x5316;&#x54ea;&#x4e00;&#x4e2a;&#x5177;&#x4f53;&#x4ea7;&#x54c1;&#x7c7b;&#x3002;</p>
</blockquote></div>
<div class="section">
<h3><a name="a1.3_"></a>1.3 &#x9002;&#x7528;&#x73af;&#x5883;</h3>

<blockquote>
  
<ul>
    
<li>1&#x3001;&#x65e5;&#x5fd7;&#x8bb0;&#x5f55;&#x5668;&#xff1a;&#x8bb0;&#x5f55;&#x53ef;&#x80fd;&#x8bb0;&#x5f55;&#x5230;&#x672c;&#x5730;&#x786c;&#x76d8;&#x3001;&#x7cfb;&#x7edf;&#x4e8b;&#x4ef6;&#x3001;&#x8fdc;&#x7a0b;&#x670d;&#x52a1;&#x5668;&#x7b49;&#xff0c;&#x7528;&#x6237;&#x53ef;&#x4ee5;&#x9009;&#x62e9;&#x8bb0;&#x5f55;&#x65e5;&#x5fd7;&#x5230;&#x4ec0;&#x4e48;&#x5730;&#x65b9;&#x3002;</li>
    
<li>2&#x3001;&#x6570;&#x636e;&#x5e93;&#x8bbf;&#x95ee;&#xff0c;&#x5f53;&#x7528;&#x6237;&#x4e0d;&#x77e5;&#x9053;&#x6700;&#x540e;&#x7cfb;&#x7edf;&#x91c7;&#x7528;&#x54ea;&#x4e00;&#x7c7b;&#x6570;&#x636e;&#x5e93;&#xff0c;&#x4ee5;&#x53ca;&#x6570;&#x636e;&#x5e93;&#x53ef;&#x80fd;&#x6709;&#x53d8;&#x5316;&#x65f6;&#x3002;</li>
    
<li>3&#x3001;&#x8bbe;&#x8ba1;&#x4e00;&#x4e2a;&#x8fde;&#x63a5;&#x670d;&#x52a1;&#x5668;&#x7684;&#x6846;&#x67b6;&#xff0c;&#x9700;&#x8981;&#x4e09;&#x4e2a;&#x534f;&#x8bae;&#xff0c;&#x201c;POP3&#x201d;&#x3001;&#x201c;IMAP&#x201d;&#x3001;&#x201c;HTTP&#x201d;&#xff0c; &#x53ef;&#x4ee5;&#x628a;&#x8fd9;&#x4e09;&#x4e2a;&#x4f5c;&#x4e3a;&#x4ea7;&#x54c1;&#x7c7b;&#xff0c;&#x5171;&#x540c;&#x5b9e;&#x73b0;&#x4e00;&#x4e2a;&#x63a5;&#x53e3;&#x3002;</li>
  </ul>
</blockquote></div>
<div class="section">
<h3><a name="a1.4_"></a>1.4 &#x6a21;&#x5f0f;&#x5e94;&#x7528;</h3>

<blockquote>
  
<ul>
    
<li>1&#x3001;&#x60a8;&#x9700;&#x8981;&#x4e00;&#x8f86;&#x6c7d;&#x8f66;&#xff0c;&#x53ef;&#x4ee5;&#x76f4;&#x63a5;&#x4ece;&#x5de5;&#x5382;&#x91cc;&#x9762;&#x63d0;&#x8d27;&#xff0c;&#x800c;&#x4e0d;&#x7528;&#x53bb;&#x7ba1;&#x8fd9;&#x8f86;&#x6c7d;&#x8f66;&#x662f;&#x600e;&#x4e48;&#x505a;&#x51fa;&#x6765;&#x7684;&#xff0c;&#x4ee5;&#x53ca;&#x8fd9;&#x4e2a;&#x6c7d;&#x8f66;&#x91cc;&#x9762;&#x7684;&#x5177;&#x4f53;&#x5b9e;&#x73b0;&#x3002;</li>
    
<li>2&#x3001;Hibernate &#x6362;&#x6570;&#x636e;&#x5e93;&#x53ea;&#x9700;&#x6362;&#x65b9;&#x8a00;&#x548c;&#x9a71;&#x52a8;&#x5c31;&#x53ef;&#x4ee5;&#x3002;</li>
  </ul>
</blockquote></div>
<div class="section">
<h3><a name="a1.5_"></a>1.5 &#x4f18;&#x70b9;</h3>

<blockquote>
  
<ul>
    
<li>1&#x3001;&#x4e00;&#x4e2a;&#x8c03;&#x7528;&#x8005;&#x60f3;&#x521b;&#x5efa;&#x4e00;&#x4e2a;&#x5bf9;&#x8c61;&#xff0c;&#x53ea;&#x8981;&#x77e5;&#x9053;&#x5176;&#x540d;&#x79f0;&#x5c31;&#x53ef;&#x4ee5;&#x4e86;&#x3002;</li>
    
<li>2&#x3001;&#x6269;&#x5c55;&#x6027;&#x9ad8;&#xff0c;&#x5982;&#x679c;&#x60f3;&#x589e;&#x52a0;&#x4e00;&#x4e2a;&#x4ea7;&#x54c1;&#xff0c;&#x53ea;&#x8981;&#x6269;&#x5c55;&#x4e00;&#x4e2a;&#x5de5;&#x5382;&#x7c7b;&#x5c31;&#x53ef;&#x4ee5;&#x3002;</li>
    
<li>3&#x3001;&#x5c4f;&#x853d;&#x4ea7;&#x54c1;&#x7684;&#x5177;&#x4f53;&#x5b9e;&#x73b0;&#xff0c;&#x8c03;&#x7528;&#x8005;&#x53ea;&#x5173;&#x5fc3;&#x4ea7;&#x54c1;&#x7684;&#x63a5;&#x53e3;&#x3002;</li>
  </ul>
</blockquote></div>
<div class="section">
<h3><a name="a1.6_"></a>1.6 &#x7f3a;&#x70b9;</h3>

<blockquote>
  
<ul>
    
<li>1 &#x6bcf;&#x6b21;&#x589e;&#x52a0;&#x4e00;&#x4e2a;&#x4ea7;&#x54c1;&#x65f6;&#xff0c;&#x90fd;&#x9700;&#x8981;&#x589e;&#x52a0;&#x4e00;&#x4e2a;&#x5177;&#x4f53;&#x7c7b;&#x548c;&#x5bf9;&#x8c61;&#x5b9e;&#x73b0;&#x5de5;&#x5382;&#xff0c;&#x4f7f;&#x5f97;&#x7cfb;&#x7edf;&#x4e2d;&#x7c7b;&#x7684;&#x4e2a;&#x6570;&#x6210;&#x500d;&#x589e;&#x52a0;&#xff0c; &#x5728;&#x4e00;&#x5b9a;&#x7a0b;&#x5ea6;&#x4e0a;&#x589e;&#x52a0;&#x4e86;&#x7cfb;&#x7edf;&#x7684;&#x590d;&#x6742;&#x5ea6;&#xff0c;&#x540c;&#x65f6;&#x4e5f;&#x589e;&#x52a0;&#x4e86;&#x7cfb;&#x7edf;&#x5177;&#x4f53;&#x7c7b;&#x7684;&#x4f9d;&#x8d56;&#x3002;</li>
  </ul>
</blockquote></div>
<div class="section">
<h3><a name="a1.7_"></a>1.7 &#x6a21;&#x5f0f;&#x7ed3;&#x6784;</h3>

<blockquote>
<p>&#x5de5;&#x5382;&#x65b9;&#x6cd5;&#x6a21;&#x5f0f;&#x5305;&#x542b;&#x5982;&#x4e0b;&#x89d2;&#x8272;&#xff1a;</p>
  
<ul>
    
<li>AbstractProduct&#xff1a;&#x62bd;&#x8c61;&#x4ea7;&#x54c1;</li>
    
<li>ConcreteProduct&#xff1a;&#x5177;&#x4f53;&#x4ea7;&#x54c1;</li>
    
<li>AbstractFactory&#xff1a;&#x62bd;&#x8c61;&#x5de5;&#x5382;</li>
    
<li>ConcreteFactory&#xff1a;&#x5177;&#x4f53;&#x5de5;&#x5382;</li>
  </ul>
<p>&#x7c7b;&#x56fe;&#xff1a;</p>
</blockquote>
<p>![](image/factory.png)</p></div>
<div class="section">
<h3><a name="a1.8_"></a>1.8 &#x65f6;&#x5e8f;&#x56fe;</h3></div></div>
<div class="section">
<h2><a name="a2_"></a>2 &#x4ee3;&#x7801;&#x5206;&#x6790;</h2>

<blockquote>
<p>&#x62bd;&#x8c61;&#x5de5;&#x5382;&#x7c7b; AbstractFactory&#xff1a;</p>
</blockquote>

<div class="source">
<div class="source">
<pre>public abstract class AbstractFactory {
    public abstract AbstractProduct createProduct();
}
</pre></div></div>

<blockquote>
<p>&#x5177;&#x4f53;&#x5de5;&#x5382;&#x7c7b; AbstractProduct&#xff1a;</p>
</blockquote>

<div class="source">
<div class="source">
<pre>public abstract class AbstractProduct {

    protected ColorType color;

    AbstractProduct(ColorType color){
        this.color = color;
    }

    public enum ColorType{

        RED,
        BLACK,
        BLUE,
        YELLOW;
    }
}
</pre></div></div>

<blockquote>
<p>&#x5177;&#x4f53;&#x4ea7;&#x54c1;&#x7c7b; ConcreteBlueProduct&#xff1a;</p>
</blockquote>

<div class="source">
<div class="source">
<pre>public class ConcreteBlueProduct extends AbstractProduct {

    ConcreteBlueProduct() {

        super(ColorType.RED);
    }
}
</pre></div></div>

<blockquote>
<p>&#x5177;&#x4f53;&#x4ea7;&#x54c1;&#x7c7b; ConcreteBlueProcductFactory&#xff1a;</p>
</blockquote>

<div class="source">
<div class="source">
<pre>@Slf4j
public class ConcreteBlueProcductFactory extends AbstractFactory{

    @Override
    public  AbstractProduct createProduct() {
        log.info(&quot;-*--*--*--*- &#x521b;&#x5efa;&#x84dd;&#x8272;&#x4ea7;&#x54c1;-*--*--*--*--&quot;);
        return new ConcreteBlueProduct();
    }
}
</pre></div></div>

<blockquote>
<p>&#x5ba2;&#x6237;&#x7aef; Client&#xff1a;</p>
</blockquote>

<div class="source">
<div class="source">
<pre>@Slf4j
public class Client {

    public static void main(String[] args) {

        AbstractProduct blueProduct = new ConcreteBlueProcductFactory().createProduct();

        AbstractProduct redProduct = new  ConcreteRedProcductFactory().createProduct();

        AbstractProduct yellowProduct = new ConcreteYellowProcductFactory().createProduct();

    }
}
</pre></div></div></div>
<div class="section">
<h2><a name="a3_"></a>3 &#x6a21;&#x5f0f;&#x5206;&#x6790;</h2>

<blockquote>
<p>&#x4f5c;&#x4e3a;&#x4e00;&#x79cd;&#x521b;&#x5efa;&#x7c7b;&#x6a21;&#x5f0f;&#xff0c;&#x5728;&#x4efb;&#x4f55;&#x9700;&#x8981;&#x751f;&#x6210;&#x590d;&#x6742;&#x5bf9;&#x8c61;&#x7684;&#x5730;&#x65b9;&#xff0c;&#x90fd;&#x53ef;&#x4ee5;&#x4f7f;&#x7528;&#x5de5;&#x5382;&#x65b9;&#x6cd5;&#x6a21;&#x5f0f;&#x3002; &#x6709;&#x4e00;&#x70b9;&#x9700;&#x8981;&#x6ce8;&#x610f;&#x7684;&#x5730;&#x65b9;&#x5c31;&#x662f;&#x590d;&#x6742;&#x5bf9;&#x8c61;&#x9002;&#x5408;&#x4f7f;&#x7528;&#x5de5;&#x5382;&#x6a21;&#x5f0f;&#xff0c;&#x800c;&#x7b80;&#x5355;&#x5bf9;&#x8c61;&#xff0c; &#x7279;&#x522b;&#x662f;&#x53ea;&#x9700;&#x8981;&#x901a;&#x8fc7; new &#x5c31;&#x53ef;&#x4ee5;&#x5b8c;&#x6210;&#x521b;&#x5efa;&#x7684;&#x5bf9;&#x8c61;&#xff0c;&#x65e0;&#x9700;&#x4f7f;&#x7528;&#x5de5;&#x5382;&#x6a21;&#x5f0f;&#x3002; &#x5982;&#x679c;&#x4f7f;&#x7528;&#x5de5;&#x5382;&#x6a21;&#x5f0f;&#xff0c;&#x5c31;&#x9700;&#x8981;&#x5f15;&#x5165;&#x4e00;&#x4e2a;&#x5de5;&#x5382;&#x7c7b;&#xff0c;&#x4f1a;&#x589e;&#x52a0;&#x7cfb;&#x7edf;&#x7684;&#x590d;&#x6742;&#x5ea6;&#x3002;</p>
</blockquote></div>
<div class="section">
<h2><a name="a4_"></a>4 &#x5b9e;&#x4f8b;</h2></div>
<div class="section">
<h2><a name="a"></a>&#x6a21;&#x5f0f;&#x6269;&#x5c55;</h2>

<blockquote>
  
<ul>
    
<li>&#x4f7f;&#x7528;&#x591a;&#x4e2a;&#x5de5;&#x5382;&#x65b9;&#x6cd5;&#xff1a;&#x5728;&#x62bd;&#x8c61;&#x5de5;&#x5382;&#x89d2;&#x8272;&#x4e2d;&#x53ef;&#x4ee5;&#x5b9a;&#x4e49;&#x591a;&#x4e2a;&#x5de5;&#x5382;&#x65b9;&#x6cd5;&#xff0c; &#x4ece;&#x800c;&#x4f7f;&#x5177;&#x4f53;&#x5de5;&#x5382;&#x89d2;&#x8272;&#x5b9e;&#x73b0;&#x8fd9;&#x4e9b;&#x4e0d;&#x540c;&#x7684;&#x5de5;&#x5382;&#x65b9;&#x6cd5;&#xff0c;&#x8fd9;&#x4e9b;&#x65b9;&#x6cd5;&#x53ef;&#x4ee5;&#x5305;&#x542b;&#x4e0d;&#x540c;&#x7684;&#x4e1a;&#x52a1;&#x903b;&#x8f91;&#xff0c; &#x4ee5;&#x6ee1;&#x8db3;&#x5bf9;&#x4e0d;&#x540c;&#x7684;&#x4ea7;&#x54c1;&#x5bf9;&#x8c61;&#x7684;&#x9700;&#x6c42;&#x3002;</li>
    
<li>&#x4ea7;&#x54c1;&#x5bf9;&#x8c61;&#x7684;&#x91cd;&#x590d;&#x4f7f;&#x7528;&#xff1a;&#x5de5;&#x5382;&#x5bf9;&#x8c61;&#x5c06;&#x5df2;&#x7ecf;&#x521b;&#x5efa;&#x8fc7;&#x7684;&#x4ea7;&#x54c1;&#x4fdd;&#x5b58;&#x5230;&#x4e00;&#x4e2a;&#x96c6;&#x5408;&#xff08;&#x5982;&#x6570;&#x7ec4;&#x3001;List&#x7b49;&#xff09;&#x4e2d;&#xff0c; &#x7136;&#x540e;&#x6839;&#x636e;&#x5ba2;&#x6237;&#x5bf9;&#x4ea7;&#x54c1;&#x7684;&#x8bf7;&#x6c42;&#xff0c;&#x5bf9;&#x96c6;&#x5408;&#x8fdb;&#x884c;&#x67e5;&#x8be2;&#x3002;&#x5982;&#x679c;&#x6709;&#x6ee1;&#x8db3;&#x8981;&#x6c42;&#x7684;&#x4ea7;&#x54c1;&#x5bf9;&#x8c61;&#xff0c;&#x5c31;&#x76f4;&#x63a5;&#x5c06;&#x8be5;&#x4ea7;&#x54c1;&#x8fd4;&#x56de;&#x5ba2;&#x6237;&#x7aef;&#xff1b; &#x5982;&#x679c;&#x96c6;&#x5408;&#x4e2d;&#x6ca1;&#x6709;&#x8fd9;&#x6837;&#x7684;&#x4ea7;&#x54c1;&#x5bf9;&#x8c61;&#xff0c;&#x90a3;&#x4e48;&#x5c31;&#x521b;&#x5efa;&#x4e00;&#x4e2a;&#x65b0;&#x7684;&#x6ee1;&#x8db3;&#x8981;&#x6c42;&#x7684;&#x4ea7;&#x54c1;&#x5bf9;&#x8c61;&#xff0c;&#x7136;&#x540e;&#x5c06;&#x8fd9;&#x4e2a;&#x5bf9;&#x8c61;&#x5728;&#x589e;&#x52a0;&#x5230;&#x96c6;&#x5408;&#x4e2d;&#xff0c; &#x518d;&#x8fd4;&#x56de;&#x7ed9;&#x5ba2;&#x6237;&#x7aef;&#x3002;</li>
    
<li>&#x591a;&#x6001;&#x6027;&#x7684;&#x4e27;&#x5931;&#x548c;&#x6a21;&#x5f0f;&#x7684;&#x9000;&#x5316;&#xff1a;&#x5982;&#x679c;&#x5de5;&#x5382;&#x4ec5;&#x4ec5;&#x8fd4;&#x56de;&#x4e00;&#x4e2a;&#x5177;&#x4f53;&#x4ea7;&#x54c1;&#x5bf9;&#x8c61;&#xff0c;&#x4fbf;&#x8fdd;&#x80cc;&#x4e86;&#x5de5;&#x5382;&#x65b9;&#x6cd5;&#x7684;&#x7528;&#x610f;&#xff0c;&#x53d1;&#x751f;&#x9000;&#x5316;&#xff0c; &#x6b64;&#x65f6;&#x5c31;&#x4e0d;&#x518d;&#x662f;&#x5de5;&#x5382;&#x65b9;&#x6cd5;&#x6a21;&#x5f0f;&#x4e86;&#x3002;&#x4e00;&#x822c;&#x6765;&#x8bf4;&#xff0c;&#x5de5;&#x5382;&#x5bf9;&#x8c61;&#x5e94;&#x5f53;&#x6709;&#x4e00;&#x4e2a;&#x62bd;&#x8c61;&#x7684;&#x7236;&#x7c7b;&#x578b;&#xff0c; &#x5982;&#x679c;&#x5de5;&#x5382;&#x7b49;&#x7ea7;&#x7ed3;&#x6784;&#x4e2d;&#x53ea;&#x6709;&#x4e00;&#x4e2a;&#x5177;&#x4f53;&#x5de5;&#x5382;&#x7c7b;&#x7684;&#x8bdd;&#xff0c;&#x62bd;&#x8c61;&#x5de5;&#x5382;&#x5c31;&#x53ef;&#x4ee5;&#x7701;&#x7565;&#xff0c;&#x4e5f;&#x5c06;&#x53d1;&#x751f;&#x4e86;&#x9000;&#x5316;&#x3002; &#x5f53;&#x53ea;&#x6709;&#x4e00;&#x4e2a;&#x5177;&#x4f53;&#x5de5;&#x5382;&#xff0c;&#x5728;&#x5177;&#x4f53;&#x5de5;&#x5382;&#x4e2d;&#x53ef;&#x4ee5;&#x521b;&#x5efa;&#x6240;&#x6709;&#x7684;&#x4ea7;&#x54c1;&#x5bf9;&#x8c61;&#xff0c;&#x5e76;&#x4e14;&#x5de5;&#x5382;&#x65b9;&#x6cd5;&#x8bbe;&#x8ba1;&#x4e3a;&#x9759;&#x6001;&#x65b9;&#x6cd5;&#x65f6;&#xff0c; &#x5de5;&#x5382;&#x65b9;&#x6cd5;&#x6a21;&#x5f0f;&#x5c31;&#x9000;&#x5316;&#x6210;&#x7b80;&#x5355;&#x5de5;&#x5382;&#x6a21;&#x5f0f;&#x3002;</li>
  </ul>
</blockquote></div>
<div class="section">
<h2><a name="a"></a>&#x603b;&#x7ed3;</h2>

<blockquote>
  
<ul>
    
<li>&#x5de5;&#x5382;&#x65b9;&#x6cd5;&#x6a21;&#x5f0f;&#x53c8;&#x79f0;&#x4e3a;&#x5de5;&#x5382;&#x6a21;&#x5f0f;&#xff0c;&#x5b83;&#x5c5e;&#x4e8e;&#x7c7b;&#x521b;&#x5efa;&#x578b;&#x6a21;&#x5f0f;&#x3002;&#x5728;&#x5de5;&#x5382;&#x65b9;&#x6cd5;&#x6a21;&#x5f0f;&#x4e2d;&#xff0c; &#x5de5;&#x5382;&#x7236;&#x7c7b;&#x8d1f;&#x8d23;&#x5b9a;&#x4e49;&#x521b;&#x5efa;&#x4ea7;&#x54c1;&#x5bf9;&#x8c61;&#x7684;&#x516c;&#x5171;&#x63a5;&#x53e3;&#xff0c;&#x800c;&#x5de5;&#x5382;&#x5b50;&#x7c7b;&#x5219;&#x8d1f;&#x8d23;&#x751f;&#x6210;&#x5177;&#x4f53;&#x7684;&#x4ea7;&#x54c1;&#x5bf9;&#x8c61;&#xff0c; &#x8fd9;&#x6837;&#x505a;&#x7684;&#x76ee;&#x7684;&#x662f;&#x5c06;&#x4ea7;&#x54c1;&#x7c7b;&#x7684;&#x5b9e;&#x4f8b;&#x5316;&#x64cd;&#x4f5c;&#x5ef6;&#x8fdf;&#x5230;&#x5de5;&#x5382;&#x5b50;&#x7c7b;&#x4e2d;&#x5b8c;&#x6210;&#xff0c; &#x5373;&#x901a;&#x8fc7;&#x5de5;&#x5382;&#x5b50;&#x7c7b;&#x6765;&#x786e;&#x5b9a;&#x7a76;&#x7adf;&#x5e94;&#x8be5;&#x5b9e;&#x4f8b;&#x5316;&#x54ea;&#x4e00;&#x4e2a;&#x5177;&#x4f53;&#x4ea7;&#x54c1;&#x7c7b;&#x3002;</li>
    
<li>&#x5de5;&#x5382;&#x65b9;&#x6cd5;&#x6a21;&#x5f0f;&#x5305;&#x542b;&#x56db;&#x4e2a;&#x89d2;&#x8272;&#xff1a;&#x62bd;&#x8c61;&#x4ea7;&#x54c1;&#x662f;&#x5b9a;&#x4e49;&#x4ea7;&#x54c1;&#x7684;&#x63a5;&#x53e3;&#xff0c;&#x662f;&#x5de5;&#x5382;&#x65b9;&#x6cd5;&#x6a21;&#x5f0f;&#x6240;&#x521b;&#x5efa;&#x5bf9;&#x8c61;&#x7684;&#x8d85;&#x7c7b;&#x578b;&#xff0c; &#x5373;&#x4ea7;&#x54c1;&#x5bf9;&#x8c61;&#x7684;&#x5171;&#x540c;&#x7236;&#x7c7b;&#x6216;&#x63a5;&#x53e3;&#xff1b;&#x5177;&#x4f53;&#x4ea7;&#x54c1;&#x5b9e;&#x73b0;&#x4e86;&#x62bd;&#x8c61;&#x4ea7;&#x54c1;&#x63a5;&#x53e3;&#xff0c;&#x67d0;&#x79cd;&#x7c7b;&#x578b;&#x7684;&#x5177;&#x4f53;&#x4ea7;&#x54c1;&#x7531;&#x4e13;&#x95e8;&#x7684;&#x5177;&#x4f53;&#x5de5;&#x5382;&#x521b;&#x5efa;&#xff0c; &#x5b83;&#x4eec;&#x4e4b;&#x95f4;&#x5f80;&#x5f80;&#x4e00;&#x4e00;&#x5bf9;&#x5e94;&#xff1b;&#x62bd;&#x8c61;&#x5de5;&#x5382;&#x4e2d;&#x58f0;&#x660e;&#x4e86;&#x5de5;&#x5382;&#x65b9;&#x6cd5;&#xff0c;&#x7528;&#x4e8e;&#x8fd4;&#x56de;&#x4e00;&#x4e2a;&#x4ea7;&#x54c1;&#xff0c;&#x5b83;&#x662f;&#x5de5;&#x5382;&#x65b9;&#x6cd5;&#x6a21;&#x5f0f;&#x7684;&#x6838;&#x5fc3;&#xff0c; &#x4efb;&#x4f55;&#x5728;&#x6a21;&#x5f0f;&#x4e2d;&#x521b;&#x5efa;&#x5bf9;&#x8c61;&#x7684;&#x5de5;&#x5382;&#x7c7b;&#x90fd;&#x5fc5;&#x987b;&#x5b9e;&#x73b0;&#x8be5;&#x63a5;&#x53e3;&#xff1b;&#x5177;&#x4f53;&#x5de5;&#x5382;&#x662f;&#x62bd;&#x8c61;&#x5de5;&#x5382;&#x7c7b;&#x7684;&#x5b50;&#x7c7b;&#xff0c; &#x5b9e;&#x73b0;&#x4e86;&#x62bd;&#x8c61;&#x5de5;&#x5382;&#x4e2d;&#x5b9a;&#x4e49;&#x7684;&#x5de5;&#x5382;&#x65b9;&#x6cd5;&#xff0c;&#x5e76;&#x53ef;&#x7531;&#x5ba2;&#x6237;&#x8c03;&#x7528;&#xff0c;&#x8fd4;&#x56de;&#x4e00;&#x4e2a;&#x5177;&#x4f53;&#x4ea7;&#x54c1;&#x7c7b;&#x7684;&#x5b9e;&#x4f8b;&#x3002;</li>
    
<li>&#x5de5;&#x5382;&#x65b9;&#x6cd5;&#x6a21;&#x5f0f;&#x662f;&#x7b80;&#x5355;&#x5de5;&#x5382;&#x6a21;&#x5f0f;&#x7684;&#x8fdb;&#x4e00;&#x6b65;&#x62bd;&#x8c61;&#x548c;&#x63a8;&#x5e7f;&#x3002;&#x7531;&#x4e8e;&#x4f7f;&#x7528;&#x4e86;&#x9762;&#x5411;&#x5bf9;&#x8c61;&#x7684;&#x591a;&#x6001;&#x6027;&#xff0c; &#x5de5;&#x5382;&#x65b9;&#x6cd5;&#x6a21;&#x5f0f;&#x4fdd;&#x6301;&#x4e86;&#x7b80;&#x5355;&#x5de5;&#x5382;&#x6a21;&#x5f0f;&#x7684;&#x4f18;&#x70b9;&#xff0c;&#x800c;&#x4e14;&#x514b;&#x670d;&#x4e86;&#x5b83;&#x7684;&#x7f3a;&#x70b9;&#x3002;&#x5728;&#x5de5;&#x5382;&#x65b9;&#x6cd5;&#x6a21;&#x5f0f;&#x4e2d;&#xff0c; &#x6838;&#x5fc3;&#x7684;&#x5de5;&#x5382;&#x7c7b;&#x4e0d;&#x518d;&#x8d1f;&#x8d23;&#x6240;&#x6709;&#x4ea7;&#x54c1;&#x7684;&#x521b;&#x5efa;&#xff0c;&#x800c;&#x662f;&#x5c06;&#x5177;&#x4f53;&#x521b;&#x5efa;&#x5de5;&#x4f5c;&#x4ea4;&#x7ed9;&#x5b50;&#x7c7b;&#x53bb;&#x505a;&#x3002; &#x8fd9;&#x4e2a;&#x6838;&#x5fc3;&#x7c7b;&#x4ec5;&#x4ec5;&#x8d1f;&#x8d23;&#x7ed9;&#x51fa;&#x5177;&#x4f53;&#x5de5;&#x5382;&#x5fc5;&#x987b;&#x5b9e;&#x73b0;&#x7684;&#x63a5;&#x53e3;&#xff0c;&#x800c;&#x4e0d;&#x8d1f;&#x8d23;&#x4ea7;&#x54c1;&#x7c7b;&#x88ab;&#x5b9e;&#x4f8b;&#x5316;&#x8fd9;&#x79cd;&#x7ec6;&#x8282;&#xff0c; &#x8fd9;&#x4f7f;&#x5f97;&#x5de5;&#x5382;&#x65b9;&#x6cd5;&#x6a21;&#x5f0f;&#x53ef;&#x4ee5;&#x5141;&#x8bb8;&#x7cfb;&#x7edf;&#x5728;&#x4e0d;&#x4fee;&#x6539;&#x5de5;&#x5382;&#x89d2;&#x8272;&#x7684;&#x60c5;&#x51b5;&#x4e0b;&#x5f15;&#x8fdb;&#x65b0;&#x4ea7;&#x54c1;&#x3002;</li>
    
<li>&#x5de5;&#x5382;&#x65b9;&#x6cd5;&#x6a21;&#x5f0f;&#x7684;&#x4e3b;&#x8981;&#x4f18;&#x70b9;&#x662f;&#x589e;&#x52a0;&#x65b0;&#x7684;&#x4ea7;&#x54c1;&#x7c7b;&#x65f6;&#x65e0;&#x987b;&#x4fee;&#x6539;&#x73b0;&#x6709;&#x7cfb;&#x7edf;&#xff0c;&#x5e76;&#x5c01;&#x88c5;&#x4e86;&#x4ea7;&#x54c1;&#x5bf9;&#x8c61;&#x7684;&#x521b;&#x5efa;&#x7ec6;&#x8282;&#xff0c; &#x7cfb;&#x7edf;&#x5177;&#x6709;&#x826f;&#x597d;&#x7684;&#x7075;&#x6d3b;&#x6027;&#x548c;&#x53ef;&#x6269;&#x5c55;&#x6027;&#xff1b;&#x5176;&#x7f3a;&#x70b9;&#x5728;&#x4e8e;&#x589e;&#x52a0;&#x65b0;&#x4ea7;&#x54c1;&#x7684;&#x540c;&#x65f6;&#x9700;&#x8981;&#x589e;&#x52a0;&#x65b0;&#x7684;&#x5de5;&#x5382;&#xff0c; &#x5bfc;&#x81f4;&#x7cfb;&#x7edf;&#x7c7b;&#x7684;&#x4e2a;&#x6570;&#x6210;&#x5bf9;&#x589e;&#x52a0;&#xff0c;&#x5728;&#x4e00;&#x5b9a;&#x7a0b;&#x5ea6;&#x4e0a;&#x589e;&#x52a0;&#x4e86;&#x7cfb;&#x7edf;&#x7684;&#x590d;&#x6742;&#x6027;&#x3002;</li>
    
<li>&#x5de5;&#x5382;&#x65b9;&#x6cd5;&#x6a21;&#x5f0f;&#x9002;&#x7528;&#x60c5;&#x51b5;&#x5305;&#x62ec;&#xff1a;&#x4e00;&#x4e2a;&#x7c7b;&#x4e0d;&#x77e5;&#x9053;&#x5b83;&#x6240;&#x9700;&#x8981;&#x7684;&#x5bf9;&#x8c61;&#x7684;&#x7c7b;&#xff1b;&#x4e00;&#x4e2a;&#x7c7b;&#x901a;&#x8fc7;&#x5176;&#x5b50;&#x7c7b;&#x6765;&#x6307;&#x5b9a;&#x521b;&#x5efa;&#x54ea;&#x4e2a;&#x5bf9;&#x8c61;&#xff1b; &#x5c06;&#x521b;&#x5efa;&#x5bf9;&#x8c61;&#x7684;&#x4efb;&#x52a1;&#x59d4;&#x6258;&#x7ed9;&#x591a;&#x4e2a;&#x5de5;&#x5382;&#x5b50;&#x7c7b;&#x4e2d;&#x7684;&#x67d0;&#x4e00;&#x4e2a;&#xff0c;&#x5ba2;&#x6237;&#x7aef;&#x5728;&#x4f7f;&#x7528;&#x65f6;&#x53ef;&#x4ee5;&#x65e0;&#x987b;&#x5173;&#x5fc3;&#x662f;&#x54ea;&#x4e00;&#x4e2a;&#x5de5;&#x5382;&#x5b50;&#x7c7b;&#x521b;&#x5efa;&#x4ea7;&#x54c1;&#x5b50;&#x7c7b;&#xff0c; &#x9700;&#x8981;&#x65f6;&#x518d;&#x52a8;&#x6001;&#x6307;&#x5b9a;&#x3002;</li>
  </ul>
</blockquote></div>
      </div>
    </div>
    <div class="clear">
      <hr/>
    </div>
    <div id="footer">
      <div class="xright">
              Copyright &#169;                   2018.
          All rights reserved.    
                  </div>
      <div class="clear">
        <hr/>
      </div>
    </div>
  </body>
</html>
