<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!-- Generated by Apache Maven Doxia Site Renderer 1.7.4 at 2018-03-24 -->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en">
  <head>
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
    <title>java-design-pattern-learn &#x2013; UML 基础</title>
    <style type="text/css" media="all">
      @import url("./css/maven-base.css");
      @import url("./css/maven-theme.css");
      @import url("./css/site.css");
    </style>
    <link rel="stylesheet" href="./css/print.css" type="text/css" media="print" />
    <meta http-equiv="Content-Language" content="en" />
        
        </head>
  <body class="composite">
    <div id="banner">
                    <div id="bannerLeft">
                java-design-pattern-learn
                </div>
                    <div class="clear">
        <hr/>
      </div>
    </div>
    <div id="breadcrumbs">
          
                <div class="xleft">
        <span id="publishDate">Last Published: 2018-03-24</span>
                  &nbsp;| <span id="projectVersion">Version: 1.0-SNAPSHOT</span>
                      </div>
            <div class="xright">                    <a href="./" title="java-design-pattern-learn">java-design-pattern-learn</a>
            
      </div>
      <div class="clear">
        <hr/>
      </div>
    </div>
    <div id="leftColumn">
      <div id="navcolumn">
           
                                <h5>Parent Project</h5>
                  <ul>
                  <li class="none">
                          <a href="../index.html" title="design-pattern">design-pattern</a>
            </li>
          </ul>
                       <h5>Project Documentation</h5>
                  <ul>
                                                                                                                                                                                                                                                        <li class="collapsed">
                          <a href="project-info.html" title="Project Information">Project Information</a>
                  </li>
                                                                                      <li class="collapsed">
                          <a href="project-reports.html" title="Project Reports">Project Reports</a>
                  </li>
          </ul>
                             <a href="http://maven.apache.org/" title="Built by Maven" class="poweredBy">
        <img class="poweredBy" alt="Built by Maven" src="./images/logos/maven-feather.png" />
      </a>
                 
            </div>
    </div>
    <div id="bodyColumn">
      <div id="contentBox">
        <h1>UML &#x57fa;&#x7840;</h1>
<div class="section">
<h2><a name="a1_"></a>1 &#x7c7b;&#x56fe;</h2>

<blockquote>
<p>UML&#x7528;&#x7c7b;&#x56fe;&#x8868;&#x793a;&#x7c7b;&#x3001;&#x63a5;&#x53e3;&#x53ca;&#x5176;&#x5173;&#x8054;&#x3002;&#x7c7b;&#x56fe;&#x7528;&#x4e8e;&#x9759;&#x6001;&#x5bf9;&#x8c61;&#x5efa;&#x6a21;&#x3002; &#x793a;&#x4f8b;(Intellij idea&#x4e2d;)&#xff1a;</p>
</blockquote>
<p><img src="image/class.png" alt="类图示例" /></p></div>
<div class="section">
<h2><a name="a2_"></a>2 &#x7c7b;&#x7684;&#x5173;&#x7cfb;</h2>

<ul>
  
<li>
<div class="section">
<h3><a name="a2.1_"></a>2.1 &#x7ee7;&#x627f;</h3>
  
<blockquote>&#x7ee7;&#x627f;&#x5173;&#x7cfb;&#x4e5f;&#x79f0;&#x6cdb;&#x5316;&#x5173;&#x7cfb;&#xff0c;&#x6307;&#x7684;&#x662f;&#x4e00;&#x4e2a;&#x7c7b;&#xff08;&#x79f0;&#x4e3a;&#x5b50;&#x7c7b;&#x3001;&#x5b50;&#x63a5;&#x53e3;&#xff09;&#x7ee7;&#x627f;&#x53e6;&#x5916;&#x7684;&#x4e00;&#x4e2a;&#x7c7b;&#xff08;&#x79f0;&#x4e3a;&#x7236;&#x7c7b;&#x3001;&#x7236;&#x63a5;&#x53e3;&#xff09;&#x7684;&#x529f;&#x80fd;&#xff0c;&#x5e76;&#x53ef;&#x4ee5;&#x589e;&#x52a0;&#x5b83;&#x81ea;&#x5df1;&#x7684;&#x65b0;&#x529f;&#x80fd;&#x7684;&#x80fd;&#x529b;&#xff0c;&#x7ee7;&#x627f;&#x662f;&#x7c7b;&#x4e0e;&#x7c7b;&#x6216;&#x8005;&#x63a5;&#x53e3;&#x4e0e;&#x63a5;&#x53e3;&#x4e4b;&#x95f4;&#x6700;&#x5e38;&#x89c1;&#x7684;&#x5173;&#x7cfb;&#xff1b;&#x5728;Java&#x4e2d;&#x6b64;&#x7c7b;&#x5173;&#x7cfb;&#x901a;&#x8fc7;&#x5173;&#x952e;&#x5b57;extends&#x660e;&#x786e;&#x6807;&#x8bc6;&#x3002; ![](image/extend.png)
  </blockquote></li>
</ul>

<blockquote>
<p>&#x5728;UML&#x5f53;&#x4e2d;&#xff0c;&#x5bf9;&#x6cdb;&#x5316;&#x5173;&#x7cfb;&#x6709;&#x4e09;&#x4e2a;&#x8981;&#x6c42;&#xff1a; * &#x5b50;&#x7c7b;&#x4e0e;&#x7236;&#x7c7b;&#x5e94;&#x8be5;&#x5b8c;&#x5168;&#x4e00;&#x81f4;&#xff0c;&#x7236;&#x7c7b;&#x6240;&#x5177;&#x6709;&#x7684;&#x5c5e;&#x6027;&#x3001;&#x64cd;&#x4f5c;&#xff0c;&#x5b50;&#x7c7b;&#x5e94;&#x8be5;&#x90fd;&#x6709;&#xff1b; * &#x5b50;&#x7c7b;&#x4e2d;&#x9664;&#x4e86;&#x4e0e;&#x7236;&#x7c7b;&#x4e00;&#x81f4;&#x7684;&#x4fe1;&#x606f;&#x4ee5;&#x5916;&#xff0c;&#x8fd8;&#x5305;&#x62ec;&#x989d;&#x5916;&#x7684;&#x4fe1;&#x606f;&#xff1b; * &#x53ef;&#x4ee5;&#x4f7f;&#x7528;&#x7236;&#x7c7b;&#x7684;&#x5b9e;&#x4f8b;&#x7684;&#x5730;&#x65b9;&#xff0c;&#x4e5f;&#x53ef;&#x4ee5;&#x4f7f;&#x7528;&#x5b50;&#x7c7b;&#x7684;&#x5b9e;&#x4f8b;&#xff1b;</p>
</blockquote>

<ul>
  
<li>
<div class="section">
<h4><a name="a2.2_"></a>2.2 &#x5b9e;&#x73b0;</h4>
  
<blockquote>&#x6307;&#x7684;&#x662f;&#x4e00;&#x4e2a;class&#x7c7b;&#x5b9e;&#x73b0;interface&#x63a5;&#x53e3;&#xff08;&#x53ef;&#x4ee5;&#x662f;&#x591a;&#x4e2a;&#xff09;&#x7684;&#x529f;&#x80fd;&#xff1b;&#x5b9e;&#x73b0;&#x662f;&#x7c7b;&#x4e0e;&#x63a5;&#x53e3;&#x4e4b;&#x95f4;&#x6700;&#x5e38;&#x89c1;&#x7684;&#x5173;&#x7cfb;&#xff1b;&#x5728;Java&#x4e2d;&#x6b64;&#x7c7b;&#x5173;&#x7cfb;&#x901a;&#x8fc7;&#x5173;&#x952e;&#x5b57;implements&#x660e;&#x786e;&#x6807;&#x8bc6;
  </blockquote></li>
</ul>
<p>![](image/impl.png)</p>

<ul>
  
<li></div>
<div class="section">
<h4><a name="a2.3_"></a>2.3 &#x4f9d;&#x8d56;</h4>
  
<blockquote>&#x4f9d;&#x8d56;&#x5173;&#x7cfb;(Dependency) &#x662f;&#x4e00;&#x79cd;&#x4f7f;&#x7528;&#x5173;&#x7cfb;&#xff0c;&#x7279;&#x5b9a;&#x4e8b;&#x7269;&#x7684;&#x6539;&#x53d8;&#x6709;&#x53ef;&#x80fd;&#x4f1a;&#x5f71;&#x54cd;&#x5230;&#x4f7f;&#x7528;&#x8be5;&#x4e8b;&#x7269;&#x7684;&#x5176;&#x4ed6;&#x4e8b;&#x7269;&#xff0c;&#x5728;&#x9700;&#x8981;&#x8868;&#x793a;&#x4e00;&#x4e2a;&#x4e8b;&#x7269;&#x4f7f;&#x7528;&#x53e6;&#x4e00;&#x4e2a;&#x4e8b;&#x7269;&#x65f6;&#x4f7f;&#x7528;&#x4f9d;&#x8d56;&#x5173;&#x7cfb;&#x3002;&#x5927;&#x591a;&#x6570;&#x60c5;&#x51b5;&#x4e0b;&#xff0c;&#x4f9d; &#x8d56;&#x5173;&#x7cfb;&#x4f53;&#x73b0;&#x5728;&#x67d0;&#x4e2a;&#x7c7b;&#x7684;&#x65b9;&#x6cd5;&#x4f7f;&#x7528;&#x53e6;&#x4e00;&#x4e2a;&#x7c7b;&#x7684;&#x5bf9;&#x8c61;&#x4f5c;&#x4e3a;&#x53c2;&#x6570;&#x3002;
  </blockquote></li>
</ul>
<p>![](image/dependency.png)</p>

<blockquote>
<p>&#x4f9d;&#x8d56;&#x5173;&#x7cfb;&#x6709;&#x5982;&#x4e0b;&#x4e09;&#x79cd;&#x60c5;&#x51b5;&#xff1a; * A&#x7c7b;&#x662f;B&#x7c7b;&#x4e2d;&#x7684;&#xff08;&#x67d0;&#x4e2d;&#x65b9;&#x6cd5;&#x7684;&#xff09;&#x5c40;&#x90e8;&#x53d8;&#x91cf;&#xff1b; * A&#x7c7b;&#x662f;B&#x7c7b;&#x65b9;&#x6cd5;&#x5f53;&#x4e2d;&#x7684;&#x4e00;&#x4e2a;&#x53c2;&#x6570;&#xff1b; * A&#x7c7b;&#x5bf9;B&#x7c7b;&#x7684;&#x9759;&#x6001;&#x65b9;&#x6cd5;&#x8c03;&#x7528;&#xff1b; * A&#x7c7b;&#x5411;B&#x7c7b;&#x53d1;&#x9001;&#x6d88;&#x606f;&#xff0c;&#x4ece;&#x800c;&#x5f71;&#x54cd;B&#x7c7b;&#x53d1;&#x751f;&#x53d8;&#x5316;&#xff1b;</p>
</blockquote>

<ul>
  
<li></div>
<div class="section">
<h4><a name="a2.4_"></a>2.4 &#x5173;&#x8054;</h4>
  
<blockquote>&#x5173;&#x7cfb;&#x662f;&#x7c7b;&#x4e0e;&#x7c7b;&#x4e4b;&#x95f4;&#x7684;&#x8054;&#x63a5;&#xff0c;&#x5b83;&#x4f7f;&#x4e00;&#x4e2a;&#x7c7b;&#x77e5;&#x9053;&#x53e6;&#x4e00;&#x4e2a;&#x7c7b;&#x7684;&#x5c5e;&#x6027;&#x548c;&#x65b9;&#x6cd5;&#x3002;&#x5173;&#x8054;&#x53ef;&#x4ee5;&#x662f;&#x53cc;&#x5411;&#x7684;&#xff0c;&#x4e5f;&#x53ef;&#x4ee5;&#x662f;&#x5355;&#x5411;&#x7684;&#x3002;
  </blockquote></li>
</ul>

<blockquote>
<p>&#x7ed9;&#x5b9a;&#x6709;&#x5173;&#x8054;&#x7684;&#x4e24;&#x4e2a;&#x7c7b;&#xff0c;&#x53ef;&#x4ee5;&#x4ece;&#x4e00;&#x4e2a;&#x7c7b;&#x7684;&#x5bf9;&#x8c61;&#x5f97;&#x5230;&#x53e6;&#x4e00;&#x4e2a;&#x7c7b;&#x7684;&#x5bf9;&#x8c61;&#x3002;&#x5173;&#x8054;&#x6709;&#x4e24;&#x5143;&#x5173;&#x7cfb;&#x548c;&#x591a;&#x5143;&#x5173;&#x7cfb;&#x3002;&#x4e24;&#x5143;&#x5173;&#x7cfb;&#x662f;&#x6307;&#x4e00;&#x79cd;&#x4e00;&#x5bf9;&#x4e00;&#x7684;&#x5173;&#x7cfb;&#xff0c;&#x591a;&#x5143;&#x5173;&#x7cfb;&#x662f;&#x4e00;&#x5bf9;&#x591a;&#x6216;&#x591a;&#x5bf9;&#x4e00;&#x7684;&#x5173;&#x7cfb;&#x3002;&#x4e24;&#x4e2a;&#x7c7b;&#x4e4b;&#x95f4;&#x7684;&#x7b80;&#x5355;&#x5173;&#x8054;&#x8868;&#x793a;&#x4e86;&#x4e24;&#x4e2a;&#x540c;&#x7b49;&#x5730;&#x4f4d;&#x7c7b;&#x4e4b;&#x95f4;&#x7684;&#x7ed3;&#x6784;&#x5173;&#x7cfb;&#x3002;&#x5f53;&#x4f60;&#x60f3;&#x8981;&#x8868;&#x793a;&#x7ed3;&#x6784;&#x5316;&#x5173;&#x7cfb;&#x65f6;&#x4f7f;&#x7528;&#x5173;&#x8054;&#x3002;</p>
<p><b>&#x5728;Java&#x8bed;&#x8a00;&#x4e2d;&#xff0c;&#x5173;&#x8054;&#x5173;&#x7cfb;&#x4e00;&#x822c;&#x4f7f;&#x7528;&#x6210;&#x5458;&#x53d8;&#x91cf;&#x6765;&#x5b9e;&#x73b0;&#x3002;</b></p>
</blockquote>
<p>![](image/association.png)</p>

<ul>
  
<li></div>
<div class="section">
<h4><a name="a2.5_"></a>2.5 &#x805a;&#x5408;</h4>
  
<blockquote>&#x805a;&#x5408;&#x5173;&#x7cfb;&#x662f;&#x5173;&#x8054;&#x5173;&#x7cfb;&#x7684;&#x4e00;&#x79cd;&#xff0c;&#x662f;&#x5f3a;&#x7684;&#x5173;&#x8054;&#x5173;&#x7cfb;&#x3002; &#x805a;&#x5408;&#x662f;&#x6574;&#x4f53;&#x548c;&#x4e2a;&#x4f53;&#x4e4b;&#x95f4;&#x7684;&#x5173;&#x7cfb;&#x3002;&#x4f8b;&#x5982;&#xff0c;School&#x7c7b;&#x4e0e;Student&#x7c7b;&#x7684;&#x5173;&#x7cfb;&#x4fbf;&#x6574;&#x4f53;&#x548c;&#x4e2a;&#x4f53;&#x7684;&#x5173;&#x7cfb;&#x3002; &#x4e0e;&#x5173;&#x8054;&#x5173;&#x7cfb;&#x4e00;&#x6837;&#xff0c;&#x805a;&#x5408;&#x5173;&#x7cfb;&#x4e5f;&#x662f;&#x901a;&#x8fc7;&#x5b9e;&#x4f8b;&#x53d8;&#x91cf;&#x5b9e;&#x73b0;&#x7684;&#x3002; &#x4f46;&#x662f;&#x5173;&#x8054;&#x5173;&#x7cfb;&#x6240;&#x6d89;&#x53ca;&#x7684;&#x4e24;&#x4e2a;&#x7c7b;&#x662f;&#x5904;&#x5728;&#x540c;&#x4e00;&#x5c42;&#x6b21;&#x4e0a;&#x7684;&#xff0c;&#x800c;&#x5728;&#x805a;&#x5408;&#x5173;&#x7cfb;&#x4e2d;&#xff0c;&#x4e24;&#x4e2a;&#x7c7b;&#x662f;&#x5904;&#x5728;&#x4e0d;&#x5e73;&#x7b49;&#x5c42;&#x6b21;&#x4e0a;&#x7684;&#xff0c; &#x4e00;&#x4e2a;&#x4ee3;&#x8868;&#x6574;&#x4f53;&#xff0c;&#x53e6;&#x4e00;&#x4e2a;&#x4ee3;&#x8868;&#x90e8;&#x5206;&#x3002;
  </blockquote></li>
</ul>
<p>![](image/aggregation.png)</p>

<ul>
  
<li></div>
<div class="section">
<h4><a name="a2.6_"></a>2.6 &#x7ec4;&#x5408;</h4>
  
<blockquote>&#x7ec4;&#x5408;&#x5173;&#x7cfb;&#x4e5f;&#x8868;&#x793a;&#x7c7b;&#x4e4b;&#x95f4;&#x6574;&#x4f53;&#x548c;&#x90e8;&#x5206;&#x7684;&#x5173;&#x7cfb;&#xff0c;&#x4f46;&#x662f;&#x7ec4;&#x5408;&#x5173;&#x7cfb;&#x4e2d;&#x90e8;&#x5206;&#x548c;&#x6574;&#x4f53;&#x5177;&#x6709;&#x7edf;&#x4e00;&#x7684;&#x751f;&#x5b58;&#x671f;&#x3002; &#x4e00;&#x65e6;&#x6574;&#x4f53;&#x5bf9;&#x8c61;&#x4e0d;&#x5b58;&#x5728;&#xff0c;&#x90e8;&#x5206;&#x5bf9;&#x8c61;&#x4e5f;&#x5c06;&#x4e0d;&#x5b58;&#x5728;&#xff0c;&#x90e8;&#x5206;&#x5bf9;&#x8c61;&#x4e0e;&#x6574;&#x4f53;&#x5bf9;&#x8c61;&#x4e4b;&#x95f4;&#x5177;&#x6709; <b>&#x540c;&#x751f;&#x5171;&#x6b7b;</b> &#x7684;&#x5173;&#x7cfb;&#x3002;
  </blockquote></li>
</ul>
<p>![](image/composition.png)</p></div></div></div>
<div class="section">
<h2><a name="a3_"></a>3 &#x65f6;&#x5e8f;&#x56fe;</h2>

<blockquote>
<p>&#x65f6;&#x5e8f;&#x56fe;&#x663e;&#x793a;&#x5177;&#x4f53;&#x7528;&#x4f8b;&#xff08;&#x6216;&#x8005;&#x662f;&#x7528;&#x4f8b;&#x7684;&#x4e00;&#x90e8;&#x5206;&#xff09;&#x7684;&#x8be6;&#x7ec6;&#x6d41;&#x7a0b;&#x3002; &#x5b83;&#x51e0;&#x4e4e;&#x662f;&#x81ea;&#x63cf;&#x8ff0;&#x7684;&#xff0c;&#x5e76;&#x4e14;&#x663e;&#x793a;&#x4e86;&#x6d41;&#x7a0b;&#x4e2d;&#x4e2d;&#x4e0d;&#x540c;&#x5bf9;&#x8c61;&#x4e4b;&#x95f4;&#x7684;&#x8c03;&#x7528;&#x5173;&#x7cfb;&#xff0c;&#x540c;&#x65f6;&#x8fd8;&#x53ef;&#x4ee5;&#x5f88;&#x8be6;&#x7ec6;&#x5730;&#x663e;&#x793a;&#x5bf9;&#x4e0d;&#x540c;&#x5bf9;&#x8c61;&#x7684;&#x4e0d;&#x540c;&#x8c03;&#x7528;&#x3002;</p>
</blockquote>
<p>&#x53c2;&#x8003;: * <a class="externalLink" href="http://www.cnblogs.com/olvo/archive/2012/05/03/2481014.html">UML&#x7c7b;&#x56fe;&#x5173;&#x7cfb;&#xff08;&#x6cdb;&#x5316; &#x3001;&#x7ee7;&#x627f;&#x3001;&#x5b9e;&#x73b0;&#x3001;&#x4f9d;&#x8d56;&#x3001;&#x5173;&#x8054;&#x3001;&#x805a;&#x5408;&#x3001;&#x7ec4;&#x5408;&#xff09;</a></p></div>
      </div>
    </div>
    <div class="clear">
      <hr/>
    </div>
    <div id="footer">
      <div class="xright">
              Copyright &#169;                   2018.
          All rights reserved.    
                  </div>
      <div class="clear">
        <hr/>
      </div>
    </div>
  </body>
</html>
