<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!-- Generated by Apache Maven Doxia Site Renderer 1.7.4 at 2018-03-24 -->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en">
  <head>
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
    <title>io &#x2013; linux 系统IO</title>
    <style type="text/css" media="all">
      @import url("./css/maven-base.css");
      @import url("./css/maven-theme.css");
      @import url("./css/site.css");
    </style>
    <link rel="stylesheet" href="./css/print.css" type="text/css" media="print" />
    <meta http-equiv="Content-Language" content="en" />
        
        </head>
  <body class="composite">
    <div id="banner">
                    <div id="bannerLeft">
                io
                </div>
                    <div class="clear">
        <hr/>
      </div>
    </div>
    <div id="breadcrumbs">
          
                <div class="xleft">
        <span id="publishDate">Last Published: 2018-03-24</span>
                  &nbsp;| <span id="projectVersion">Version: 1.0-SNAPSHOT</span>
                      </div>
            <div class="xright">                    <a href="./" title="io">io</a>
            
      </div>
      <div class="clear">
        <hr/>
      </div>
    </div>
    <div id="leftColumn">
      <div id="navcolumn">
           
                                <h5>Parent Project</h5>
                  <ul>
                  <li class="none">
                          <a href="../index.html" title="language-advance">language-advance</a>
            </li>
          </ul>
                       <h5>Project Documentation</h5>
                  <ul>
                                                                                                                                                                                                                                                        <li class="collapsed">
                          <a href="project-info.html" title="Project Information">Project Information</a>
                  </li>
                                                                                      <li class="collapsed">
                          <a href="project-reports.html" title="Project Reports">Project Reports</a>
                  </li>
          </ul>
                             <a href="http://maven.apache.org/" title="Built by Maven" class="poweredBy">
        <img class="poweredBy" alt="Built by Maven" src="./images/logos/maven-feather.png" />
      </a>
                 
            </div>
    </div>
    <div id="bodyColumn">
      <div id="contentBox">
        <h1>linux &#x7cfb;&#x7edf;IO</h1>
<div class="section">
<h2><a name="a1IO_"></a>1&#x3001;IO &#x6a21;&#x578b;</h2>
<div class="section">
<h3><a name="a"></a>&#x540c;&#x6b65;&#x548c;&#x5f02;&#x6b65;</h3>

<blockquote>
  
<ul>
    
<li>
<p>&#x6240;&#x8c13;&#x540c;&#x6b65;&#x5c31;&#x662f;&#x4e00;&#x4e2a;&#x4efb;&#x52a1;&#x7684;&#x5b8c;&#x6210;&#x9700;&#x8981;&#x4f9d;&#x8d56;&#x53e6;&#x5916;&#x4e00;&#x4e2a;&#x4efb;&#x52a1;&#x65f6;&#xff0c;&#x53ea;&#x6709;&#x7b49;&#x5f85;&#x88ab;&#x4f9d;&#x8d56;&#x7684;&#x4efb;&#x52a1;&#x5b8c;&#x6210;&#x540e;&#xff0c;&#x4f9d;&#x8d56;&#x7684;&#x4efb;&#x52a1;&#x624d;&#x80fd;&#x7b97;&#x5b8c;&#x6210;&#xff0c;&#x8fd9;&#x662f;&#x4e00;&#x79cd;&#x53ef;&#x9760;&#x7684;&#x4efb;&#x52a1;&#x5e8f;&#x5217;&#x3002; &#x8981;&#x4e48;&#x6210;&#x529f;&#x90fd;&#x6210;&#x529f;&#xff0c;&#x5931;&#x8d25;&#x90fd;&#x5931;&#x8d25;&#xff0c;&#x4e24;&#x4e2a;&#x4efb;&#x52a1;&#x7684;&#x72b6;&#x6001;&#x53ef;&#x4ee5;&#x4fdd;&#x6301;&#x4e00;&#x81f4;&#x3002;&#x800c;&#x5f02;&#x6b65;&#x662f;&#x4e0d;&#x9700;&#x8981;&#x7b49;&#x5f85;&#x88ab;&#x4f9d;&#x8d56;&#x7684;&#x4efb;&#x52a1;&#x5b8c;&#x6210;&#xff0c; &#x53ea;&#x662f;&#x901a;&#x77e5;&#x88ab;&#x4f9d;&#x8d56;&#x7684;&#x4efb;&#x52a1;&#x8981;&#x5b8c;&#x6210;&#x4ec0;&#x4e48;&#x5de5;&#x4f5c;&#xff0c;&#x4f9d;&#x8d56;&#x7684;&#x4efb;&#x52a1;&#x4e5f;&#x7acb;&#x5373;&#x6267;&#x884c;&#xff0c;&#x53ea;&#x8981;&#x81ea;&#x5df1;&#x5b8c;&#x6210;&#x4e86;&#x6574;&#x4e2a;&#x4efb;&#x52a1;&#x5c31;&#x7b97;&#x5b8c;&#x6210;&#x4e86;&#x3002; &#x81f3;&#x4e8e;&#x88ab;&#x4f9d;&#x8d56;&#x7684;&#x4efb;&#x52a1;&#x6700;&#x7ec8;&#x662f;&#x5426;&#x771f;&#x6b63;&#x5b8c;&#x6210;&#xff0c;&#x4f9d;&#x8d56;&#x5b83;&#x7684;&#x4efb;&#x52a1;&#x65e0;&#x6cd5;&#x786e;&#x5b9a;&#xff0c;&#x6240;&#x4ee5;&#x5b83;&#x662f;&#x4e0d;&#x53ef;&#x9760;&#x7684;&#x4efb;&#x52a1;&#x5e8f;&#x5217;&#x3002; &#x6211;&#x4eec;&#x53ef;&#x4ee5;&#x7528;&#x6253;&#x7535;&#x8bdd;&#x548c;&#x53d1;&#x77ed;&#x4fe1;&#x6765;&#x5f88;&#x597d;&#x7684;&#x6bd4;&#x55bb;&#x540c;&#x6b65;&#x4e0e;&#x5f02;&#x6b65;&#x64cd;&#x4f5c;&#x3002;</p></li>
    
<li>
<p>&#x5728;&#x8bbe;&#x8ba1;&#x5230; IO &#x5904;&#x7406;&#x65f6;&#x901a;&#x5e38;&#x90fd;&#x4f1a;&#x9047;&#x5230;&#x4e00;&#x4e2a;&#x662f;&#x540c;&#x6b65;&#x8fd8;&#x662f;&#x5f02;&#x6b65;&#x7684;&#x5904;&#x7406;&#x65b9;&#x5f0f;&#x7684;&#x9009;&#x62e9;&#x95ee;&#x9898;&#x3002;&#x56e0;&#x4e3a;&#x540c;&#x6b65;&#x4e0e;&#x5f02;&#x6b65;&#x7684; I/O &#x5904;&#x7406;&#x65b9;&#x5f0f;&#x5bf9;&#x8c03;&#x7528;&#x8005;&#x7684;&#x5f71;&#x54cd;&#x5f88;&#x5927;&#xff0c; &#x5728;&#x6570;&#x636e;&#x5e93;&#x4ea7;&#x54c1;&#x4e2d;&#x90fd;&#x4f1a;&#x9047;&#x5230;&#x8fd9;&#x4e2a;&#x95ee;&#x9898;&#x3002;&#x56e0;&#x4e3a; I/O &#x64cd;&#x4f5c;&#x901a;&#x5e38;&#x662f;&#x4e00;&#x4e2a;&#x975e;&#x5e38;&#x8017;&#x65f6;&#x7684;&#x64cd;&#x4f5c;&#xff0c;&#x5728;&#x4e00;&#x4e2a;&#x4efb;&#x52a1;&#x5e8f;&#x5217;&#x4e2d; I/O &#x901a;&#x5e38;&#x90fd;&#x662f;&#x6027;&#x80fd;&#x74f6;&#x9888;&#x3002; &#x4f46;&#x662f;&#x540c;&#x6b65;&#x4e0e;&#x5f02;&#x6b65;&#x7684;&#x5904;&#x7406;&#x65b9;&#x5f0f;&#x5bf9;&#x7a0b;&#x5e8f;&#x7684;&#x53ef;&#x9760;&#x6027;&#x5f71;&#x54cd;&#x975e;&#x5e38;&#x5927;&#xff0c;&#x540c;&#x6b65;&#x80fd;&#x591f;&#x4fdd;&#x8bc1;&#x7a0b;&#x5e8f;&#x7684;&#x53ef;&#x9760;&#x6027;&#xff0c;&#x800c;&#x5f02;&#x6b65;&#x53ef;&#x4ee5;&#x63d0;&#x5347;&#x7a0b;&#x5e8f;&#x7684;&#x6027;&#x80fd;&#xff0c; &#x5fc5;&#x987b;&#x5728;&#x53ef;&#x9760;&#x6027;&#x548c;&#x6027;&#x80fd;&#x4e4b;&#x95f4;&#x505a;&#x4e2a;&#x5e73;&#x8861;&#xff0c;&#x6ca1;&#x6709;&#x5b8c;&#x7f8e;&#x7684;&#x89e3;&#x51b3;&#x529e;&#x6cd5;&#x3002;</p></li>
  </ul>
</blockquote></div>
<div class="section">
<h3><a name="a"></a>&#x963b;&#x585e;&#x548c;&#x975e;&#x963b;&#x585e;</h3>

<blockquote>
  
<ul>
    
<li>&#x963b;&#x585e;&#x4e0e;&#x975e;&#x963b;&#x585e;&#x4e3b;&#x8981;&#x662f;&#x4ece; CPU &#x7684;&#x6d88;&#x8017;&#x4e0a;&#x6765;&#x8bf4;&#x7684;&#xff0c;&#x963b;&#x585e;&#x5c31;&#x662f; CPU &#x505c;&#x4e0b;&#x6765;&#x7b49;&#x5f85;&#x4e00;&#x4e2a;&#x6162;&#x7684;&#x64cd;&#x4f5c;&#x5b8c;&#x6210; CPU &#x624d;&#x63a5;&#x7740;&#x5b8c;&#x6210;&#x5176;&#x5b83;&#x7684;&#x4e8b;&#x3002; &#x975e;&#x963b;&#x585e;&#x5c31;&#x662f;&#x5728;&#x8fd9;&#x4e2a;&#x6162;&#x7684;&#x64cd;&#x4f5c;&#x5728;&#x6267;&#x884c;&#x65f6; CPU &#x53bb;&#x5e72;&#x5176;&#x5b83;&#x522b;&#x7684;&#x4e8b;&#xff0c;&#x7b49;&#x8fd9;&#x4e2a;&#x6162;&#x7684;&#x64cd;&#x4f5c;&#x5b8c;&#x6210;&#x65f6;&#xff0c;CPU &#x518d;&#x63a5;&#x7740;&#x5b8c;&#x6210;&#x540e;&#x7eed;&#x7684;&#x64cd;&#x4f5c;&#x3002; &#x867d;&#x7136;&#x8868;&#x9762;&#x4e0a;&#x770b;&#x975e;&#x963b;&#x585e;&#x7684;&#x65b9;&#x5f0f;&#x53ef;&#x4ee5;&#x660e;&#x663e;&#x7684;&#x63d0;&#x9ad8; CPU &#x7684;&#x5229;&#x7528;&#x7387;&#xff0c;&#x4f46;&#x662f;&#x4e5f;&#x5e26;&#x4e86;&#x53e6;&#x5916;&#x4e00;&#x79cd;&#x540e;&#x679c;&#x5c31;&#x662f;&#x7cfb;&#x7edf;&#x7684;&#x7ebf;&#x7a0b;&#x5207;&#x6362;&#x589e;&#x52a0;&#x3002; &#x589e;&#x52a0;&#x7684; CPU &#x4f7f;&#x7528;&#x65f6;&#x95f4;&#x80fd;&#x4e0d;&#x80fd;&#x8865;&#x507f;&#x7cfb;&#x7edf;&#x7684;&#x5207;&#x6362;&#x6210;&#x672c;&#x9700;&#x8981;&#x597d;&#x597d;&#x8bc4;&#x4f30;&#x3002;</li>
  </ul>
</blockquote></div>
<div class="section">
<h3><a name="a"></a>&#x56db;&#x79cd;&#x7ec4;&#x5408;&#x65b9;&#x5f0f;</h3>

<table border="0" class="bodyTable">
  <thead>
    
<tr class="a">
      
<th>&#x7ec4;&#x5408;&#x65b9;&#x5f0f; </th>
      
<th>&#x6027;&#x80fd;&#x5206;&#x6790;</th>
    </tr>
  </thead>
  <tbody>
    
<tr class="b">
      
<td>&#x540c;&#x6b65;&#x963b;&#x585e; </td>
      
<td>&#x6700;&#x5e38;&#x7528;&#x7684;&#x4e00;&#x79cd;&#x7528;&#x6cd5;&#xff0c;&#x4f7f;&#x7528;&#x4e5f;&#x662f;&#x6700;&#x7b80;&#x5355;&#x7684;&#xff0c;&#x4f46;&#x662f; I/O &#x6027;&#x80fd;&#x4e00;&#x822c;&#x5f88;&#x5dee;&#xff0c;CPU &#x5927;&#x90e8;&#x5206;&#x5728;&#x7a7a;&#x95f2;&#x72b6;&#x6001;&#x3002;</td>
    </tr>
    
<tr class="a">
      
<td>&#x540c;&#x6b65;&#x975e;&#x963b;&#x585e; </td>
      
<td>&#x63d0;&#x5347; I/O &#x6027;&#x80fd;&#x7684;&#x5e38;&#x7528;&#x624b;&#x6bb5;&#xff0c;&#x5c31;&#x662f;&#x5c06; I/O &#x7684;&#x963b;&#x585e;&#x6539;&#x6210;&#x975e;&#x963b;&#x585e;&#x65b9;&#x5f0f;&#xff0c;&#x5c24;&#x5176;&#x5728;&#x7f51;&#x7edc; I/O &#x662f;&#x957f;&#x8fde;&#x63a5;, &#x540c;&#x65f6;&#x4f20;&#x8f93;&#x6570;&#x636e;&#x4e5f;&#x4e0d;&#x662f;&#x5f88;&#x591a;&#x7684;&#x60c5;&#x51b5;&#x4e0b;&#xff0c;&#x63d0;&#x5347;&#x6027;&#x80fd;&#x975e;&#x5e38;&#x6709;&#x6548;&#x3002;&#x8fd9;&#x79cd;&#x65b9;&#x5f0f;&#x901a;&#x5e38;&#x80fd;&#x63d0;&#x5347; I/O &#x6027;&#x80fd;&#xff0c;&#x4f46;&#x662f;&#x4f1a;&#x589e;&#x52a0; CPU &#x6d88;&#x8017;&#xff0c;&#x8981;&#x8003;&#x8651;&#x589e;&#x52a0;&#x7684; I/O &#x6027;&#x80fd;&#x80fd;&#x4e0d;&#x80fd;&#x8865;&#x507f; CPU &#x7684;&#x6d88;&#x8017;&#xff0c;&#x4e5f;&#x5c31;&#x662f;&#x7cfb;&#x7edf;&#x7684;&#x74f6;&#x9888;&#x662f;&#x5728; I/O &#x8fd8;&#x662f;&#x5728; CPU &#x4e0a;&#x3002;</td>
    </tr>
    
<tr class="b">
      
<td>&#x5f02;&#x6b65;&#x963b;&#x585e; </td>
      
<td>&#x8fd9;&#x79cd;&#x65b9;&#x5f0f;&#x5728;&#x5206;&#x5e03;&#x5f0f;&#x6570;&#x636e;&#x5e93;&#x4e2d;&#x7ecf;&#x5e38;&#x7528;&#x5230;&#xff0c;&#x4f8b;&#x5982;&#x5728;&#x7f51;&#x4e00;&#x4e2a;&#x5206;&#x5e03;&#x5f0f;&#x6570;&#x636e;&#x5e93;&#x4e2d;&#x5199;&#x4e00;&#x6761;&#x8bb0;&#x5f55;&#xff0c;&#x901a;&#x5e38;&#x4f1a;&#x6709;&#x4e00;&#x4efd;&#x662f;&#x540c;&#x6b65;&#x963b;&#x585e;&#x7684;&#x8bb0;&#x5f55;&#xff0c;&#x800c;&#x8fd8;&#x6709;&#x4e24;&#x81f3;&#x4e09;&#x4efd;&#x662f;&#x5907;&#x4efd;&#x8bb0;&#x5f55;&#x4f1a;&#x5199;&#x5230;&#x5176;&#x5b83;&#x673a;&#x5668;&#x4e0a;&#xff0c;&#x8fd9;&#x4e9b;&#x5907;&#x4efd;&#x8bb0;&#x5f55;&#x901a;&#x5e38;&#x90fd;&#x662f;&#x91c7;&#x7528;&#x5f02;&#x6b65;&#x963b;&#x585e;&#x7684;&#x65b9;&#x5f0f;&#x5199; I/O&#x3002;&#x5f02;&#x6b65;&#x963b;&#x585e;&#x5bf9;&#x7f51;&#x7edc; I/O &#x80fd;&#x591f;&#x63d0;&#x5347;&#x6548;&#x7387;&#xff0c;&#x5c24;&#x5176;&#x50cf;&#x4e0a;&#x9762;&#x8fd9;&#x79cd;&#x540c;&#x65f6;&#x5199;&#x591a;&#x4efd;&#x76f8;&#x540c;&#x6570;&#x636e;&#x7684;&#x60c5;&#x51b5;&#x3002;</td>
    </tr>
    
<tr class="a">
      
<td>&#x5f02;&#x6b65;&#x975e;&#x963b;&#x585e; </td>
      
<td>&#x8fd9;&#x79cd;&#x7ec4;&#x5408;&#x65b9;&#x5f0f;&#x7528;&#x8d77;&#x6765;&#x6bd4;&#x8f83;&#x590d;&#x6742;&#xff0c;&#x53ea;&#x6709;&#x5728;&#x4e00;&#x4e9b;&#x975e;&#x5e38;&#x590d;&#x6742;&#x7684;&#x5206;&#x5e03;&#x5f0f;&#x60c5;&#x51b5;&#x4e0b;&#x4f7f;&#x7528;&#xff0c;&#x50cf;&#x96c6;&#x7fa4;&#x4e4b;&#x95f4;&#x7684;&#x6d88;&#x606f;&#x540c;&#x6b65;&#x673a;&#x5236;&#x4e00;&#x822c;&#x7528;&#x8fd9;&#x79cd; I/O &#x7ec4;&#x5408;&#x65b9;&#x5f0f;&#x3002;&#x5982; Cassandra &#x7684; Gossip &#x901a;&#x4fe1;&#x673a;&#x5236;&#x5c31;&#x662f;&#x91c7;&#x7528;&#x5f02;&#x6b65;&#x975e;&#x963b;&#x585e;&#x7684;&#x65b9;&#x5f0f;&#x3002;&#x5b83;&#x9002;&#x5408;&#x540c;&#x65f6;&#x8981;&#x4f20;&#x591a;&#x4efd;&#x76f8;&#x540c;&#x7684;&#x6570;&#x636e;&#x5230;&#x96c6;&#x7fa4;&#x4e2d;&#x4e0d;&#x540c;&#x7684;&#x673a;&#x5668;&#xff0c;&#x540c;&#x65f6;&#x6570;&#x636e;&#x7684;&#x4f20;&#x8f93;&#x91cf;&#x867d;&#x7136;&#x4e0d;&#x5927;&#xff0c;&#x4f46;&#x662f;&#x5374;&#x975e;&#x5e38;&#x9891;&#x7e41;&#x3002;&#x8fd9;&#x79cd;&#x7f51;&#x7edc; I/O &#x7528;&#x8fd9;&#x4e2a;&#x65b9;&#x5f0f;&#x6027;&#x80fd;&#x80fd;&#x8fbe;&#x5230;&#x6700;&#x9ad8;&#x3002;</td>
    </tr>
  </tbody>
</table>
<p>## </p></div></div>
      </div>
    </div>
    <div class="clear">
      <hr/>
    </div>
    <div id="footer">
      <div class="xright">
              Copyright &#169;                   2018.
          All rights reserved.    
                  </div>
      <div class="clear">
        <hr/>
      </div>
    </div>
  </body>
</html>
