<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!-- Generated by Apache Maven Doxia Site Renderer 1.7.4 at 2018-03-24 -->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en">
  <head>
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
    <title>java-learn &#x2013; 知识梳理</title>
    <style type="text/css" media="all">
      @import url("./css/maven-base.css");
      @import url("./css/maven-theme.css");
      @import url("./css/site.css");
    </style>
    <link rel="stylesheet" href="./css/print.css" type="text/css" media="print" />
    <meta http-equiv="Content-Language" content="en" />
        
        </head>
  <body class="composite">
    <div id="banner">
                    <div id="bannerLeft">
                java-learn
                </div>
                    <div class="clear">
        <hr/>
      </div>
    </div>
    <div id="breadcrumbs">
          
                <div class="xleft">
        <span id="publishDate">Last Published: 2018-03-24</span>
                  &nbsp;| <span id="projectVersion">Version: 1.0-SNAPSHOT</span>
                      </div>
            <div class="xright">                    <a href="./" title="java-learn">java-learn</a>
            
      </div>
      <div class="clear">
        <hr/>
      </div>
    </div>
    <div id="leftColumn">
      <div id="navcolumn">
           
                                          <h5>Modules</h5>
                  <ul>
                  <li class="none">
                          <a href="language-feature/index.html" title="language-feature">language-feature</a>
            </li>
                  <li class="none">
                          <a href="framework/index.html" title="framework">framework</a>
            </li>
                  <li class="none">
                          <a href="design-pattern/index.html" title="design-pattern">design-pattern</a>
            </li>
                  <li class="none">
                          <a href="convenient-util/index.html" title="convenient-util">convenient-util</a>
            </li>
                  <li class="none">
                          <a href="data-structure/index.html" title="data-structure">data-structure</a>
            </li>
                  <li class="none">
                          <a href="algorithm/index.html" title="algorithm">algorithm</a>
            </li>
                  <li class="none">
                          <a href="production-component/index.html" title="production-component">production-component</a>
            </li>
                  <li class="none">
                          <a href="language-advance/index.html" title="language-advance">language-advance</a>
            </li>
                  <li class="none">
                          <a href="dev-ops/index.html" title="dev-ops">dev-ops</a>
            </li>
                  <li class="none">
                          <a href="big-data/index.html" title="big-data">big-data</a>
            </li>
                  <li class="none">
                          <a href="code-practice/index.html" title="code-practice">code-practice</a>
            </li>
          </ul>
                       <h5>Project Documentation</h5>
                  <ul>
                                                                                                                                                                                                                                                                                            <li class="collapsed">
                          <a href="project-info.html" title="Project Information">Project Information</a>
                  </li>
                                                                                                        <li class="collapsed">
                          <a href="project-reports.html" title="Project Reports">Project Reports</a>
                  </li>
          </ul>
                             <a href="http://maven.apache.org/" title="Built by Maven" class="poweredBy">
        <img class="poweredBy" alt="Built by Maven" src="./images/logos/maven-feather.png" />
      </a>
                 
            </div>
    </div>
    <div id="bodyColumn">
      <div id="contentBox">
        <h1>&#x77e5;&#x8bc6;&#x68b3;&#x7406;</h1>
<div class="section">
<h2><a name="a1java"></a>1&#x3001;java&#x57fa;&#x7840;</h2>
<div class="section">
<h3><a name="a1.1_java_"></a>1.1 java &#x6570;&#x636e;&#x7ed3;&#x6784;</h3>
<div class="section">
<h4><a name="a1.1.1_Map"></a>1.1.1 Map</h4></div>
<div class="section">
<h4><a name="a1.1.2_List"></a>1.1.2 List</h4></div>
<div class="section">
<h4><a name="a1.1.3_Set"></a>1.1.3 Set</h4></div></div>
<div class="section">
<h3><a name="a1.2_java_IO"></a>1.2 java IO</h3>
<div class="section">
<h4><a name="a1.2.1_IO_"></a>1.2.1 IO &#x7c7b;&#x578b;</h4></div>
<div class="section">
<h4><a name="a1.2.2_NIO"></a>1.2.2 NIO</h4></div></div>
<div class="section">
<h3><a name="a1.3_java_"></a>1.3 java &#x591a;&#x7ebf;&#x7a0b;</h3>
<div class="section">
<h4><a name="a1.3.1_"></a>1.3.1 &#x7ebf;&#x7a0b;&#x6c60;</h4></div>
<div class="section">
<h4><a name="a1.3.2_"></a>1.3.2 &#x7ebf;&#x7a0b;&#x901a;&#x4fe1;</h4></div></div></div>
<div class="section">
<h2><a name="a2"></a>2&#x3001;&#x5e38;&#x7528;&#x6846;&#x67b6;</h2>
<div class="section">
<h3><a name="a2.1_spring"></a>2.1 spring</h3></div>
<div class="section">
<h3><a name="a2.2_spring-mvc"></a>2.2 spring-mvc</h3></div>
<div class="section">
<h3><a name="a2.3_spring-boot"></a>2.3 spring-boot</h3></div>
<div class="section">
<h3><a name="a2.4_spring-cloud"></a>2.4 spring-cloud</h3></div>
<div class="section">
<h3><a name="a2.5_apache-common-"></a>2.5 apache-common-*</h3></div></div>
<div class="section">
<h2><a name="a3"></a>3&#x3001;&#x8ba1;&#x7b97;&#x673a;&#x7f51;&#x7edc;</h2>
<div class="section">
<h3><a name="a3.1_tcpip_"></a>3.1 tcp/ip &#x4e09;&#x6b21;&#x63e1;&#x624b;&#x3001;&#x56db;&#x6b21;&#x6325;&#x624b;</h3></div>
<div class="section">
<h3><a name="a3.2_http_"></a>3.2 http &#x534f;&#x8bae;</h3></div></div>
<div class="section">
<h2><a name="a4linux"></a>4&#x3001;&#x64cd;&#x4f5c;&#x7cfb;&#x7edf;(linux)</h2>
<div class="section">
<h3><a name="a4.1_"></a>4.1 &#x5185;&#x5b58;&#x7ba1;&#x7406;</h3></div>
<div class="section">
<h3><a name="a4.2_"></a>4.2 &#x8fdb;&#x7a0b;&#x7ba1;&#x7406;</h3></div></div>
<div class="section">
<h2><a name="a5"></a>5&#x3001;&#x5e38;&#x7528;&#x8bbe;&#x8ba1;&#x6a21;&#x5f0f;</h2>

<blockquote>
<p>&#x5b9a;&#x4e49;&#x3001;uml&#x3001;&#x4f7f;&#x7528;&#x573a;&#x666f;&#x3001;&#x4f18;&#x7f3a;&#x70b9;</p>
</blockquote>
<div class="section">
<h3><a name="a5.1_UML"></a>5.1 UML</h3>
<div class="section">
<h4><a name="a5.1.1"></a>5.1.1</h4></div></div>
<div class="section">
<h3><a name="a5.2_"></a>5.2 &#x516d;&#x5927;&#x539f;&#x5219;</h3>

<ul>
  
<li>&#x5f00;&#x95ed; &#x6269;&#x5c55;&#x5f00;&#x653e;&#x3001;&#x4fee;&#x6539;&#x5173;&#x95ed;</li>
  
<li>&#x4f9d;&#x8d56;&#x5012;&#x7f6e;&#x539f;&#x5219; &#x9488;&#x5bf9;&#x63a5;&#x53e3;&#x7f16;&#x7a0b;&#xff0c;&#x5b9e;&#x73b0;&#x5f00;&#x95ed;&#x539f;&#x5219;&#x7684;&#x57fa;&#x7840;</li>
  
<li>&#x63a5;&#x53e3;&#x9694;&#x79bb;&#x539f;&#x5219; &#x5c3d;&#x91cf;&#x7ec6;&#x5316;&#x63a5;&#x53e3;&#xff0c;&#x964d;&#x4f4e;&#x8026;&#x5408;&#x5ea6;&#xff0c;&#x63a5;&#x53e3;&#x5355;&#x72ec;&#x8bbe;&#x8ba1;&#xff0c;&#x4e92;&#x76f8;&#x9694;&#x79bb;</li>
  
<li>&#x5408;&#x6210;&#x590d;&#x7528; &#x5c3d;&#x91cf;&#x4f7f;&#x7528;&#x805a;&#x5408;&#xff0c;&#x7ec4;&#x5408;&#xff0c;&#x800c;&#x4e0d;&#x662f;&#x7ee7;&#x627f;</li>
  
<li>&#x91cc;&#x6c0f;&#x66ff;&#x6362; &#x5b9e;&#x73b0;&#x62bd;&#x8c61;&#x7684;&#x89c4;&#x8303;&#xff0c;&#x5b9e;&#x73b0;&#x5b50;&#x7236;&#x7c7b;&#x4e92;&#x76f8;&#x66ff;&#x6362;</li>
  
<li>&#x8fea;&#x7c73;&#x7279;&#x6cd5;&#x5219; &#x53c8;&#x79f0;&#x6700;&#x5c11;&#x77e5;&#x9053;&#x539f;&#x5219;&#xff0c;&#x529f;&#x80fd;&#x6a21;&#x5757;&#x5c3d;&#x91cf;&#x72ec;&#x7acb;</li>
</ul></div>
<div class="section">
<h3><a name="a5.3_"></a>5.3 &#x8bbe;&#x8ba1;&#x6a21;&#x5f0f;</h3>
<div class="section">
<h4><a name="a5.3.1_5"></a>5.3.1 &#x521b;&#x5efa;&#x578b;&#xff08;5&#xff09;</h4>

<ul>
  
<li>&#x539f;&#x578b; &#x4e0d;&#x4f7f;&#x7528;new&#x5173;&#x952e;&#x5b57;&#x521b;&#x5efa;&#x5bf9;&#x8c61;&#xff0c;&#x800c;&#x662f;&#x901a;&#x8fc7;&#x5bf9;&#x8c61;&#x590d;&#x5236;&#x6765;&#x5b9e;&#x73b0;&#x65b0;&#x5bf9;&#x8c61;&#x7684;&#x521b;&#x5efa;&#x3002; java &#x4e2d;&#x7684; clone&#x65b9;&#x6cd5;&#xff0c;&#x5f53;&#x9700;&#x8981;&#x521b;&#x5efa;&#x5927;&#x91cf;&#x5bf9;&#x8c61;&#x65f6;&#x76f8;&#x6bd4;&#x5e8f;&#x5217;&#x5316;&#xff0f;&#x53cd;&#x5e8f;&#x5217;&#x5316;&#x62e5;&#x6709;&#x66f4;&#x9ad8;&#x7684;&#x6027;&#x80fd;</li>
  
<li>&#x5355;&#x4f8b; &#x786e;&#x4fdd;&#x67d0;&#x4e00;&#x4e2a;&#x7c7b;&#x53ea;&#x6709;&#x4e00;&#x4e2a;&#x5b9e;&#x4f8b;&#xff0c;&#x800c;&#x4e14;&#x81ea;&#x884c;&#x5b9e;&#x4f8b;&#x5316;&#x5e76;&#x5411;&#x6574;&#x4e2a;&#x7cfb;&#x7edf;&#x63d0;&#x4f9b;&#x8fd9;&#x4e2a;&#x5b9e;&#x4f8b;&#x3002;java &#x5b9e;&#x73b0;&#x5355;&#x4f8b;&#x7684;&#x591a;&#x79cd;&#x65b9;&#x5f0f;&#xff1a;&#x7ebf;&#x7a0b;&#x5b89;&#x5168;&#x6027;&#xff0f;&#x52a0;&#x8f7d;&#x65b9;&#x5f0f;&#xff0c;&#x7ebf;&#x7a0b;&#x5b89;&#x5168;&#xff0d;&#x61d2;&#x52a0;&#x8f7d;&#xff08;&#x5185;&#x90e8;&#x7c7b;&#x65b9;&#x5f0f;&#xff09;</li>
  
<li>&#x5de5;&#x5382; &#x5b9a;&#x4e49;&#x4e00;&#x4e2a;&#x7528;&#x4e8e;&#x521b;&#x5efa;&#x5bf9;&#x8c61;&#x7684;&#x63a5;&#x53e3;&#xff0c;&#x7531;&#x5b50;&#x7c7b;&#x51b3;&#x5b9a;&#x5b9e;&#x4f8b;&#x5316;&#x54ea;&#x4e00;&#x4e2a;&#x7c7b;&#xff0c;&#x4f7f;&#x4e00;&#x4e2a;&#x7c7b;&#x7684;&#x5b9e;&#x4f8b;&#x5316;&#x5ef6;&#x8fdf;&#x5230;&#x5b57;&#x7c7b;&#x3002;</li>
  
<li>&#x62bd;&#x8c61;&#x5de5;&#x5382; &#x4e3a;&#x521b;&#x5efa;&#x4e00;&#x7ec4;&#x76f8;&#x5173;&#x6216;&#x76f8;&#x4e92;&#x4f9d;&#x8d56;&#x7684;&#x5bf9;&#x8c61;&#x7684;&#x63d0;&#x4f9b;&#x4e00;&#x4e2a;&#x63a5;&#x53e3;&#xff0c;&#x4e14;&#x65e0;&#x9700;&#x6307;&#x5b9a;&#x4ed6;&#x4eec;&#x7684;&#x5177;&#x4f53;&#x7c7b;</li>
  
<li>&#x5efa;&#x9020;&#x8005; &#x5c06;&#x4e00;&#x4e2a;&#x590d;&#x6742;&#x5bf9;&#x8c61;&#x7684;&#x6784;&#x5efa;&#x4e0e;&#x5b83;&#x7684;&#x8868;&#x793a;&#x5206;&#x79bb;&#xff0c;&#x4f7f;&#x5f97;&#x540c;&#x6837;&#x7684;&#x6784;&#x5efa;&#x8fc7;&#x7a0b;&#x53ef;&#x4ee5;&#x521b;&#x5efa;&#x4e0d;&#x7528;&#x7684;&#x8868;&#x793a;&#x3002;</li>
</ul></div>
<div class="section">
<h4><a name="a5.3.2_7"></a>5.3.2 &#x7ed3;&#x6784;&#x578b;&#xff08;7&#xff09;</h4>

<ul>
  
<li>&#x7ec4;&#x5408; &#x5c06;&#x5bf9;&#x8c61;&#x7ec4;&#x5408;&#x6210;&#x6811;&#x5f62;&#x7ed3;&#x6784;&#x4ee5;&#x8868;&#x793a;&#x201c;&#x90e8;&#x5206;&#xff0d;&#x6574;&#x4f53;&#x201d;&#x7684;&#x5c42;&#x6b21;&#x7ed3;&#x6784;&#xff0c;&#x4f7f;&#x5f97;&#x7528;&#x6237;&#x5bf9;&#x5355;&#x4e2a;&#x5bf9;&#x8c61;&#x548c;&#x7ec4;&#x5408;&#x5bf9;&#x8c61;&#x7684;&#x4f7f;&#x7528;&#x5177;&#x6709;&#x4e00;&#x81f4;&#x6027;&#x3002;</li>
  
<li>&#x4eab;&#x5143; &#x4f7f;&#x7528;&#x5171;&#x4eab;&#x5bf9;&#x8c61;&#x53ef;&#x6709;&#x6548;&#x5730;&#x652f;&#x6301;&#x5927;&#x91cf;&#x7ec6;&#x7c92;&#x5ea6;&#x7684;&#x5bf9;&#x8c61;&#x3002;</li>
  
<li>&#x4ee3;&#x7406; &#x4e3a;&#x67d0;&#x4e00;&#x5bf9;&#x8c61;&#x63d0;&#x4f9b;&#x4e00;&#x79cd;&#x4ee3;&#x7406;&#x4ee5;&#x63a7;&#x5236;&#x5bf9;&#x8fd9;&#x4e2a;&#x5bf9;&#x8c61;&#x7684;&#x8bbf;&#x95ee;&#x3002;</li>
  
<li>&#x88c5;&#x9970;&#x5668; &#x52a8;&#x6001;&#x5730;&#x7ed9;&#x4e00;&#x4e2a;&#x5bf9;&#x8c61;&#x589e;&#x52a0;&#x4e00;&#x4e9b;&#x989d;&#x5916;&#x7684;&#x804c;&#x8d23;&#x3002;&#x6bd4;&#x751f;&#x6210;&#x5b50;&#x7c7b;&#x66f4;&#x52a0;&#x7075;&#x6d3b;&#x3002;</li>
  
<li>&#x5916;&#x89c2; &#x8981;&#x6c42;&#x4e00;&#x4e2a;&#x5b50;&#x7cfb;&#x7edf;&#x7684;&#x5916;&#x90e8;&#x4e0e;&#x5185;&#x90e8;&#x7684;&#x901a;&#x4fe1;&#x5fc5;&#x987b;&#x901a;&#x8fc7;&#x7edf;&#x4e00;&#x7684;&#x5bf9;&#x8c61;&#x8fdb;&#x884c;&#x3002;&#x5916;&#x89c2;&#x6a21;&#x5f0f;&#x63d0;&#x4f9b;&#x4e00;&#x4e2a;&#x9ad8;&#x5c42;&#x6b21;&#x7684;&#x63a5;&#x53e3;&#xff0c;&#x4f7f;&#x5f97;&#x5b50;&#x7cfb;&#x7edf;&#x66f4;&#x6613;&#x4f7f;&#x7528;&#x3002;</li>
  
<li>&#x6865;&#x63a5; &#x5c06;&#x62bd;&#x8c61;&#x548c;&#x5b9e;&#x73b0;&#x89e3;&#x8026;&#xff0c;&#x4f7f;&#x5f97;&#x4e24;&#x8005;&#x53ef;&#x4ee5;&#x72ec;&#x7acb;&#x53d8;&#x5316;&#x3002;</li>
  
<li>&#x9002;&#x914d;&#x5668; &#x5c06;&#x4e00;&#x4e2a;&#x7c7b;&#x7684;&#x63a5;&#x53e3;&#x53d8;&#x6362;&#x6210;&#x5ba2;&#x6237;&#x7aef;&#x6240;&#x671f;&#x5f85;&#x7684;&#x7684;&#x53e6;&#x4e00;&#x79cd;&#x63a5;&#x53e3;&#xff0c;&#x4ece;&#x800c;&#x4f7f;&#x539f;&#x672c;&#x56e0;&#x63a5;&#x53e3;&#x4e0d;&#x5339;&#x914d;&#x800c;&#x65e0;&#x6cd5;&#x5728;&#x4e00;&#x8d77;&#x5de5;&#x4f5c;&#x7684;&#x4e24;&#x4e2a;&#x7c7b;&#x80fd;&#x591f;&#x5728;&#x4e00;&#x8d77;&#x5de5;&#x4f5c;&#x3002;</li>
</ul></div>
<div class="section">
<h4><a name="a5.3.3__11"></a>5.3.3 &#x884c;&#x4e3a;&#x578b; &#xff08;11&#xff09;</h4>

<ul>
  
<li>&#x7b56;&#x7565; &#x5b9a;&#x4e49;&#x4e00;&#x7ec4;&#x7b97;&#x6cd5;&#xff0c;&#x5c06;&#x6bcf;&#x4e00;&#x4e2a;&#x7b97;&#x6cd5;&#x90fd;&#x5c01;&#x88c5;&#x8d77;&#x6765;&#xff0c;&#x5e76;&#x4e14;&#x4ed6;&#x4eec;&#x4e4b;&#x95f4;&#x53ef;&#x4ee5;&#x4e92;&#x76f8;&#x66ff;&#x6362;&#x3002;</li>
  
<li>&#x8d23;&#x4efb;&#x94fe; &#x4f7f;&#x591a;&#x4e2a;&#x5bf9;&#x8c61;&#x90fd;&#x6709;&#x673a;&#x4f1a;&#x5904;&#x7406;&#x8bf7;&#x6c42;&#xff0c;&#x4ece;&#x800c;&#x907f;&#x514d;&#x4e86;&#x8bf7;&#x6c42;&#x7684;&#x53d1;&#x9001;&#x8005;&#x548c;&#x63a5;&#x53d7;&#x8005;&#x4e4b;&#x95f4;&#x7684;&#x8026;&#x5408;&#x5173;&#x7cfb;&#x3002;&#x5c06;&#x8fd9;&#x4e9b;&#x5bf9;&#x8c61;&#x8fde;&#x6210;&#x4e00;&#x6761;&#x94fe;&#xff0c;&#x5e76;&#x6cbf;&#x7740;&#x8fd9;&#x6761;&#x94fe;&#x4f20;&#x9012;&#x7ed9;&#x6539;&#x8bf7;&#x6c42;&#xff0c;&#x76f4;&#x5230;&#x6709;&#x5bf9;&#x8c61;&#x5904;&#x7406;&#x5b83;&#x4e3a;&#x6b62;&#x3002;</li>
  
<li>&#x547d;&#x4ee4;&#x6a21;&#x5f0f; &#x5c06;&#x4e00;&#x4e2a;&#x8bf7;&#x6c42;&#x5c01;&#x88c5;&#x6210;&#x4e00;&#x4e2a;&#x5bf9;&#x8c61;&#xff0c;&#x4ece;&#x800c;&#x53ef;&#x4ee5;&#x4f7f;&#x7528;&#x4e0d;&#x540c;&#x7684;&#x8bf7;&#x6c42;&#x5427;&#x5ba2;&#x6237;&#x7aef;&#x53c2;&#x6570;&#x5316;&#xff0c;&#x5bf9;&#x8bf7;&#x6c42;&#x6392;&#x961f;&#x6216;&#x8005;&#x8bb0;&#x5f55;&#x8bf7;&#x6c42;&#x65e5;&#x5fd7;&#xff0c;&#x53ef;&#x4ee5;&#x63d0;&#x4f9b;&#x547d;&#x4ee4;&#x7684;&#x64a4;&#x9500;&#x548c;&#x6062;&#x590d;&#x529f;&#x80fd;&#x3002;</li>
  
<li>&#x72b6;&#x6001; &#x5f53;&#x4e00;&#x4e2a;&#x5bf9;&#x8c61;&#x5185;&#x5728;&#x72b6;&#x6001;&#x6539;&#x53d8;&#x65f6;&#x5141;&#x8bb8;&#x5176;&#x6539;&#x53d8;&#x884c;&#x4e3a;&#xff0c;&#x8fd9;&#x4e2a;&#x5bf9;&#x8c61;&#x770b;&#x8d77;&#x6765;&#x50cf;&#x6539;&#x53d8;&#x4e86;&#x5176;&#x7c7b;&#x3002;</li>
  
<li>&#x5907;&#x5fd8;&#x5f55; &#x5728;&#x4e0d;&#x7834;&#x73af;&#x5c01;&#x88c5;&#x6027;&#x7684;&#x524d;&#x63d0;&#x4e0b;&#xff0c;&#x6355;&#x83b7;&#x4e00;&#x4e2a;&#x5bf9;&#x8c61;&#x7684;&#x5185;&#x90e8;&#x72b6;&#x6001;&#xff0c;&#x5e76;&#x5728;&#x8be5;&#x5bf9;&#x8c61;&#x4e4b;&#x5916;&#x4fdd;&#x5b58;&#x8fd9;&#x4e2a;&#x72b6;&#x6001;&#x3002;&#x8fd9;&#x6837;&#x4ee5;&#x540e;&#x5c31;&#x53ef;&#x8bb2;&#x8be5;&#x5bf9;&#x8c61;&#x6062;&#x590d;&#x5230;&#x539f;&#x5148;&#x4fdd;&#x5b58;&#x7684;&#x72b6;&#x6001;&#x3002;</li>
  
<li>&#x89c2;&#x5bdf;&#x8005; &#x5b9a;&#x4e49;&#x5bf9;&#x8c61;&#x95f4;&#x4e00;&#x5bf9;&#x591a;&#x7684;&#x4f9d;&#x8d56;&#x5173;&#x7cfb;&#xff0c;&#x662f;&#x7684;&#x6bcf;&#x5f53;&#x4e00;&#x4e2a;&#x5bf9;&#x8c61;&#x6539;&#x53d8;&#x72b6;&#x6001;&#xff0c;&#x5219;&#x6240;&#x6709;&#x4f9d;&#x8d56;&#x4e8e;&#x5b83;&#x7684;&#x5bf9;&#x8c61;&#x90fd;&#x4f1a;&#x5f97;&#x5230;&#x901a;&#x77e5;&#x5e76;&#x81ea;&#x52a8;&#x66f4;&#x65b0;&#x3002;&#x4e5f;&#x53eb;&#x53d1;&#x5e03;&#x8ba2;&#x9605;&#x6a21;&#x5f0f;&#x3002;</li>
  
<li>&#x8bbf;&#x95ee;&#x8005; &#x5c01;&#x88c5;&#x4e00;&#x4e9b;&#x4f5c;&#x7528;&#x4e8e;&#x67d0;&#x4e2d;&#x6570;&#x636e;&#x7ed3;&#x6784;&#x4e2d;&#x7684;&#x5404;&#x5143;&#x7d20;&#x7684;&#x64cd;&#x4f5c;&#xff0c;&#x5b83;&#x53ef;&#x4ee5;&#x5728;&#x4e0d;&#x6539;&#x53d8;&#x6570;&#x636e;&#x7ed3;&#x6784;&#x7684;&#x524d;&#x63d0;&#x4e0b;&#x5b9a;&#x4e49;&#x4f5c;&#x7528;&#x4e8e;&#x8fd9;&#x4e9b;&#x5143;&#x7d20;&#x7684;&#x65b0;&#x7684;&#x64cd;&#x4f5c;&#x3002;</li>
  
<li>&#x6a21;&#x7248;&#x65b9;&#x6cd5; &#x5b9a;&#x4e49;&#x4e00;&#x4e2a;&#x64cd;&#x4f5c;&#x4e2d;&#x7684;&#x7b97;&#x6cd5;&#x7684;&#x6846;&#x67b6;&#xff0c;&#x800c;&#x5c06;&#x4e00;&#x4e9b;&#x6b65;&#x9aa4;&#x5ef6;&#x8fdf;&#x5230;&#x5b50;&#x7c7b;&#x4e2d;&#x3002;&#x4f7f;&#x5f97;&#x5b50;&#x7c7b;&#x53ef;&#x4ee5;&#x5728;&#x4e0d;&#x6539;&#x53d8;&#x4e00;&#x4e2a;&#x7b97;&#x6cd5;&#x7684;&#x7ed3;&#x6784;&#x5373;&#x53ef;&#x91cd;&#x5b9a;&#x4e49;&#x8be5;&#x7b97;&#x6cd5;&#x7684;&#x67d0;&#x4e9b;&#x7279;&#x5b9a;&#x5b9e;&#x73b0;&#x3002;java&#x4e2d;&#x7684;&#x7ee7;&#x627f;&#x8986;&#x76d6;&#x3002;</li>
  
<li>&#x4e2d;&#x4ecb;&#x8005; &#x7528;&#x4e00;&#x4e2a;&#x4e2d;&#x4ecb;&#x5bf9;&#x8c61;&#x5c01;&#x88c5;&#x4e00;&#x7cfb;&#x5217;&#x7684;&#x5bf9;&#x8c61;&#x4ea4;&#x4e92;&#xff0c;&#x4e2d;&#x4ecb;&#x8005;&#x4f7f;&#x4e2a;&#x5bf9;&#x8c61;&#x4e0d;&#x9700;&#x8981;&#x663e;&#x793a;&#x5730;&#x76f8;&#x4e92;&#x4f5c;&#x7528;&#xff0c;&#x4ece;&#x800c;&#x4f7f;&#x5176;&#x8026;&#x5408;&#x677e;&#x6563;&#xff0c;&#x800c;&#x4e14;&#x53ef;&#x4ee5;&#x72ec;&#x7acb;&#x5730;&#x6539;&#x53d8;&#x5b83;&#x4eec;&#x4e4b;&#x95f4;&#x7684;&#x4ea4;&#x4e92;&#x3002;</li>
  
<li>&#x89e3;&#x91ca;&#x5668; &#x7ed9;&#x5b9a;&#x4e00;&#x95e8;&#x8bed;&#x8a00;&#xff0c;&#x5b9a;&#x4e49;&#x5b83;&#x7684;&#x6587;&#x6cd5;&#x7684;&#x4e00;&#x79cd;&#x8868;&#x793a;&#xff0c;&#x5e76;&#x5b9a;&#x4e49;&#x4e00;&#x4e2a;&#x89e3;&#x91ca;&#x5668;&#xff0c;&#x8be5;&#x89e3;&#x91ca;&#x5668;&#x4f7f;&#x7528;&#x8be5;&#x8868;&#x793a;&#x6765;&#x89e3;&#x91ca;&#x8bed;&#x8a00;&#x4e2d;&#x7684;&#x53e5;&#x5b50;&#xff0c;&#x662f;&#x4e00;&#x79cd;&#x6309;&#x7167;&#x89c4;&#x5b9a;&#x8bed;&#x6cd5;&#x8fdb;&#x884c;&#x89e3;&#x6790;&#x7684;&#x65b9;&#x6848;&#xff0c;&#x5728;&#x9879;&#x76ee;&#x4e2d;&#x4f7f;&#x7528;&#x8f83;&#x5c11;&#x3002;</li>
  
<li>&#x8fed;&#x4ee3;&#x5668; &#x63d0;&#x4f9b;&#x4e00;&#x79cd;&#x65b9;&#x6cd5;&#x8bbf;&#x95ee;&#x5bb9;&#x5668;&#x5bf9;&#x8c61;&#x4e2d;&#x7684;&#x5404;&#x4e2a;&#x5143;&#x7d20;&#xff0c;&#x800c;&#x53c8;&#x4e0d;&#x9700;&#x8981;&#x66b4;&#x9732;&#x8be5;&#x65b9;&#x6cd5;&#x7684;&#x5185;&#x90e8;&#x7ec6;&#x8282;&#x3002;&#x76ee;&#x524d;&#x5df2;&#x7ecf;&#x662f;&#x4e00;&#x79cd;&#x6ca1;&#x843d;&#x7684;&#x6a21;&#x5f0f;&#xff0c;&#x57fa;&#x672c;&#x4e0a;&#x6ca1;&#x4eba;&#x4f1a;&#x5355;&#x72ec;&#x5199;&#x4e00;&#x4e2a;&#x8fed;&#x4ee3;&#x5668;&#x3002;</li>
</ul></div></div></div>
<div class="section">
<h2><a name="a6"></a>6&#x3001;&#x5e38;&#x7528;&#x7b97;&#x6cd5;</h2>
<div class="section">
<h3><a name="a6.1_"></a>6.1 &#x65f6;&#x95f4;&#xff0f;&#x7a7a;&#x95f4;&#x590d;&#x6742;&#x5ea6;&#x8ba1;&#x7b97;</h3></div>
<div class="section">
<h3><a name="a6.2_"></a>6.2 &#x5e38;&#x7528;&#x6570;&#x636e;&#x7ed3;&#x6784;</h3></div>
<div class="section">
<h3><a name="a6.3_"></a>6.3 &#x6392;&#x5e8f;&#x7b97;&#x6cd5;</h3>
<div class="section">
<h4><a name="a6.3.1_"></a>6.3.1 &#x5e38;&#x7528;&#x6392;&#x5e8f;&#x7b97;&#x6cd5;</h4></div></div>
<div class="section">
<h3><a name="a6.4_"></a>6.4 &#x67e5;&#x627e;&#x7b97;&#x6cd5;</h3>
<div class="section">
<h4><a name="a6.4.1_"></a>6.4.1 &#x5e38;&#x7528;&#x67e5;&#x627e;&#x7b97;&#x6cd5;</h4></div></div></div>
<div class="section">
<h2><a name="a7"></a>7&#x3001;&#x5e38;&#x7528;&#x5f00;&#x53d1;&#x7ec4;&#x4ef6;</h2>
<div class="section">
<h3><a name="a7.1_redis"></a>7.1 redis</h3></div>
<div class="section">
<h3><a name="a7.2_rabbitmq"></a>7.2 rabbitmq</h3></div>
<div class="section">
<h3><a name="a7.3_zookeeper"></a>7.3 zookeeper</h3></div></div>
<div class="section">
<h2><a name="a8"></a>8&#x3001;&#x6570;&#x636e;&#x5e93;</h2>
<div class="section">
<h3><a name="a8.1_mysql"></a>8.1 mysql</h3></div>
<div class="section">
<h3><a name="a8.2_postgresql"></a>8.2 postgresql</h3></div>
<div class="section">
<h3><a name="a8.3_mongodb"></a>8.3 mongodb</h3></div></div>
      </div>
    </div>
    <div class="clear">
      <hr/>
    </div>
    <div id="footer">
      <div class="xright">
              Copyright &#169;                   2018.
          All rights reserved.    
                  </div>
      <div class="clear">
        <hr/>
      </div>
    </div>
  </body>
</html>
