<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!-- Generated by Apache Maven Doxia Site Renderer 1.7.4 at 2017-11-22 -->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en">
  <head>
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
    <title>design-pattern &#x2013; </title>
    <style type="text/css" media="all">
      @import url("./css/maven-base.css");
      @import url("./css/maven-theme.css");
      @import url("./css/site.css");
    </style>
    <link rel="stylesheet" href="./css/print.css" type="text/css" media="print" />
    <meta http-equiv="Content-Language" content="en" />
        
        </head>
  <body class="composite">
    <div id="banner">
                    <div id="bannerLeft">
                design-pattern
                </div>
                    <div class="clear">
        <hr/>
      </div>
    </div>
    <div id="breadcrumbs">
          
                <div class="xleft">
        <span id="publishDate">Last Published: 2017-11-22</span>
                  &nbsp;| <span id="projectVersion">Version: 1.0-SNAPSHOT</span>
                      </div>
            <div class="xright">                    <a href="./" title="design-pattern">design-pattern</a>
            
      </div>
      <div class="clear">
        <hr/>
      </div>
    </div>
    <div id="leftColumn">
      <div id="navcolumn">
           
                                <h5>Parent Project</h5>
                  <ul>
                  <li class="none">
                          <a href="../index.html" title="java-learn">java-learn</a>
            </li>
          </ul>
                       <h5>Project Documentation</h5>
                  <ul>
                                                                                                                                                                                                                                                        <li class="collapsed">
                          <a href="project-info.html" title="Project Information">Project Information</a>
                  </li>
                                                                                      <li class="collapsed">
                          <a href="project-reports.html" title="Project Reports">Project Reports</a>
                  </li>
          </ul>
                             <a href="http://maven.apache.org/" title="Built by Maven" class="poweredBy">
        <img class="poweredBy" alt="Built by Maven" src="./images/logos/maven-feather.png" />
      </a>
                 
            </div>
    </div>
    <div id="bodyColumn">
      <div id="contentBox">
        <p># &#x62bd;&#x8c61;&#x5de5;&#x5382;&#x65b9;&#x6cd5;&#x6a21;&#x5f0f;</p>

<blockquote>
<p>&#x62bd;&#x8c61;&#x5de5;&#x5382;&#x6a21;&#x5f0f;&#xff08;Abstract Factory Pattern&#xff09;&#x662f;&#x56f4;&#x7ed5;&#x4e00;&#x4e2a;&#x8d85;&#x7ea7;&#x5de5;&#x5382;&#x521b;&#x5efa;&#x5176;&#x4ed6;&#x5de5;&#x5382;&#x3002; &#x8be5;&#x8d85;&#x7ea7;&#x5de5;&#x5382;&#x53c8;&#x79f0;&#x4e3a;&#x5176;&#x4ed6;&#x5de5;&#x5382;&#x7684;&#x5de5;&#x5382;&#x3002;&#x8fd9;&#x79cd;&#x7c7b;&#x578b;&#x7684;&#x8bbe;&#x8ba1;&#x6a21;&#x5f0f;&#x5c5e;&#x4e8e;&#x521b;&#x5efa;&#x578b;&#x6a21;&#x5f0f;&#xff0c;&#x5b83;&#x63d0;&#x4f9b;&#x4e86;&#x4e00;&#x79cd;&#x521b;&#x5efa;&#x5bf9;&#x8c61;&#x7684;&#x6700;&#x4f73;&#x65b9;&#x5f0f;&#x3002;</p>
<p>&#x5728;&#x62bd;&#x8c61;&#x5de5;&#x5382;&#x6a21;&#x5f0f;&#x4e2d;&#xff0c;&#x63a5;&#x53e3;&#x662f;&#x8d1f;&#x8d23;&#x521b;&#x5efa;&#x4e00;&#x4e2a;&#x76f8;&#x5173;&#x5bf9;&#x8c61;&#x7684;&#x5de5;&#x5382;&#xff0c;&#x4e0d;&#x9700;&#x8981;&#x663e;&#x5f0f;&#x6307;&#x5b9a;&#x5b83;&#x4eec;&#x7684;&#x7c7b;&#x3002; &#x6bcf;&#x4e2a;&#x751f;&#x6210;&#x7684;&#x5de5;&#x5382;&#x90fd;&#x80fd;&#x6309;&#x7167;&#x5de5;&#x5382;&#x6a21;&#x5f0f;&#x63d0;&#x4f9b;&#x5bf9;&#x8c61;&#x3002;</p>
</blockquote>
<div class="section">
<h2><a name="a1_"></a>1 &#x4ecb;&#x7ecd;</h2>
<div class="section">
<h3><a name="a1.1_"></a>1.1 &#x6a21;&#x5f0f;&#x52a8;&#x673a;</h3>

<blockquote>
<p>&#x63d0;&#x4f9b;&#x4e00;&#x4e2a;&#x521b;&#x5efa;&#x4e00;&#x7cfb;&#x5217;&#x76f8;&#x5173;&#x6216;&#x76f8;&#x4e92;&#x4f9d;&#x8d56;&#x5bf9;&#x8c61;&#x7684;&#x63a5;&#x53e3;&#xff0c;&#x800c;&#x65e0;&#x9700;&#x6307;&#x5b9a;&#x5b83;&#x4eec;&#x5177;&#x4f53;&#x7684;&#x7c7b;&#x3002;</p>
</blockquote></div>
<div class="section">
<h3><a name="a1.2_"></a>1.2 &#x6a21;&#x5f0f;&#x5b9a;&#x4e49;</h3>

<blockquote>
<p>&#x62bd;&#x8c61;&#x5de5;&#x5382;&#x6a21;&#x5f0f;(Abstract Factory Pattern)&#xff1a;&#x63d0;&#x4f9b;&#x4e00;&#x4e2a;&#x521b;&#x5efa;&#x4e00;&#x7cfb;&#x5217;&#x76f8;&#x5173;&#x6216;&#x76f8;&#x4e92;&#x4f9d;&#x8d56;&#x5bf9;&#x8c61;&#x7684;&#x63a5;&#x53e3;&#xff0c; &#x800c;&#x65e0;&#x987b;&#x6307;&#x5b9a;&#x5b83;&#x4eec;&#x5177;&#x4f53;&#x7684;&#x7c7b;&#x3002;&#x62bd;&#x8c61;&#x5de5;&#x5382;&#x6a21;&#x5f0f;&#x53c8;&#x79f0;&#x4e3a;Kit&#x6a21;&#x5f0f;&#xff0c;&#x5c5e;&#x4e8e;&#x5bf9;&#x8c61;&#x521b;&#x5efa;&#x578b;&#x6a21;&#x5f0f;&#x3002;</p>
</blockquote></div>
<div class="section">
<h3><a name="a1.3_"></a>1.3 &#x9002;&#x7528;&#x73af;&#x5883;</h3>

<blockquote>
  
<ul>
    
<li>&#x4e00;&#x4e2a;&#x7cfb;&#x7edf;&#x4e0d;&#x5e94;&#x5f53;&#x4f9d;&#x8d56;&#x4e8e;&#x4ea7;&#x54c1;&#x7c7b;&#x5b9e;&#x4f8b;&#x5982;&#x4f55;&#x88ab;&#x521b;&#x5efa;&#x3001;&#x7ec4;&#x5408;&#x548c;&#x8868;&#x8fbe;&#x7684;&#x7ec6;&#x8282;&#xff0c;&#x8fd9;&#x5bf9;&#x4e8e;&#x6240;&#x6709;&#x7c7b;&#x578b;&#x7684;&#x5de5;&#x5382;&#x6a21;&#x5f0f;&#x90fd;&#x662f;&#x91cd;&#x8981;&#x7684;&#x3002;</li>
    
<li>&#x7cfb;&#x7edf;&#x4e2d;&#x6709;&#x591a;&#x4e8e;&#x4e00;&#x4e2a;&#x7684;&#x4ea7;&#x54c1;&#x65cf;&#xff0c;&#x800c;&#x6bcf;&#x6b21;&#x53ea;&#x4f7f;&#x7528;&#x5176;&#x4e2d;&#x67d0;&#x4e00;&#x4ea7;&#x54c1;&#x65cf;&#x3002;</li>
    
<li>&#x5c5e;&#x4e8e;&#x540c;&#x4e00;&#x4e2a;&#x4ea7;&#x54c1;&#x65cf;&#x7684;&#x4ea7;&#x54c1;&#x5c06;&#x5728;&#x4e00;&#x8d77;&#x4f7f;&#x7528;&#xff0c;&#x8fd9;&#x4e00;&#x7ea6;&#x675f;&#x5fc5;&#x987b;&#x5728;&#x7cfb;&#x7edf;&#x7684;&#x8bbe;&#x8ba1;&#x4e2d;&#x4f53;&#x73b0;&#x51fa;&#x6765;&#x3002;</li>
    
<li>&#x7cfb;&#x7edf;&#x63d0;&#x4f9b;&#x4e00;&#x4e2a;&#x4ea7;&#x54c1;&#x7c7b;&#x7684;&#x5e93;&#xff0c;&#x6240;&#x6709;&#x7684;&#x4ea7;&#x54c1;&#x4ee5;&#x540c;&#x6837;&#x7684;&#x63a5;&#x53e3;&#x51fa;&#x73b0;&#xff0c;&#x4ece;&#x800c;&#x4f7f;&#x5ba2;&#x6237;&#x7aef;&#x4e0d;&#x4f9d;&#x8d56;&#x4e8e;&#x5177;&#x4f53;&#x5b9e;&#x73b0;&#x3002;</li>
  </ul>
</blockquote></div>
<div class="section">
<h3><a name="a1.4_"></a>1.4 &#x6a21;&#x5f0f;&#x5e94;&#x7528;</h3>

<blockquote>
  
<ul>
    
<li>&#x5728;&#x5f88;&#x591a;&#x8f6f;&#x4ef6;&#x7cfb;&#x7edf;&#x4e2d;&#x9700;&#x8981;&#x66f4;&#x6362;&#x754c;&#x9762;&#x4e3b;&#x9898;&#xff0c;&#x8981;&#x6c42;&#x754c;&#x9762;&#x4e2d;&#x7684;&#x6309;&#x94ae;&#x3001;&#x6587;&#x672c;&#x6846;&#x3001; &#x80cc;&#x666f;&#x8272;&#x7b49;&#x4e00;&#x8d77;&#x53d1;&#x751f;&#x6539;&#x53d8;&#x65f6;&#xff0c;&#x53ef;&#x4ee5;&#x4f7f;&#x7528;&#x62bd;&#x8c61;&#x5de5;&#x5382;&#x6a21;&#x5f0f;&#x8fdb;&#x884c;&#x8bbe;&#x8ba1;&#x3002;</li>
  </ul>
</blockquote></div>
<div class="section">
<h3><a name="a1.5_"></a>1.5 &#x4f18;&#x70b9;</h3>

<blockquote>
  
<ul>
    
<li>&#x62bd;&#x8c61;&#x5de5;&#x5382;&#x6a21;&#x5f0f;&#x9694;&#x79bb;&#x4e86;&#x5177;&#x4f53;&#x7c7b;&#x7684;&#x751f;&#x6210;&#xff0c;&#x4f7f;&#x5f97;&#x5ba2;&#x6237;&#x5e76;&#x4e0d;&#x9700;&#x8981;&#x77e5;&#x9053;&#x4ec0;&#x4e48;&#x88ab;&#x521b;&#x5efa;&#x3002; &#x7531;&#x4e8e;&#x8fd9;&#x79cd;&#x9694;&#x79bb;&#xff0c;&#x66f4;&#x6362;&#x4e00;&#x4e2a;&#x5177;&#x4f53;&#x5de5;&#x5382;&#x5c31;&#x53d8;&#x5f97;&#x76f8;&#x5bf9;&#x5bb9;&#x6613;&#x3002;&#x6240;&#x6709;&#x7684;&#x5177;&#x4f53;&#x5de5;&#x5382;&#x90fd;&#x5b9e;&#x73b0;&#x4e86;&#x62bd;&#x8c61;&#x5de5;&#x5382;&#x4e2d;&#x5b9a;&#x4e49;&#x7684;&#x90a3;&#x4e9b;&#x516c;&#x5171;&#x63a5;&#x53e3;&#xff0c; &#x56e0;&#x6b64;&#x53ea;&#x9700;&#x6539;&#x53d8;&#x5177;&#x4f53;&#x5de5;&#x5382;&#x7684;&#x5b9e;&#x4f8b;&#xff0c;&#x5c31;&#x53ef;&#x4ee5;&#x5728;&#x67d0;&#x79cd;&#x7a0b;&#x5ea6;&#x4e0a;&#x6539;&#x53d8;&#x6574;&#x4e2a;&#x8f6f;&#x4ef6;&#x7cfb;&#x7edf;&#x7684;&#x884c;&#x4e3a;&#x3002; &#x53e6;&#x5916;&#xff0c;&#x5e94;&#x7528;&#x62bd;&#x8c61;&#x5de5;&#x5382;&#x6a21;&#x5f0f;&#x53ef;&#x4ee5;&#x5b9e;&#x73b0;&#x9ad8;&#x5185;&#x805a;&#x4f4e;&#x8026;&#x5408;&#x7684;&#x8bbe;&#x8ba1;&#x76ee;&#x7684;&#xff0c;&#x56e0;&#x6b64;&#x62bd;&#x8c61;&#x5de5;&#x5382;&#x6a21;&#x5f0f;&#x5f97;&#x5230;&#x4e86;&#x5e7f;&#x6cdb;&#x7684;&#x5e94;&#x7528;&#x3002;</li>
    
<li>&#x5f53;&#x4e00;&#x4e2a;&#x4ea7;&#x54c1;&#x65cf;&#x4e2d;&#x7684;&#x591a;&#x4e2a;&#x5bf9;&#x8c61;&#x88ab;&#x8bbe;&#x8ba1;&#x6210;&#x4e00;&#x8d77;&#x5de5;&#x4f5c;&#x65f6;&#xff0c;&#x5b83;&#x80fd;&#x591f;&#x4fdd;&#x8bc1;&#x5ba2;&#x6237;&#x7aef;&#x59cb;&#x7ec8;&#x53ea;&#x4f7f;&#x7528;&#x540c;&#x4e00;&#x4e2a;&#x4ea7;&#x54c1;&#x65cf;&#x4e2d;&#x7684;&#x5bf9;&#x8c61;&#x3002; &#x8fd9;&#x5bf9;&#x4e00;&#x4e9b;&#x9700;&#x8981;&#x6839;&#x636e;&#x5f53;&#x524d;&#x73af;&#x5883;&#x6765;&#x51b3;&#x5b9a;&#x5176;&#x884c;&#x4e3a;&#x7684;&#x8f6f;&#x4ef6;&#x7cfb;&#x7edf;&#x6765;&#x8bf4;&#xff0c;&#x662f;&#x4e00;&#x79cd;&#x975e;&#x5e38;&#x5b9e;&#x7528;&#x7684;&#x8bbe;&#x8ba1;&#x6a21;&#x5f0f;&#x3002;</li>
    
<li>&#x589e;&#x52a0;&#x65b0;&#x7684;&#x5177;&#x4f53;&#x5de5;&#x5382;&#x548c;&#x4ea7;&#x54c1;&#x65cf;&#x5f88;&#x65b9;&#x4fbf;&#xff0c;&#x65e0;&#x987b;&#x4fee;&#x6539;&#x5df2;&#x6709;&#x7cfb;&#x7edf;&#xff0c;&#x7b26;&#x5408;&#x201c;&#x5f00;&#x95ed;&#x539f;&#x5219;&#x201d;&#x3002;</li>
  </ul>
</blockquote></div>
<div class="section">
<h3><a name="a1.6_"></a>1.6 &#x7f3a;&#x70b9;</h3>

<blockquote>
  
<ul>
    
<li>&#x5728;&#x6dfb;&#x52a0;&#x65b0;&#x7684;&#x4ea7;&#x54c1;&#x5bf9;&#x8c61;&#x65f6;&#xff0c;&#x96be;&#x4ee5;&#x6269;&#x5c55;&#x62bd;&#x8c61;&#x5de5;&#x5382;&#x6765;&#x751f;&#x4ea7;&#x65b0;&#x79cd;&#x7c7b;&#x7684;&#x4ea7;&#x54c1;&#xff0c; &#x8fd9;&#x662f;&#x56e0;&#x4e3a;&#x5728;&#x62bd;&#x8c61;&#x5de5;&#x5382;&#x89d2;&#x8272;&#x4e2d;&#x89c4;&#x5b9a;&#x4e86;&#x6240;&#x6709;&#x53ef;&#x80fd;&#x88ab;&#x521b;&#x5efa;&#x7684;&#x4ea7;&#x54c1;&#x96c6;&#x5408;&#xff0c; &#x8981;&#x652f;&#x6301;&#x65b0;&#x79cd;&#x7c7b;&#x7684;&#x4ea7;&#x54c1;&#x5c31;&#x610f;&#x5473;&#x7740;&#x8981;&#x5bf9;&#x8be5;&#x63a5;&#x53e3;&#x8fdb;&#x884c;&#x6269;&#x5c55;&#xff0c; &#x800c;&#x8fd9;&#x5c06;&#x6d89;&#x53ca;&#x5230;&#x5bf9;&#x62bd;&#x8c61;&#x5de5;&#x5382;&#x89d2;&#x8272;&#x53ca;&#x5176;&#x6240;&#x6709;&#x5b50;&#x7c7b;&#x7684;&#x4fee;&#x6539;&#xff0c;&#x663e;&#x7136;&#x4f1a;&#x5e26;&#x6765;&#x8f83;&#x5927;&#x7684;&#x4e0d;&#x4fbf;&#x3002;</li>
    
<li>&#x5f00;&#x95ed;&#x539f;&#x5219;&#x7684;&#x503e;&#x659c;&#x6027;&#xff08;&#x589e;&#x52a0;&#x65b0;&#x7684;&#x5de5;&#x5382;&#x548c;&#x4ea7;&#x54c1;&#x65cf;&#x5bb9;&#x6613;&#xff0c;&#x589e;&#x52a0;&#x65b0;&#x7684;&#x4ea7;&#x54c1;&#x7b49;&#x7ea7;&#x7ed3;&#x6784;&#x9ebb;&#x70e6;&#xff09;&#x3002;</li>
  </ul>
</blockquote></div>
<div class="section">
<h3><a name="a1.7_"></a>1.7 &#x6a21;&#x5f0f;&#x7ed3;&#x6784;</h3>

<blockquote>
<p>&#x5de5;&#x5382;&#x65b9;&#x6cd5;&#x6a21;&#x5f0f;&#x5305;&#x542b;&#x5982;&#x4e0b;&#x89d2;&#x8272;&#xff1a;</p>
  
<ul>
    
<li>AbstractProduct&#xff1a;&#x62bd;&#x8c61;&#x4ea7;&#x54c1;</li>
    
<li>ConcreteProduct&#xff1a;&#x5177;&#x4f53;&#x4ea7;&#x54c1;</li>
    
<li>AbstractFactory&#xff1a;&#x62bd;&#x8c61;&#x5de5;&#x5382;</li>
    
<li>ConcreteFactory&#xff1a;&#x5177;&#x4f53;&#x5de5;&#x5382;</li>
  </ul>
<p>&#x7c7b;&#x56fe;&#xff1a;</p>
</blockquote>
<p>![](image/abstract-factory.png)</p></div>
<div class="section">
<h3><a name="a1.8_"></a>1.8 &#x65f6;&#x5e8f;&#x56fe;</h3></div></div>
<div class="section">
<h2><a name="a2_"></a>2 &#x4ee3;&#x7801;&#x5206;&#x6790;</h2>

<blockquote>
<p>&#x62bd;&#x8c61;&#x5de5;&#x5382;&#x7c7b; AbstractFactory&#xff1a;</p>
</blockquote>

<div class="source">
<div class="source">
<pre>public abstract class AbstractFactory {

    public abstract AbstractProductA createProductA();
    public abstract ConcreteProductB createProductB();
}
</pre></div></div>

<blockquote>
<p>&#x5177;&#x4f53;&#x5de5;&#x5382;&#x7c7b; AbstractProduct&#xff1a;</p>
</blockquote>

<div class="source">
<div class="source">
<pre>public class ConcreteProcductFactoryApple extends AbstractFactory{


    @Override
    public AbstractProductA createProductA() {
        log.info(&quot;-*--*--*--*- apple &#x751f;&#x4ea7; ProductA -*--*--*--*--&quot;);
        return new ConcreteProductA(AbstractProductA.ColorType.RED,AbstractProductA.BrandName.APPLE);
    }

    @Override
    public ConcreteProductB createProductB() {
        log.info(&quot;-*--*--*--*- apple &#x751f;&#x4ea7; ProductB -*--*--*--*--&quot;);
        return new ConcreteProductB(AbstractProductB.ProductName.TV);
    }
}
</pre></div></div>

<blockquote>
<p>&#x5177;&#x4f53;&#x4ea7;&#x54c1;&#x7c7b; ConcreteProductA&#xff1a;</p>
</blockquote>

<div class="source">
<div class="source">
<pre>@Slf4j
public class ConcreteProductA extends AbstractProductA{

    ConcreteProductA(ColorType colorType,BrandName brandName) {

        super(colorType,brandName);
    }
}
</pre></div></div>

<blockquote>
<p>&#x5177;&#x4f53;&#x4ea7;&#x54c1;&#x7c7b; ConcreteProductB&#xff1a;</p>
</blockquote>

<div class="source">
<div class="source">
<pre>public class ConcreteProductB extends AbstractProductB{

   ConcreteProductB(ProductName productName) {
       super(productName);
   }
}
</pre></div></div>

<blockquote>
<p>&#x5ba2;&#x6237;&#x7aef; Client&#xff1a;</p>
</blockquote>

<div class="source">
<div class="source">
<pre>public class Client {

    public static void main(String[] args) {

        AbstractProductA appleProductA = new ConcreteProcductFactoryApple().createProductA();
        AbstractProductB appleProductB = new ConcreteProcductFactoryApple().createProductB();

        AbstractProductA dellProductA = new ConcreteProcductFactoryDell().createProductA();
        AbstractProductB dellProductB = new ConcreteProcductFactoryDell().createProductB();

    }
}
</pre></div></div></div>
<div class="section">
<h2><a name="a3_"></a>3 &#x6a21;&#x5f0f;&#x5206;&#x6790;</h2></div>
<div class="section">
<h2><a name="a4_"></a>4 &#x5b9e;&#x4f8b;</h2></div>
<div class="section">
<h2><a name="a"></a>&#x6a21;&#x5f0f;&#x6269;&#x5c55;</h2>
<div class="section">
<h3><a name="a"></a>&#x201c;&#x5f00;&#x95ed;&#x539f;&#x5219;&#x201d;&#x7684;&#x503e;&#x659c;&#x6027;</h3>

<blockquote>
  
<ul>
    
<li>
<p>&#x201c;&#x5f00;&#x95ed;&#x539f;&#x5219;&#x201d;&#x8981;&#x6c42;&#x7cfb;&#x7edf;&#x5bf9;&#x6269;&#x5c55;&#x5f00;&#x653e;&#xff0c;&#x5bf9;&#x4fee;&#x6539;&#x5c01;&#x95ed;&#xff0c;&#x901a;&#x8fc7;&#x6269;&#x5c55;&#x8fbe;&#x5230;&#x589e;&#x5f3a;&#x5176;&#x529f;&#x80fd;&#x7684;&#x76ee;&#x7684;&#x3002; &#x5bf9;&#x4e8e;&#x6d89;&#x53ca;&#x5230;&#x591a;&#x4e2a;&#x4ea7;&#x54c1;&#x65cf;&#x4e0e;&#x591a;&#x4e2a;&#x4ea7;&#x54c1;&#x7b49;&#x7ea7;&#x7ed3;&#x6784;&#x7684;&#x7cfb;&#x7edf;&#xff0c;&#x5176;&#x529f;&#x80fd;&#x589e;&#x5f3a;&#x5305;&#x62ec;&#x4e24;&#x65b9;&#x9762;&#xff1a;</p>
    
<blockquote>
      
<blockquote>
        
<ul>
          
<li>1&#x3001; &#x589e;&#x52a0;&#x4ea7;&#x54c1;&#x65cf;&#xff1a;&#x5bf9;&#x4e8e;&#x589e;&#x52a0;&#x65b0;&#x7684;&#x4ea7;&#x54c1;&#x65cf;&#xff0c;&#x5de5;&#x5382;&#x65b9;&#x6cd5;&#x6a21;&#x5f0f;&#x5f88;&#x597d;&#x7684;&#x652f;&#x6301;&#x4e86;&#x201c;&#x5f00;&#x95ed;&#x539f;&#x5219;&#x201d;&#xff0c;&#x5bf9;&#x4e8e;&#x65b0;&#x589e;&#x52a0;&#x7684;&#x4ea7;&#x54c1;&#x65cf;&#xff0c; &#x53ea;&#x9700;&#x8981;&#x5bf9;&#x5e94;&#x589e;&#x52a0;&#x4e00;&#x4e2a;&#x65b0;&#x7684;&#x5177;&#x4f53;&#x5de5;&#x5382;&#x5373;&#x53ef;&#xff0c;&#x5bf9;&#x5df2;&#x6709;&#x4ee3;&#x7801;&#x65e0;&#x987b;&#x505a;&#x4efb;&#x4f55;&#x4fee;&#x6539;&#x3002;</li>
          
<li>2&#x3001; &#x589e;&#x52a0;&#x65b0;&#x7684;&#x4ea7;&#x54c1;&#x7b49;&#x7ea7;&#x7ed3;&#x6784;&#xff1a;&#x5bf9;&#x4e8e;&#x589e;&#x52a0;&#x65b0;&#x7684;&#x4ea7;&#x54c1;&#x7b49;&#x7ea7;&#x7ed3;&#x6784;&#xff0c;&#x9700;&#x8981;&#x4fee;&#x6539;&#x6240;&#x6709;&#x7684;&#x5de5;&#x5382;&#x89d2;&#x8272;&#xff0c;&#x5305;&#x62ec;&#x62bd;&#x8c61;&#x5de5;&#x5382;&#x7c7b;&#xff0c; &#x5728;&#x6240;&#x6709;&#x7684;&#x5de5;&#x5382;&#x7c7b;&#x4e2d;&#x90fd;&#x9700;&#x8981;&#x589e;&#x52a0;&#x751f;&#x4ea7;&#x65b0;&#x4ea7;&#x54c1;&#x7684;&#x65b9;&#x6cd5;&#xff0c;&#x4e0d;&#x80fd;&#x5f88;&#x597d;&#x5730;&#x652f;&#x6301;&#x201c;&#x5f00;&#x95ed;&#x539f;&#x5219;&#x201d;&#x3002;</li>
        </ul>
      </blockquote>
    </blockquote></li>
    
<li>&#x62bd;&#x8c61;&#x5de5;&#x5382;&#x6a21;&#x5f0f;&#x7684;&#x8fd9;&#x79cd;&#x6027;&#x8d28;&#x79f0;&#x4e3a;&#x201c;&#x5f00;&#x95ed;&#x539f;&#x5219;&#x201d;&#x7684;&#x503e;&#x659c;&#x6027;&#xff0c;&#x62bd;&#x8c61;&#x5de5;&#x5382;&#x6a21;&#x5f0f;&#x4ee5;&#x4e00;&#x79cd;&#x503e;&#x659c;&#x7684;&#x65b9;&#x5f0f;&#x652f;&#x6301;&#x589e;&#x52a0;&#x65b0;&#x7684;&#x4ea7;&#x54c1;&#xff0c; &#x5b83;&#x4e3a;&#x65b0;&#x4ea7;&#x54c1;&#x65cf;&#x7684;&#x589e;&#x52a0;&#x63d0;&#x4f9b;&#x65b9;&#x4fbf;&#xff0c;&#x4f46;&#x4e0d;&#x80fd;&#x4e3a;&#x65b0;&#x7684;&#x4ea7;&#x54c1;&#x7b49;&#x7ea7;&#x7ed3;&#x6784;&#x7684;&#x589e;&#x52a0;&#x63d0;&#x4f9b;&#x8fd9;&#x6837;&#x7684;&#x65b9;&#x4fbf;&#x3002;</li>
  </ul>
</blockquote></div>
<div class="section">
<h3><a name="a"></a>&#x5de5;&#x5382;&#x6a21;&#x5f0f;&#x7684;&#x9000;&#x5316;</h3>

<blockquote>
  
<ul>
    
<li>&#x5f53;&#x62bd;&#x8c61;&#x5de5;&#x5382;&#x6a21;&#x5f0f;&#x4e2d;&#x6bcf;&#x4e00;&#x4e2a;&#x5177;&#x4f53;&#x5de5;&#x5382;&#x7c7b;&#x53ea;&#x521b;&#x5efa;&#x4e00;&#x4e2a;&#x4ea7;&#x54c1;&#x5bf9;&#x8c61;&#xff0c;&#x4e5f;&#x5c31;&#x662f;&#x53ea;&#x5b58;&#x5728;&#x4e00;&#x4e2a;&#x4ea7;&#x54c1;&#x7b49;&#x7ea7;&#x7ed3;&#x6784;&#x65f6;&#xff0c; &#x62bd;&#x8c61;&#x5de5;&#x5382;&#x6a21;&#x5f0f;&#x9000;&#x5316;&#x6210;&#x5de5;&#x5382;&#x65b9;&#x6cd5;&#x6a21;&#x5f0f;&#xff1b;&#x5f53;&#x5de5;&#x5382;&#x65b9;&#x6cd5;&#x6a21;&#x5f0f;&#x4e2d;&#x62bd;&#x8c61;&#x5de5;&#x5382;&#x4e0e;&#x5177;&#x4f53;&#x5de5;&#x5382;&#x5408;&#x5e76;&#xff0c; &#x63d0;&#x4f9b;&#x4e00;&#x4e2a;&#x7edf;&#x4e00;&#x7684;&#x5de5;&#x5382;&#x6765;&#x521b;&#x5efa;&#x4ea7;&#x54c1;&#x5bf9;&#x8c61;&#xff0c;&#x5e76;&#x5c06;&#x521b;&#x5efa;&#x5bf9;&#x8c61;&#x7684;&#x5de5;&#x5382;&#x65b9;&#x6cd5;&#x8bbe;&#x8ba1;&#x4e3a;&#x9759;&#x6001;&#x65b9;&#x6cd5;&#x65f6;&#xff0c; &#x5de5;&#x5382;&#x65b9;&#x6cd5;&#x6a21;&#x5f0f;&#x9000;&#x5316;&#x6210;&#x7b80;&#x5355;&#x5de5;&#x5382;&#x6a21;&#x5f0f;&#x3002;</li>
  </ul>
</blockquote></div></div>
<div class="section">
<h2><a name="a"></a>&#x603b;&#x7ed3;</h2>

<blockquote>
  
<ul>
    
<li>&#x62bd;&#x8c61;&#x5de5;&#x5382;&#x6a21;&#x5f0f;&#x63d0;&#x4f9b;&#x4e00;&#x4e2a;&#x521b;&#x5efa;&#x4e00;&#x7cfb;&#x5217;&#x76f8;&#x5173;&#x6216;&#x76f8;&#x4e92;&#x4f9d;&#x8d56;&#x5bf9;&#x8c61;&#x7684;&#x63a5;&#x53e3;&#xff0c;&#x800c;&#x65e0;&#x987b;&#x6307;&#x5b9a;&#x5b83;&#x4eec;&#x5177;&#x4f53;&#x7684;&#x7c7b;&#x3002; &#x62bd;&#x8c61;&#x5de5;&#x5382;&#x6a21;&#x5f0f;&#x53c8;&#x79f0;&#x4e3a;Kit&#x6a21;&#x5f0f;&#xff0c;&#x5c5e;&#x4e8e;&#x5bf9;&#x8c61;&#x521b;&#x5efa;&#x578b;&#x6a21;&#x5f0f;&#x3002;</li>
    
<li>&#x62bd;&#x8c61;&#x5de5;&#x5382;&#x6a21;&#x5f0f;&#x5305;&#x542b;&#x56db;&#x4e2a;&#x89d2;&#x8272;&#xff1a;&#x62bd;&#x8c61;&#x5de5;&#x5382;&#x7528;&#x4e8e;&#x58f0;&#x660e;&#x751f;&#x6210;&#x62bd;&#x8c61;&#x4ea7;&#x54c1;&#x7684;&#x65b9;&#x6cd5;&#xff1b; &#x5177;&#x4f53;&#x5de5;&#x5382;&#x5b9e;&#x73b0;&#x4e86;&#x62bd;&#x8c61;&#x5de5;&#x5382;&#x58f0;&#x660e;&#x7684;&#x751f;&#x6210;&#x62bd;&#x8c61;&#x4ea7;&#x54c1;&#x7684;&#x65b9;&#x6cd5;&#xff0c;&#x751f;&#x6210;&#x4e00;&#x7ec4;&#x5177;&#x4f53;&#x4ea7;&#x54c1;&#xff0c;&#x8fd9;&#x4e9b;&#x4ea7;&#x54c1;&#x6784;&#x6210;&#x4e86;&#x4e00;&#x4e2a;&#x4ea7;&#x54c1;&#x65cf;&#xff0c; &#x6bcf;&#x4e00;&#x4e2a;&#x4ea7;&#x54c1;&#x90fd;&#x4f4d;&#x4e8e;&#x67d0;&#x4e2a;&#x4ea7;&#x54c1;&#x7b49;&#x7ea7;&#x7ed3;&#x6784;&#x4e2d;&#xff1b;&#x62bd;&#x8c61;&#x4ea7;&#x54c1;&#x4e3a;&#x6bcf;&#x79cd;&#x4ea7;&#x54c1;&#x58f0;&#x660e;&#x63a5;&#x53e3;&#xff0c; &#x5728;&#x62bd;&#x8c61;&#x4ea7;&#x54c1;&#x4e2d;&#x5b9a;&#x4e49;&#x4e86;&#x4ea7;&#x54c1;&#x7684;&#x62bd;&#x8c61;&#x4e1a;&#x52a1;&#x65b9;&#x6cd5;&#xff1b;&#x5177;&#x4f53;&#x4ea7;&#x54c1;&#x5b9a;&#x4e49;&#x5177;&#x4f53;&#x5de5;&#x5382;&#x751f;&#x4ea7;&#x7684;&#x5177;&#x4f53;&#x4ea7;&#x54c1;&#x5bf9;&#x8c61;&#xff0c; &#x5b9e;&#x73b0;&#x62bd;&#x8c61;&#x4ea7;&#x54c1;&#x63a5;&#x53e3;&#x4e2d;&#x5b9a;&#x4e49;&#x7684;&#x4e1a;&#x52a1;&#x65b9;&#x6cd5;&#x3002;</li>
    
<li>&#x62bd;&#x8c61;&#x5de5;&#x5382;&#x6a21;&#x5f0f;&#x662f;&#x6240;&#x6709;&#x5f62;&#x5f0f;&#x7684;&#x5de5;&#x5382;&#x6a21;&#x5f0f;&#x4e2d;&#x6700;&#x4e3a;&#x62bd;&#x8c61;&#x548c;&#x6700;&#x5177;&#x4e00;&#x822c;&#x6027;&#x7684;&#x4e00;&#x79cd;&#x5f62;&#x6001;&#x3002; &#x62bd;&#x8c61;&#x5de5;&#x5382;&#x6a21;&#x5f0f;&#x4e0e;&#x5de5;&#x5382;&#x65b9;&#x6cd5;&#x6a21;&#x5f0f;&#x6700;&#x5927;&#x7684;&#x533a;&#x522b;&#x5728;&#x4e8e;&#xff0c;&#x5de5;&#x5382;&#x65b9;&#x6cd5;&#x6a21;&#x5f0f;&#x9488;&#x5bf9;&#x7684;&#x662f;&#x4e00;&#x4e2a;&#x4ea7;&#x54c1;&#x7b49;&#x7ea7;&#x7ed3;&#x6784;&#xff0c; &#x800c;&#x62bd;&#x8c61;&#x5de5;&#x5382;&#x6a21;&#x5f0f;&#x5219;&#x9700;&#x8981;&#x9762;&#x5bf9;&#x591a;&#x4e2a;&#x4ea7;&#x54c1;&#x7b49;&#x7ea7;&#x7ed3;&#x6784;&#x3002;</li>
    
<li>&#x62bd;&#x8c61;&#x5de5;&#x5382;&#x6a21;&#x5f0f;&#x7684;&#x4e3b;&#x8981;&#x4f18;&#x70b9;&#x662f;&#x9694;&#x79bb;&#x4e86;&#x5177;&#x4f53;&#x7c7b;&#x7684;&#x751f;&#x6210;&#xff0c;&#x4f7f;&#x5f97;&#x5ba2;&#x6237;&#x5e76;&#x4e0d;&#x9700;&#x8981;&#x77e5;&#x9053;&#x4ec0;&#x4e48;&#x88ab;&#x521b;&#x5efa;&#xff0c; &#x800c;&#x4e14;&#x6bcf;&#x6b21;&#x53ef;&#x4ee5;&#x901a;&#x8fc7;&#x5177;&#x4f53;&#x5de5;&#x5382;&#x7c7b;&#x521b;&#x5efa;&#x4e00;&#x4e2a;&#x4ea7;&#x54c1;&#x65cf;&#x4e2d;&#x7684;&#x591a;&#x4e2a;&#x5bf9;&#x8c61;&#xff0c;&#x589e;&#x52a0;&#x6216;&#x8005;&#x66ff;&#x6362;&#x4ea7;&#x54c1;&#x65cf;&#x6bd4;&#x8f83;&#x65b9;&#x4fbf;&#xff0c; &#x589e;&#x52a0;&#x65b0;&#x7684;&#x5177;&#x4f53;&#x5de5;&#x5382;&#x548c;&#x4ea7;&#x54c1;&#x65cf;&#x5f88;&#x65b9;&#x4fbf;&#xff1b;&#x4e3b;&#x8981;&#x7f3a;&#x70b9;&#x5728;&#x4e8e;&#x589e;&#x52a0;&#x65b0;&#x7684;&#x4ea7;&#x54c1;&#x7b49;&#x7ea7;&#x7ed3;&#x6784;&#x5f88;&#x590d;&#x6742;&#xff0c; &#x9700;&#x8981;&#x4fee;&#x6539;&#x62bd;&#x8c61;&#x5de5;&#x5382;&#x548c;&#x6240;&#x6709;&#x7684;&#x5177;&#x4f53;&#x5de5;&#x5382;&#x7c7b;&#xff0c;&#x5bf9;&#x201c;&#x5f00;&#x95ed;&#x539f;&#x5219;&#x201d;&#x7684;&#x652f;&#x6301;&#x5448;&#x73b0;&#x503e;&#x659c;&#x6027;&#x3002;</li>
    
<li>&#x62bd;&#x8c61;&#x5de5;&#x5382;&#x6a21;&#x5f0f;&#x9002;&#x7528;&#x60c5;&#x51b5;&#x5305;&#x62ec;&#xff1a;&#x4e00;&#x4e2a;&#x7cfb;&#x7edf;&#x4e0d;&#x5e94;&#x5f53;&#x4f9d;&#x8d56;&#x4e8e;&#x4ea7;&#x54c1;&#x7c7b;&#x5b9e;&#x4f8b;&#x5982;&#x4f55;&#x88ab;&#x521b;&#x5efa;&#x3001;&#x7ec4;&#x5408;&#x548c;&#x8868;&#x8fbe;&#x7684;&#x7ec6;&#x8282;&#xff1b; &#x7cfb;&#x7edf;&#x4e2d;&#x6709;&#x591a;&#x4e8e;&#x4e00;&#x4e2a;&#x7684;&#x4ea7;&#x54c1;&#x65cf;&#xff0c;&#x800c;&#x6bcf;&#x6b21;&#x53ea;&#x4f7f;&#x7528;&#x5176;&#x4e2d;&#x67d0;&#x4e00;&#x4ea7;&#x54c1;&#x65cf;&#xff1b;&#x5c5e;&#x4e8e;&#x540c;&#x4e00;&#x4e2a;&#x4ea7;&#x54c1;&#x65cf;&#x7684;&#x4ea7;&#x54c1;&#x5c06;&#x5728;&#x4e00;&#x8d77;&#x4f7f;&#x7528;&#xff1b; &#x7cfb;&#x7edf;&#x63d0;&#x4f9b;&#x4e00;&#x4e2a;&#x4ea7;&#x54c1;&#x7c7b;&#x7684;&#x5e93;&#xff0c;&#x6240;&#x6709;&#x7684;&#x4ea7;&#x54c1;&#x4ee5;&#x540c;&#x6837;&#x7684;&#x63a5;&#x53e3;&#x51fa;&#x73b0;&#xff0c;&#x4ece;&#x800c;&#x4f7f;&#x5ba2;&#x6237;&#x7aef;&#x4e0d;&#x4f9d;&#x8d56;&#x4e8e;&#x5177;&#x4f53;&#x5b9e;&#x73b0;&#x3002;</li>
  </ul>
</blockquote></div>
      </div>
    </div>
    <div class="clear">
      <hr/>
    </div>
    <div id="footer">
      <div class="xright">
              Copyright &#169;                   2017.
          All rights reserved.    
                  </div>
      <div class="clear">
        <hr/>
      </div>
    </div>
  </body>
</html>
