<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!-- Generated by Apache Maven Doxia Site Renderer 1.7.4 at 2017-11-22 -->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en">
  <head>
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
    <title>design-pattern &#x2013; 代理模式</title>
    <style type="text/css" media="all">
      @import url("./css/maven-base.css");
      @import url("./css/maven-theme.css");
      @import url("./css/site.css");
    </style>
    <link rel="stylesheet" href="./css/print.css" type="text/css" media="print" />
    <meta http-equiv="Content-Language" content="en" />
        
        </head>
  <body class="composite">
    <div id="banner">
                    <div id="bannerLeft">
                design-pattern
                </div>
                    <div class="clear">
        <hr/>
      </div>
    </div>
    <div id="breadcrumbs">
          
                <div class="xleft">
        <span id="publishDate">Last Published: 2017-11-22</span>
                  &nbsp;| <span id="projectVersion">Version: 1.0-SNAPSHOT</span>
                      </div>
            <div class="xright">                    <a href="./" title="design-pattern">design-pattern</a>
            
      </div>
      <div class="clear">
        <hr/>
      </div>
    </div>
    <div id="leftColumn">
      <div id="navcolumn">
           
                                <h5>Parent Project</h5>
                  <ul>
                  <li class="none">
                          <a href="../index.html" title="java-learn">java-learn</a>
            </li>
          </ul>
                       <h5>Project Documentation</h5>
                  <ul>
                                                                                                                                                                                                                                                        <li class="collapsed">
                          <a href="project-info.html" title="Project Information">Project Information</a>
                  </li>
                                                                                      <li class="collapsed">
                          <a href="project-reports.html" title="Project Reports">Project Reports</a>
                  </li>
          </ul>
                             <a href="http://maven.apache.org/" title="Built by Maven" class="poweredBy">
        <img class="poweredBy" alt="Built by Maven" src="./images/logos/maven-feather.png" />
      </a>
                 
            </div>
    </div>
    <div id="bodyColumn">
      <div id="contentBox">
        <h1>&#x4ee3;&#x7406;&#x6a21;&#x5f0f;</h1>

<blockquote>
<p>&#x5728;&#x4ee3;&#x7406;&#x6a21;&#x5f0f;&#xff08;Proxy Pattern&#xff09;&#x4e2d;&#xff0c;&#x4e00;&#x4e2a;&#x7c7b;&#x4ee3;&#x8868;&#x53e6;&#x4e00;&#x4e2a;&#x7c7b;&#x7684;&#x529f;&#x80fd;&#x3002;&#x8fd9;&#x79cd;&#x7c7b;&#x578b;&#x7684;&#x8bbe;&#x8ba1;&#x6a21;&#x5f0f;&#x5c5e;&#x4e8e;&#x7ed3;&#x6784;&#x578b;&#x6a21;&#x5f0f;&#x3002; &#x5728;&#x4ee3;&#x7406;&#x6a21;&#x5f0f;&#x4e2d;&#xff0c;&#x6211;&#x4eec;&#x521b;&#x5efa;&#x5177;&#x6709;&#x73b0;&#x6709;&#x5bf9;&#x8c61;&#x7684;&#x5bf9;&#x8c61;&#xff0c;&#x4ee5;&#x4fbf;&#x5411;&#x5916;&#x754c;&#x63d0;&#x4f9b;&#x529f;&#x80fd;&#x63a5;&#x53e3;&#x3002;</p>
</blockquote>
<div class="section">
<h2><a name="a1_"></a>1 &#x4ecb;&#x7ecd;</h2>
<div class="section">
<h3><a name="a1.1_"></a>1.1 &#x6a21;&#x5f0f;&#x52a8;&#x673a;</h3>

<blockquote>
<p>&#x5728;&#x67d0;&#x4e9b;&#x60c5;&#x51b5;&#x4e0b;&#xff0c;&#x4e00;&#x4e2a;&#x5ba2;&#x6237;&#x4e0d;&#x60f3;&#x6216;&#x8005;&#x4e0d;&#x80fd;&#x76f4;&#x63a5;&#x5f15;&#x7528;&#x4e00;&#x4e2a;&#x5bf9; &#x8c61;&#xff0c;&#x6b64;&#x65f6;&#x53ef;&#x4ee5;&#x901a;&#x8fc7;&#x4e00;&#x4e2a;&#x79f0;&#x4e4b;&#x4e3a;&#x201c;&#x4ee3;&#x7406;&#x201d;&#x7684;&#x7b2c;&#x4e09;&#x8005;&#x6765;&#x5b9e;&#x73b0; &#x95f4;&#x63a5;&#x5f15;&#x7528;&#x3002;&#x4ee3;&#x7406;&#x5bf9;&#x8c61;&#x53ef;&#x4ee5;&#x5728;&#x5ba2;&#x6237;&#x7aef;&#x548c;&#x76ee;&#x6807;&#x5bf9;&#x8c61;&#x4e4b;&#x95f4;&#x8d77;&#x5230; &#x4e2d;&#x4ecb;&#x7684;&#x4f5c;&#x7528;&#xff0c;&#x5e76;&#x4e14;&#x53ef;&#x4ee5;&#x901a;&#x8fc7;&#x4ee3;&#x7406;&#x5bf9;&#x8c61;&#x53bb;&#x6389;&#x5ba2;&#x6237;&#x4e0d;&#x80fd;&#x770b;&#x5230; &#x7684;&#x5185;&#x5bb9;&#x548c;&#x670d;&#x52a1;&#x6216;&#x8005;&#x6dfb;&#x52a0;&#x5ba2;&#x6237;&#x9700;&#x8981;&#x7684;&#x989d;&#x5916;&#x670d;&#x52a1;&#x3002;</p>
<p>&#x901a;&#x8fc7;&#x5f15;&#x5165;&#x4e00;&#x4e2a;&#x65b0;&#x7684;&#x5bf9;&#x8c61;&#xff08;&#x5982;&#x5c0f;&#x56fe;&#x7247;&#x548c;&#x8fdc;&#x7a0b;&#x4ee3;&#x7406; &#x5bf9;&#x8c61;&#xff09;&#x6765;&#x5b9e;&#x73b0;&#x5bf9;&#x771f;&#x5b9e;&#x5bf9;&#x8c61;&#x7684;&#x64cd;&#x4f5c;&#x6216;&#x8005;&#x5c06;&#x65b0;&#x7684;&#x5bf9; &#x8c61;&#x4f5c;&#x4e3a;&#x771f;&#x5b9e;&#x5bf9;&#x8c61;&#x7684;&#x4e00;&#x4e2a;&#x66ff;&#x8eab;&#xff0c;&#x8fd9;&#x79cd;&#x5b9e;&#x73b0;&#x673a;&#x5236;&#x5373; &#x4e3a;&#x4ee3;&#x7406;&#x6a21;&#x5f0f;&#xff0c;&#x901a;&#x8fc7;&#x5f15;&#x5165;&#x4ee3;&#x7406;&#x5bf9;&#x8c61;&#x6765;&#x95f4;&#x63a5;&#x8bbf;&#x95ee;&#x4e00; &#x4e2a;&#x5bf9;&#x8c61;&#xff0c;&#x8fd9;&#x5c31;&#x662f;&#x4ee3;&#x7406;&#x6a21;&#x5f0f;&#x7684;&#x6a21;&#x5f0f;&#x52a8;&#x673a;&#x3002;</p>
</blockquote></div>
<div class="section">
<h3><a name="a1.2_"></a>1.2 &#x6a21;&#x5f0f;&#x5b9a;&#x4e49;</h3>

<blockquote>
<p>&#x4ee3;&#x7406;&#x6a21;&#x5f0f;(Proxy Pattern) &#xff1a;&#x7ed9;&#x67d0;&#x4e00;&#x4e2a;&#x5bf9;&#x8c61;&#x63d0;&#x4f9b;&#x4e00;&#x4e2a;&#x4ee3;&#x7406;&#xff0c;&#x5e76;&#x7531;&#x4ee3;&#x7406;&#x5bf9;&#x8c61;&#x63a7;&#x5236;&#x5bf9;&#x539f;&#x5bf9;&#x8c61;&#x7684;&#x5f15;&#x7528;&#x3002; &#x4ee3;&#x7406;&#x6a21;&#x5f0f;&#x7684;&#x82f1;&#x6587;&#x53eb;&#x505a;Proxy&#x6216;Surrogate&#xff0c;&#x5b83;&#x662f;&#x4e00;&#x79cd;&#x5bf9;&#x8c61;&#x7ed3;&#x6784;&#x578b;&#x6a21;&#x5f0f;&#x3002;</p>
</blockquote></div>
<div class="section">
<h3><a name="a1.3_"></a>1.3 &#x9002;&#x7528;&#x73af;&#x5883;</h3>

<blockquote>
<p>&#x6839;&#x636e;&#x4ee3;&#x7406;&#x6a21;&#x5f0f;&#x7684;&#x4f7f;&#x7528;&#x76ee;&#x7684;&#xff0c;&#x5e38;&#x89c1;&#x7684;&#x4ee3;&#x7406;&#x6a21;&#x5f0f;&#x6709;&#x4ee5;&#x4e0b;&#x51e0;&#x79cd;&#x7c7b;&#x578b;&#xff1a;</p>
  
<ul>
    
<li>&#x8fdc;&#x7a0b;(Remote)&#x4ee3;&#x7406;&#xff1a;&#x4e3a;&#x4e00;&#x4e2a;&#x4f4d;&#x4e8e;&#x4e0d;&#x540c;&#x7684;&#x5730;&#x5740;&#x7a7a;&#x95f4;&#x7684;&#x5bf9;&#x8c61;&#x63d0;&#x4f9b;&#x4e00;&#x4e2a;&#x672c;&#x5730; &#x7684;&#x4ee3;&#x7406;&#x5bf9;&#x8c61;&#xff0c;&#x8fd9;&#x4e2a;&#x4e0d;&#x540c;&#x7684;&#x5730;&#x5740;&#x7a7a;&#x95f4;&#x53ef;&#x4ee5;&#x662f;&#x5728;&#x540c;&#x4e00;&#x53f0;&#x4e3b;&#x673a;&#x4e2d;&#xff0c;&#x4e5f;&#x53ef;&#x662f;&#x5728; &#x53e6;&#x4e00;&#x53f0;&#x4e3b;&#x673a;&#x4e2d;&#xff0c;&#x8fdc;&#x7a0b;&#x4ee3;&#x7406;&#x53c8;&#x53eb;&#x505a;&#x5927;&#x4f7f;(Ambassador)&#x3002;</li>
    
<li>&#x865a;&#x62df;(Virtual)&#x4ee3;&#x7406;&#xff1a;&#x5982;&#x679c;&#x9700;&#x8981;&#x521b;&#x5efa;&#x4e00;&#x4e2a;&#x8d44;&#x6e90;&#x6d88;&#x8017;&#x8f83;&#x5927;&#x7684;&#x5bf9;&#x8c61;&#xff0c;&#x5148;&#x521b;&#x5efa;&#x4e00;&#x4e2a;&#x6d88;&#x8017;&#x76f8;&#x5bf9;&#x8f83;&#x5c0f;&#x7684;&#x5bf9;&#x8c61;&#x6765;&#x8868;&#x793a;&#xff0c;&#x771f;&#x5b9e;&#x5bf9;&#x8c61;&#x53ea;&#x5728;&#x9700;&#x8981;&#x65f6;&#x624d;&#x4f1a;&#x88ab;&#x771f;&#x6b63;&#x521b;&#x5efa;&#x3002;</li>
    
<li>Copy-on-Write&#x4ee3;&#x7406;&#xff1a;&#x5b83;&#x662f;&#x865a;&#x62df;&#x4ee3;&#x7406;&#x7684;&#x4e00;&#x79cd;&#xff0c;&#x628a;&#x590d;&#x5236;&#xff08;&#x514b;&#x9686;&#xff09;&#x64cd;&#x4f5c;&#x5ef6;&#x8fdf; &#x5230;&#x53ea;&#x6709;&#x5728;&#x5ba2;&#x6237;&#x7aef;&#x771f;&#x6b63;&#x9700;&#x8981;&#x65f6;&#x624d;&#x6267;&#x884c;&#x3002;&#x4e00;&#x822c;&#x6765;&#x8bf4;&#xff0c;&#x5bf9;&#x8c61;&#x7684;&#x6df1;&#x514b;&#x9686;&#x662f;&#x4e00;&#x4e2a; &#x5f00;&#x9500;&#x8f83;&#x5927;&#x7684;&#x64cd;&#x4f5c;&#xff0c;Copy-on-Write&#x4ee3;&#x7406;&#x53ef;&#x4ee5;&#x8ba9;&#x8fd9;&#x4e2a;&#x64cd;&#x4f5c;&#x5ef6;&#x8fdf;&#xff0c;&#x53ea;&#x6709;&#x5bf9;&#x8c61;&#x88ab;&#x7528;&#x5230;&#x7684;&#x65f6;&#x5019;&#x624d;&#x88ab;&#x514b;&#x9686;&#x3002;</li>
    
<li>&#x4fdd;&#x62a4;(Protect or Access)&#x4ee3;&#x7406;&#xff1a;&#x63a7;&#x5236;&#x5bf9;&#x4e00;&#x4e2a;&#x5bf9;&#x8c61;&#x7684;&#x8bbf;&#x95ee;&#xff0c;&#x53ef;&#x4ee5;&#x7ed9;&#x4e0d;&#x540c;&#x7684;&#x7528;&#x6237;&#x63d0;&#x4f9b;&#x4e0d;&#x540c;&#x7ea7;&#x522b;&#x7684;&#x4f7f;&#x7528;&#x6743;&#x9650;&#x3002;</li>
    
<li>&#x7f13;&#x51b2;(Cache)&#x4ee3;&#x7406;&#xff1a;&#x4e3a;&#x67d0;&#x4e00;&#x4e2a;&#x76ee;&#x6807;&#x64cd;&#x4f5c;&#x7684;&#x7ed3;&#x679c;&#x63d0;&#x4f9b;&#x4e34;&#x65f6;&#x7684;&#x5b58;&#x50a8;&#x7a7a;&#x95f4;&#xff0c;&#x4ee5;&#x4fbf;&#x591a;&#x4e2a;&#x5ba2;&#x6237;&#x7aef;&#x53ef;&#x4ee5;&#x5171;&#x4eab;&#x8fd9;&#x4e9b;&#x7ed3;&#x679c;&#x3002;</li>
    
<li>&#x9632;&#x706b;&#x5899;(Firewall)&#x4ee3;&#x7406;&#xff1a;&#x4fdd;&#x62a4;&#x76ee;&#x6807;&#x4e0d;&#x8ba9;&#x6076;&#x610f;&#x7528;&#x6237;&#x63a5;&#x8fd1;&#x3002;</li>
    
<li>&#x540c;&#x6b65;&#x5316;(Synchronization)&#x4ee3;&#x7406;&#xff1a;&#x4f7f;&#x51e0;&#x4e2a;&#x7528;&#x6237;&#x80fd;&#x591f;&#x540c;&#x65f6;&#x4f7f;&#x7528;&#x4e00;&#x4e2a;&#x5bf9;&#x8c61;&#x800c;&#x6ca1;&#x6709;&#x51b2;&#x7a81;&#x3002;</li>
    
<li>&#x667a;&#x80fd;&#x5f15;&#x7528;(Smart Reference)&#x4ee3;&#x7406;&#xff1a;&#x5f53;&#x4e00;&#x4e2a;&#x5bf9;&#x8c61;&#x88ab;&#x5f15;&#x7528;&#x65f6;&#xff0c;&#x63d0;&#x4f9b;&#x4e00;&#x4e9b;&#x989d;&#x5916;&#x7684;&#x64cd;&#x4f5c;&#xff0c;&#x5982;&#x5c06;&#x6b64;&#x5bf9;&#x8c61;&#x88ab;&#x8c03;&#x7528;&#x7684;&#x6b21;&#x6570;&#x8bb0;&#x5f55;&#x4e0b;&#x6765;&#x7b49;&#x3002;</li>
  </ul>
</blockquote></div>
<div class="section">
<h3><a name="a1.4_"></a>1.4 &#x6a21;&#x5f0f;&#x5e94;&#x7528;</h3>

<blockquote>
<p>EJB&#x3001;Web Service&#x7b49;&#x5206;&#x5e03;&#x5f0f;&#x6280;&#x672f;&#x90fd;&#x662f;&#x4ee3;&#x7406;&#x6a21;&#x5f0f;&#x7684;&#x5e94;&#x7528;&#x3002; &#x5728;EJB&#x4e2d;&#x4f7f;&#x7528;&#x4e86;RMI&#x673a;&#x5236;&#xff0c;&#x8fdc;&#x7a0b;&#x670d;&#x52a1;&#x5668;&#x4e2d;&#x7684;&#x4f01;&#x4e1a;&#x7ea7;Bean&#x5728;&#x672c;&#x5730;&#x6709;&#x4e00;&#x4e2a;&#x6869;&#x4ee3;&#x7406;&#xff0c; &#x5ba2;&#x6237;&#x7aef;&#x901a;&#x8fc7;&#x6869;&#x6765;&#x8c03;&#x7528;&#x8fdc;&#x7a0b;&#x5bf9;&#x8c61;&#x4e2d;&#x5b9a;&#x4e49;&#x7684;&#x65b9;&#x6cd5;&#xff0c;&#x800c;&#x65e0;&#x987b;&#x76f4;&#x63a5;&#x4e0e;&#x8fdc;&#x7a0b;&#x5bf9;&#x8c61;&#x4ea4;&#x4e92;&#x3002; &#x5728;EJB&#x7684;&#x4f7f;&#x7528;&#x4e2d;&#x9700;&#x8981;&#x63d0;&#x4f9b;&#x4e00;&#x4e2a;&#x516c;&#x5171;&#x7684;&#x63a5;&#x53e3;&#xff0c;&#x5ba2;&#x6237;&#x7aef;&#x9488;&#x5bf9;&#x8be5;&#x63a5;&#x53e3;&#x8fdb;&#x884c;&#x7f16;&#x7a0b;&#xff0c;&#x65e0;&#x987b;&#x77e5;&#x9053;&#x6869;&#x4ee5;&#x53ca;&#x8fdc;&#x7a0b;EJB&#x7684;&#x5b9e;&#x73b0;&#x7ec6;&#x8282;&#x3002;</p>
</blockquote></div>
<div class="section">
<h3><a name="a1.5_"></a>1.5 &#x4f18;&#x70b9;</h3>

<blockquote>
<p>&#x4ee3;&#x7406;&#x6a21;&#x5f0f;&#x7684;&#x4f18;&#x70b9;:</p>
  
<ul>
    
<li>&#x4ee3;&#x7406;&#x6a21;&#x5f0f;&#x80fd;&#x591f;&#x534f;&#x8c03;&#x8c03;&#x7528;&#x8005;&#x548c;&#x88ab;&#x8c03;&#x7528;&#x8005;&#xff0c;&#x5728;&#x4e00;&#x5b9a;&#x7a0b;&#x5ea6;&#x4e0a;&#x964d;&#x4f4e;&#x4e86;&#x7cfb;&#x7edf;&#x7684;&#x8026;&#x5408;&#x5ea6;&#x3002;</li>
    
<li>&#x8fdc;&#x7a0b;&#x4ee3;&#x7406;&#x4f7f;&#x5f97;&#x5ba2;&#x6237;&#x7aef;&#x53ef;&#x4ee5;&#x8bbf;&#x95ee;&#x5728;&#x8fdc;&#x7a0b;&#x673a;&#x5668;&#x4e0a;&#x7684;&#x5bf9;&#x8c61;&#xff0c;&#x8fdc;&#x7a0b;&#x673a;&#x5668;&#x53ef;&#x80fd;&#x5177;&#x6709;&#x66f4;&#x597d;&#x7684;&#x8ba1;&#x7b97;&#x6027;&#x80fd;&#x4e0e;&#x5904;&#x7406;&#x901f;&#x5ea6;&#xff0c;&#x53ef;&#x4ee5;&#x5feb;&#x901f;&#x54cd;&#x5e94;&#x5e76;&#x5904;&#x7406;&#x5ba2;&#x6237;&#x7aef;&#x8bf7;&#x6c42;&#x3002;</li>
    
<li>&#x865a;&#x62df;&#x4ee3;&#x7406;&#x901a;&#x8fc7;&#x4f7f;&#x7528;&#x4e00;&#x4e2a;&#x5c0f;&#x5bf9;&#x8c61;&#x6765;&#x4ee3;&#x8868;&#x4e00;&#x4e2a;&#x5927;&#x5bf9;&#x8c61;&#xff0c;&#x53ef;&#x4ee5;&#x51cf;&#x5c11;&#x7cfb;&#x7edf;&#x8d44;&#x6e90;&#x7684;&#x6d88;&#x8017;&#xff0c;&#x5bf9;&#x7cfb;&#x7edf;&#x8fdb;&#x884c;&#x4f18;&#x5316;&#x5e76;&#x63d0;&#x9ad8;&#x8fd0;&#x884c;&#x901f;&#x5ea6;&#x3002;</li>
    
<li>&#x4fdd;&#x62a4;&#x4ee3;&#x7406;&#x53ef;&#x4ee5;&#x63a7;&#x5236;&#x5bf9;&#x771f;&#x5b9e;&#x5bf9;&#x8c61;&#x7684;&#x4f7f;&#x7528;&#x6743;&#x9650;&#x3002;</li>
  </ul>
</blockquote></div>
<div class="section">
<h3><a name="a1.6_"></a>1.6 &#x7f3a;&#x70b9;</h3>

<blockquote>
<p>&#x4ee3;&#x7406;&#x6a21;&#x5f0f;&#x7684;&#x7f3a;&#x70b9;:</p>
  
<ul>
    
<li>&#x7531;&#x4e8e;&#x5728;&#x5ba2;&#x6237;&#x7aef;&#x548c;&#x771f;&#x5b9e;&#x4e3b;&#x9898;&#x4e4b;&#x95f4;&#x589e;&#x52a0;&#x4e86;&#x4ee3;&#x7406;&#x5bf9;&#x8c61;&#xff0c;&#x56e0;&#x6b64; &#x6709;&#x4e9b;&#x7c7b;&#x578b;&#x7684;&#x4ee3;&#x7406;&#x6a21;&#x5f0f;&#x53ef;&#x80fd;&#x4f1a;&#x9020;&#x6210;&#x8bf7;&#x6c42;&#x7684;&#x5904;&#x7406;&#x901f;&#x5ea6;&#x53d8;&#x6162;&#x3002;</li>
    
<li>&#x5b9e;&#x73b0;&#x4ee3;&#x7406;&#x6a21;&#x5f0f;&#x9700;&#x8981;&#x989d;&#x5916;&#x7684;&#x5de5;&#x4f5c;&#xff0c;&#x6709;&#x4e9b;&#x4ee3;&#x7406;&#x6a21;&#x5f0f;&#x7684;&#x5b9e;&#x73b0; &#x975e;&#x5e38;&#x590d;&#x6742;&#x3002;</li>
  </ul>
</blockquote></div>
<div class="section">
<h3><a name="a1.7_"></a>1.7 &#x6a21;&#x5f0f;&#x7ed3;&#x6784;</h3>

<blockquote>
<p>&#x4ee3;&#x7406;&#x6a21;&#x5f0f;&#x5305;&#x542b;&#x5982;&#x4e0b;&#x89d2;&#x8272;&#xff1a;</p>
</blockquote>

<ul>
  
<li>
  
<blockquote>AbstractSubject: &#x62bd;&#x8c61;&#x4e3b;&#x9898;&#x89d2;&#x8272;
  </blockquote></li>
  
<li>
  
<blockquote>ProxySubject: &#x4ee3;&#x7406;&#x4e3b;&#x9898;&#x89d2;&#x8272;
  </blockquote></li>
  
<li>
  
<blockquote>ConcreteSubject: &#x5177;&#x4f53;&#x4e3b;&#x9898;&#x89d2;&#x8272;
  </blockquote></li>
</ul>
<p>![](image/proxy.png)</p></div>
<div class="section">
<h3><a name="a1.8_"></a>1.8 &#x65f6;&#x5e8f;&#x56fe;</h3>
<p>![](image/proxy-sequence.png)</p></div></div>
<div class="section">
<h2><a name="a2_"></a>2 &#x4ee3;&#x7801;&#x5206;&#x6790;</h2>

<blockquote>
<p>AbstractSubject:</p>
</blockquote>

<div class="source">
<div class="source">
<pre>public abstract class AbstractSubject {

    public abstract void request(String name);
}
</pre></div></div>

<blockquote>
<p>ConcreteSubject:</p>
</blockquote>

<div class="source">
<div class="source">
<pre>public class ConcreteSubject extends AbstractSubject{

    public void request(String name){
        System.out.println(String.format(&quot;request %s &quot;,name));
    }
}
</pre></div></div>

<blockquote>
<p>ProxySubject</p>
</blockquote>

<div class="source">
<div class="source">
<pre>@Slf4j
public class ProxySubject extends AbstractSubject {

    private ConcreteSubject subject;

    ProxySubject() {
        this.subject = new ConcreteSubject();
    }

    @Override
    public void request(String name) {

        preRequest(name); // &#x8bf7;&#x6c42;&#x524d;&#x7f6e;&#x5904;&#x7406;

        subject.request(name);

        postRequest(name); // &#x8bf7;&#x6c42;&#x540e;&#x7f6e;&#x5904;&#x7406;

    }

    private void preRequest(String name) {
        log.info(&quot;-*--*--*--*- pre request : {} -*--*--*--*--&quot;,name);
    }

    private void postRequest(String name) {
        log.info(&quot;-*--*--*--*- post request : {} -*--*--*--*--&quot;,name);
    }
}
</pre></div></div>

<blockquote>
<p>Client: </p>
</blockquote>

<div class="source">
<div class="source">
<pre>@Slf4j
public class Client {

    private final static ProxySubject proxy = new ProxySubject();

    public static void main(String[] args) {

        proxy.request(&quot;nihao&quot;);

    }
}
</pre></div></div>

<blockquote>
<p>&#x8fd0;&#x884c;&#x7ed3;&#x679c;&#xff1a;</p>
</blockquote>
<p>![](image/proxy-result.png)</p></div>
<div class="section">
<h2><a name="a3_"></a>3 &#x6a21;&#x5f0f;&#x5206;&#x6790;</h2></div>
<div class="section">
<h2><a name="a4_"></a>4 &#x5b9e;&#x4f8b;</h2></div>
<div class="section">
<h2><a name="a"></a>&#x6a21;&#x5f0f;&#x6269;&#x5c55;</h2>

<blockquote>
<p>&#x51e0;&#x79cd;&#x5e38;&#x7528;&#x7684;&#x4ee3;&#x7406;&#x6a21;&#x5f0f;:</p>
  
<ul>
    
<li>&#x56fe;&#x7247;&#x4ee3;&#x7406;&#xff1a;&#x4e00;&#x4e2a;&#x5f88;&#x5e38;&#x89c1;&#x7684;&#x4ee3;&#x7406;&#x6a21;&#x5f0f;&#x7684;&#x5e94;&#x7528;&#x5b9e;&#x4f8b;&#x5c31;&#x662f;&#x5bf9;&#x5927;&#x56fe;&#x6d4f;&#x89c8;&#x7684;&#x63a7;&#x5236;&#x3002; &#x7528;&#x6237;&#x901a;&#x8fc7;&#x6d4f;&#x89c8;&#x5668;&#x8bbf;&#x95ee;&#x7f51;&#x9875;&#x65f6;&#x5148;&#x4e0d;&#x52a0;&#x8f7d;&#x771f;&#x5b9e;&#x7684;&#x5927;&#x56fe;&#xff0c;&#x800c;&#x662f;&#x901a;&#x8fc7;&#x4ee3;&#x7406;&#x5bf9;&#x8c61;&#x7684;&#x65b9;&#x6cd5;&#x6765;&#x8fdb;&#x884c;&#x5904;&#x7406;&#xff0c; &#x5728;&#x4ee3;&#x7406;&#x5bf9;&#x8c61;&#x7684;&#x65b9;&#x6cd5;&#x4e2d;&#xff0c;&#x5148;&#x4f7f;&#x7528;&#x4e00;&#x4e2a;&#x7ebf;&#x7a0b;&#x5411;&#x5ba2;&#x6237;&#x7aef;&#x6d4f;&#x89c8;&#x5668;&#x52a0;&#x8f7d;&#x4e00;&#x4e2a;&#x5c0f;&#x56fe;&#x7247;&#xff0c; &#x7136;&#x540e;&#x5728;&#x540e;&#x53f0;&#x4f7f;&#x7528;&#x53e6;&#x4e00;&#x4e2a;&#x7ebf;&#x7a0b;&#x6765;&#x8c03;&#x7528;&#x5927;&#x56fe;&#x7247;&#x7684;&#x52a0;&#x8f7d;&#x65b9;&#x6cd5;&#x5c06;&#x5927;&#x56fe;&#x7247;&#x52a0;&#x8f7d;&#x5230;&#x5ba2;&#x6237;&#x7aef;&#x3002; &#x5f53;&#x9700;&#x8981;&#x6d4f;&#x89c8;&#x5927;&#x56fe;&#x7247;&#x65f6;&#xff0c;&#x518d;&#x5c06;&#x5927;&#x56fe;&#x7247;&#x5728;&#x65b0;&#x7f51;&#x9875;&#x4e2d;&#x663e;&#x793a;&#x3002; &#x5982;&#x679c;&#x7528;&#x6237;&#x5728;&#x6d4f;&#x89c8;&#x5927;&#x56fe;&#x65f6;&#x52a0;&#x8f7d;&#x5de5;&#x4f5c;&#x8fd8;&#x6ca1;&#x6709;&#x5b8c;&#x6210;&#xff0c;&#x53ef;&#x4ee5;&#x518d;&#x542f;&#x52a8;&#x4e00;&#x4e2a;&#x7ebf;&#x7a0b;&#x6765;&#x663e;&#x793a;&#x76f8;&#x5e94;&#x7684;&#x63d0;&#x793a;&#x4fe1;&#x606f;&#x3002; &#x901a;&#x8fc7;&#x4ee3;&#x7406;&#x6280;&#x672f;&#x7ed3;&#x5408;&#x591a;&#x7ebf;&#x7a0b;&#x7f16;&#x7a0b;&#x5c06;&#x771f;&#x5b9e;&#x56fe;&#x7247;&#x7684;&#x52a0;&#x8f7d;&#x653e;&#x5230;&#x540e;&#x53f0;&#x6765;&#x64cd;&#x4f5c;&#xff0c;&#x4e0d;&#x5f71;&#x54cd;&#x524d;&#x53f0;&#x56fe;&#x7247;&#x7684;&#x6d4f;&#x89c8;&#x3002;</li>
    
<li>&#x8fdc;&#x7a0b;&#x4ee3;&#x7406;&#xff1a;&#x8fdc;&#x7a0b;&#x4ee3;&#x7406;&#x53ef;&#x4ee5;&#x5c06;&#x7f51;&#x7edc;&#x7684;&#x7ec6;&#x8282;&#x9690;&#x85cf;&#x8d77;&#x6765;&#xff0c;&#x4f7f;&#x5f97;&#x5ba2;&#x6237;&#x7aef;&#x4e0d;&#x5fc5;&#x8003;&#x8651;&#x7f51;&#x7edc;&#x7684;&#x5b58;&#x5728;&#x3002; &#x5ba2;&#x6237;&#x5b8c;&#x5168;&#x53ef;&#x4ee5;&#x8ba4;&#x4e3a;&#x88ab;&#x4ee3;&#x7406;&#x7684;&#x8fdc;&#x7a0b;&#x4e1a;&#x52a1;&#x5bf9;&#x8c61;&#x662f;&#x5c40;&#x57df;&#x7684;&#x800c;&#x4e0d;&#x662f;&#x8fdc;&#x7a0b;&#x7684;&#xff0c; &#x800c;&#x8fdc;&#x7a0b;&#x4ee3;&#x7406;&#x5bf9;&#x8c61;&#x627f;&#x62c5;&#x4e86;&#x5927;&#x90e8;&#x5206;&#x7684;&#x7f51;&#x7edc;&#x901a;&#x4fe1;&#x5de5;&#x4f5c;&#x3002;</li>
    
<li>&#x865a;&#x62df;&#x4ee3;&#x7406;&#xff1a;&#x5f53;&#x4e00;&#x4e2a;&#x5bf9;&#x8c61;&#x7684;&#x52a0;&#x8f7d;&#x5341;&#x5206;&#x8017;&#x8d39;&#x8d44;&#x6e90;&#x7684;&#x65f6;&#x5019;&#xff0c;&#x865a;&#x62df;&#x4ee3;&#x7406;&#x7684;&#x4f18;&#x52bf;&#x5c31;&#x975e;&#x5e38;&#x660e;&#x663e;&#x5730;&#x4f53;&#x73b0;&#x51fa;&#x6765;&#x4e86;&#x3002; &#x865a;&#x62df;&#x4ee3;&#x7406;&#x6a21;&#x5f0f;&#x662f;&#x4e00;&#x79cd;&#x5185;&#x5b58;&#x8282;&#x7701;&#x6280;&#x672f;&#xff0c;&#x90a3;&#x4e9b;&#x5360;&#x7528;&#x5927;&#x91cf;&#x5185;&#x5b58;&#x6216;&#x5904;&#x7406;&#x590d;&#x6742;&#x7684;&#x5bf9;&#x8c61;&#x5c06;&#x63a8;&#x8fdf;&#x5230;&#x4f7f;&#x7528;&#x5b83;&#x7684;&#x65f6;&#x5019;&#x624d;&#x521b;&#x5efa;&#x3002;</li>
  </ul>
</blockquote></div>
<div class="section">
<h2><a name="a"></a>&#x603b;&#x7ed3;</h2>

<blockquote>
<p>&#x5728;&#x4ee3;&#x7406;&#x6a21;&#x5f0f;&#x4e2d;&#xff0c;&#x8981;&#x6c42;&#x7ed9;&#x67d0;&#x4e00;&#x4e2a;&#x5bf9;&#x8c61;&#x63d0;&#x4f9b;&#x4e00;&#x4e2a;&#x4ee3;&#x7406;&#xff0c;&#x5e76;&#x7531;&#x4ee3;&#x7406;&#x5bf9;&#x8c61;&#x63a7;&#x5236;&#x5bf9;&#x539f;&#x5bf9;&#x8c61;&#x7684;&#x5f15;&#x7528;&#x3002; &#x4ee3;&#x7406;&#x6a21;&#x5f0f;&#x7684;&#x82f1;&#x6587;&#x53eb;&#x505a;Proxy&#x6216;Surrogate&#xff0c;&#x5b83;&#x662f;&#x4e00;&#x79cd;&#x5bf9;&#x8c61;&#x7ed3;&#x6784;&#x578b;&#x6a21;&#x5f0f;&#x3002; - &#x4ee3;&#x7406;&#x6a21;&#x5f0f;&#x5305;&#x542b;&#x4e09;&#x4e2a;&#x89d2;&#x8272;&#xff1a;&#x62bd;&#x8c61;&#x4e3b;&#x9898;&#x89d2;&#x8272;&#x58f0;&#x660e;&#x4e86;&#x5177;&#x4f53;&#x4e3b;&#x9898;&#x548c;&#x4ee3;&#x7406;&#x4e3b;&#x9898;&#x7684;&#x5171;&#x540c;&#x63a5;&#x53e3;&#xff1b; &#x4ee3;&#x7406;&#x4e3b;&#x9898;&#x89d2;&#x8272;&#x5185;&#x90e8;&#x5305;&#x542b;&#x5bf9;&#x771f;&#x5b9e;&#x4e3b;&#x9898;&#x7684;&#x5f15;&#x7528;&#xff0c;&#x4ece;&#x800c;&#x53ef;&#x4ee5;&#x5728;&#x4efb;&#x4f55;&#x65f6;&#x5019;&#x64cd;&#x4f5c;&#x771f;&#x5b9e;&#x4e3b;&#x9898;&#x5bf9;&#x8c61;&#xff1b; &#x771f;&#x5b9e;&#x4e3b;&#x9898;&#x89d2;&#x8272;&#x5b9a;&#x4e49;&#x4e86;&#x4ee3;&#x7406;&#x89d2;&#x8272;&#x6240;&#x4ee3;&#x8868;&#x7684;&#x771f;&#x5b9e;&#x5bf9;&#x8c61;&#xff0c;&#x5728;&#x771f;&#x5b9e;&#x4e3b;&#x9898;&#x89d2;&#x8272;&#x4e2d;&#x5b9e;&#x73b0;&#x4e86;&#x771f;&#x5b9e;&#x7684;&#x4e1a;&#x52a1;&#x64cd;&#x4f5c;&#xff0c;&#x5ba2;&#x6237;&#x7aef;&#x53ef;&#x4ee5;&#x901a;&#x8fc7;&#x4ee3;&#x7406;&#x4e3b;&#x9898;&#x89d2;&#x8272;&#x95f4;&#x63a5;&#x8c03;&#x7528;&#x771f;&#x5b9e;&#x4e3b;&#x9898;&#x89d2;&#x8272;&#x4e2d;&#x5b9a;&#x4e49;&#x7684;&#x65b9;&#x6cd5;&#x3002; - &#x4ee3;&#x7406;&#x6a21;&#x5f0f;&#x7684;&#x4f18;&#x70b9;&#x5728;&#x4e8e;&#x80fd;&#x591f;&#x534f;&#x8c03;&#x8c03;&#x7528;&#x8005;&#x548c;&#x88ab;&#x8c03;&#x7528;&#x8005;&#xff0c;&#x5728;&#x4e00;&#x5b9a;&#x7a0b;&#x5ea6;&#x4e0a;&#x964d;&#x4f4e;&#x4e86;&#x7cfb;&#x7edf;&#x7684;&#x8026;&#x5408;&#x5ea6;&#xff1b; &#x5176;&#x7f3a;&#x70b9;&#x5728;&#x4e8e;&#x7531;&#x4e8e;&#x5728;&#x5ba2;&#x6237;&#x7aef;&#x548c;&#x771f;&#x5b9e;&#x4e3b;&#x9898;&#x4e4b;&#x95f4;&#x589e;&#x52a0;&#x4e86;&#x4ee3;&#x7406;&#x5bf9;&#x8c61;&#xff0c;&#x56e0;&#x6b64;&#x6709;&#x4e9b;&#x7c7b;&#x578b;&#x7684;&#x4ee3;&#x7406;&#x6a21;&#x5f0f;&#x53ef;&#x80fd;&#x4f1a;&#x9020;&#x6210;&#x8bf7;&#x6c42;&#x7684;&#x5904;&#x7406;&#x901f;&#x5ea6;&#x53d8;&#x6162;&#xff0c;&#x5e76;&#x4e14;&#x5b9e;&#x73b0;&#x4ee3;&#x7406;&#x6a21;&#x5f0f;&#x9700;&#x8981;&#x989d;&#x5916;&#x7684;&#x5de5;&#x4f5c;&#xff0c;&#x6709;&#x4e9b;&#x4ee3;&#x7406;&#x6a21;&#x5f0f;&#x7684;&#x5b9e;&#x73b0;&#x975e;&#x5e38;&#x590d;&#x6742;&#x3002; &#x8fdc;&#x7a0b;&#x4ee3;&#x7406;&#x4e3a;&#x4e00;&#x4e2a;&#x4f4d;&#x4e8e;&#x4e0d;&#x540c;&#x7684;&#x5730;&#x5740;&#x7a7a;&#x95f4;&#x7684;&#x5bf9;&#x8c61;&#x63d0;&#x4f9b;&#x4e00;&#x4e2a;&#x672c;&#x5730;&#x7684;&#x4ee3;&#x8868;&#x5bf9;&#x8c61;&#xff0c;&#x5b83;&#x4f7f;&#x5f97;&#x5ba2;&#x6237;&#x7aef;&#x53ef;&#x4ee5;&#x8bbf;&#x95ee;&#x5728;&#x8fdc;&#x7a0b;&#x673a;&#x5668;&#x4e0a;&#x7684;&#x5bf9;&#x8c61;&#xff0c;&#x8fdc;&#x7a0b;&#x673a;&#x5668;&#x53ef;&#x80fd;&#x5177;&#x6709;&#x66f4;&#x597d;&#x7684;&#x8ba1;&#x7b97;&#x6027;&#x80fd;&#x4e0e;&#x5904;&#x7406;&#x901f;&#x5ea6;&#xff0c;&#x53ef;&#x4ee5;&#x5feb;&#x901f;&#x54cd;&#x5e94;&#x5e76;&#x5904;&#x7406;&#x5ba2;&#x6237;&#x7aef;&#x8bf7;&#x6c42;&#x3002; - &#x5982;&#x679c;&#x9700;&#x8981;&#x521b;&#x5efa;&#x4e00;&#x4e2a;&#x8d44;&#x6e90;&#x6d88;&#x8017;&#x8f83;&#x5927;&#x7684;&#x5bf9;&#x8c61;&#xff0c;&#x5148;&#x521b;&#x5efa;&#x4e00;&#x4e2a;&#x6d88;&#x8017;&#x76f8;&#x5bf9;&#x8f83;&#x5c0f;&#x7684;&#x5bf9;&#x8c61;&#x6765;&#x8868;&#x793a;&#xff0c;&#x771f;&#x5b9e;&#x5bf9;&#x8c61;&#x53ea;&#x5728;&#x9700;&#x8981;&#x65f6;&#x624d;&#x4f1a;&#x88ab;&#x771f;&#x6b63;&#x521b;&#x5efa;&#xff0c;&#x8fd9;&#x4e2a;&#x5c0f;&#x5bf9;&#x8c61;&#x79f0;&#x4e3a;&#x865a;&#x62df;&#x4ee3;&#x7406;&#x3002;&#x865a;&#x62df;&#x4ee3;&#x7406;&#x901a;&#x8fc7;&#x4f7f;&#x7528;&#x4e00;&#x4e2a;&#x5c0f;&#x5bf9;&#x8c61;&#x6765;&#x4ee3;&#x8868;&#x4e00;&#x4e2a;&#x5927;&#x5bf9;&#x8c61;&#xff0c;&#x53ef;&#x4ee5;&#x51cf;&#x5c11;&#x7cfb;&#x7edf;&#x8d44;&#x6e90;&#x7684;&#x6d88;&#x8017;&#xff0c;&#x5bf9;&#x7cfb;&#x7edf;&#x8fdb;&#x884c;&#x4f18;&#x5316;&#x5e76;&#x63d0;&#x9ad8;&#x8fd0;&#x884c;&#x901f;&#x5ea6;&#x3002; - &#x4fdd;&#x62a4;&#x4ee3;&#x7406;&#x53ef;&#x4ee5;&#x63a7;&#x5236;&#x5bf9;&#x4e00;&#x4e2a;&#x5bf9;&#x8c61;&#x7684;&#x8bbf;&#x95ee;&#xff0c;&#x53ef;&#x4ee5;&#x7ed9;&#x4e0d;&#x540c;&#x7684;&#x7528;&#x6237;&#x63d0;&#x4f9b;&#x4e0d;&#x540c;&#x7ea7;&#x522b;&#x7684;&#x4f7f;&#x7528;&#x6743;&#x9650;&#x3002;</p>
</blockquote></div>
      </div>
    </div>
    <div class="clear">
      <hr/>
    </div>
    <div id="footer">
      <div class="xright">
              Copyright &#169;                   2017.
          All rights reserved.    
                  </div>
      <div class="clear">
        <hr/>
      </div>
    </div>
  </body>
</html>
