<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!-- Generated by Apache Maven Doxia Site Renderer 1.7.4 at 2017-11-06 -->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en">
  <head>
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
    <title>design-pattern &#x2013; 设计模式 学习</title>
    <style type="text/css" media="all">
      @import url("./css/maven-base.css");
      @import url("./css/maven-theme.css");
      @import url("./css/site.css");
    </style>
    <link rel="stylesheet" href="./css/print.css" type="text/css" media="print" />
    <meta http-equiv="Content-Language" content="en" />
        
        </head>
  <body class="composite">
    <div id="banner">
                    <div id="bannerLeft">
                design-pattern
                </div>
                    <div class="clear">
        <hr/>
      </div>
    </div>
    <div id="breadcrumbs">
          
                <div class="xleft">
        <span id="publishDate">Last Published: 2017-11-06</span>
                  &nbsp;| <span id="projectVersion">Version: 1.0-SNAPSHOT</span>
                      </div>
            <div class="xright">                    <a href="./" title="design-pattern">design-pattern</a>
            
      </div>
      <div class="clear">
        <hr/>
      </div>
    </div>
    <div id="leftColumn">
      <div id="navcolumn">
           
                                <h5>Parent Project</h5>
                  <ul>
                  <li class="none">
                          <a href="../index.html" title="java-learn">java-learn</a>
            </li>
          </ul>
                       <h5>Project Documentation</h5>
                  <ul>
                                                                                                                                                                                                                                                        <li class="collapsed">
                          <a href="project-info.html" title="Project Information">Project Information</a>
                  </li>
          </ul>
                             <a href="http://maven.apache.org/" title="Built by Maven" class="poweredBy">
        <img class="poweredBy" alt="Built by Maven" src="./images/logos/maven-feather.png" />
      </a>
                 
            </div>
    </div>
    <div id="bodyColumn">
      <div id="contentBox">
        <h1>&#x8bbe;&#x8ba1;&#x6a21;&#x5f0f; &#x5b66;&#x4e60;</h1>
<p>&#x53c2;&#x8003;<a class="externalLink" href="http://www.runoob.com/design-pattern/design-pattern-intro.html">&#x83dc;&#x9e1f;&#x6559;&#x7a0b;-&#x8bbe;&#x8ba1;&#x6a21;&#x5f0f;</a></p>
<div class="section">
<h2><a name="a1_"></a>1 &#x8bbe;&#x8ba1;&#x6a21;&#x5f0f;&#x7b80;&#x4ecb;</h2>

<blockquote>
<p>&#x8bbe;&#x8ba1;&#x6a21;&#x5f0f;&#xff08;Design pattern&#xff09;&#x4ee3;&#x8868;&#x4e86;&#x6700;&#x4f73;&#x7684;&#x5b9e;&#x8df5;&#xff0c;&#x901a;&#x5e38;&#x88ab;&#x6709;&#x7ecf;&#x9a8c;&#x7684;&#x9762;&#x5411;&#x5bf9;&#x8c61;&#x7684;&#x8f6f;&#x4ef6;&#x5f00;&#x53d1;&#x4eba;&#x5458;&#x6240;&#x91c7;&#x7528;&#x3002; &#x8bbe;&#x8ba1;&#x6a21;&#x5f0f;&#x662f;&#x8f6f;&#x4ef6;&#x5f00;&#x53d1;&#x4eba;&#x5458;&#x5728;&#x8f6f;&#x4ef6;&#x5f00;&#x53d1;&#x8fc7;&#x7a0b;&#x4e2d;&#x9762;&#x4e34;&#x7684;&#x4e00;&#x822c;&#x95ee;&#x9898;&#x7684;&#x89e3;&#x51b3;&#x65b9;&#x6848;&#x3002; &#x8fd9;&#x4e9b;&#x89e3;&#x51b3;&#x65b9;&#x6848;&#x662f;&#x4f17;&#x591a;&#x8f6f;&#x4ef6;&#x5f00;&#x53d1;&#x4eba;&#x5458;&#x7ecf;&#x8fc7;&#x76f8;&#x5f53;&#x957f;&#x7684;&#x4e00;&#x6bb5;&#x65f6;&#x95f4;&#x7684;&#x8bd5;&#x9a8c;&#x548c;&#x9519;&#x8bef;&#x603b;&#x7ed3;&#x51fa;&#x6765;&#x7684;&#x3002;</p>
<p>&#x8bbe;&#x8ba1;&#x6a21;&#x5f0f;&#x662f;&#x4e00;&#x5957;&#x88ab;&#x53cd;&#x590d;&#x4f7f;&#x7528;&#x7684;&#x3001;&#x591a;&#x6570;&#x4eba;&#x77e5;&#x6653;&#x7684;&#x3001;&#x7ecf;&#x8fc7;&#x5206;&#x7c7b;&#x7f16;&#x76ee;&#x7684;&#x3001;&#x4ee3;&#x7801;&#x8bbe;&#x8ba1;&#x7ecf;&#x9a8c;&#x7684;&#x603b;&#x7ed3;&#x3002; &#x4f7f;&#x7528;&#x8bbe;&#x8ba1;&#x6a21;&#x5f0f;&#x662f;&#x4e3a;&#x4e86;&#x91cd;&#x7528;&#x4ee3;&#x7801;&#x3001;&#x8ba9;&#x4ee3;&#x7801;&#x66f4;&#x5bb9;&#x6613;&#x88ab;&#x4ed6;&#x4eba;&#x7406;&#x89e3;&#x3001;&#x4fdd;&#x8bc1;&#x4ee3;&#x7801;&#x53ef;&#x9760;&#x6027;&#x3002; &#x6beb;&#x65e0;&#x7591;&#x95ee;&#xff0c;&#x8bbe;&#x8ba1;&#x6a21;&#x5f0f;&#x4e8e;&#x5df1;&#x4e8e;&#x4ed6;&#x4eba;&#x4e8e;&#x7cfb;&#x7edf;&#x90fd;&#x662f;&#x591a;&#x8d62;&#x7684;&#xff0c;&#x8bbe;&#x8ba1;&#x6a21;&#x5f0f;&#x4f7f;&#x4ee3;&#x7801;&#x7f16;&#x5236;&#x771f;&#x6b63;&#x5de5;&#x7a0b;&#x5316;&#xff0c; &#x8bbe;&#x8ba1;&#x6a21;&#x5f0f;&#x662f;&#x8f6f;&#x4ef6;&#x5de5;&#x7a0b;&#x7684;&#x57fa;&#x77f3;&#xff0c;&#x5982;&#x540c;&#x5927;&#x53a6;&#x7684;&#x4e00;&#x5757;&#x5757;&#x7816;&#x77f3;&#x4e00;&#x6837;&#x3002; &#x9879;&#x76ee;&#x4e2d;&#x5408;&#x7406;&#x5730;&#x8fd0;&#x7528;&#x8bbe;&#x8ba1;&#x6a21;&#x5f0f;&#x53ef;&#x4ee5;&#x5b8c;&#x7f8e;&#x5730;&#x89e3;&#x51b3;&#x5f88;&#x591a;&#x95ee;&#x9898;&#xff0c;&#x6bcf;&#x79cd;&#x6a21;&#x5f0f;&#x5728;&#x73b0;&#x5b9e;&#x4e2d;&#x90fd;&#x6709;&#x76f8;&#x5e94;&#x7684;&#x539f;&#x7406;&#x6765;&#x4e0e;&#x4e4b;&#x5bf9;&#x5e94;&#xff0c; &#x6bcf;&#x79cd;&#x6a21;&#x5f0f;&#x90fd;&#x63cf;&#x8ff0;&#x4e86;&#x4e00;&#x4e2a;&#x5728;&#x6211;&#x4eec;&#x5468;&#x56f4;&#x4e0d;&#x65ad;&#x91cd;&#x590d;&#x53d1;&#x751f;&#x7684;&#x95ee;&#x9898;&#xff0c;&#x4ee5;&#x53ca;&#x8be5;&#x95ee;&#x9898;&#x7684;&#x6838;&#x5fc3;&#x89e3;&#x51b3;&#x65b9;&#x6848;&#xff0c;&#x8fd9;&#x4e5f;&#x662f;&#x8bbe;&#x8ba1;&#x6a21;&#x5f0f;&#x80fd;&#x88ab;&#x5e7f;&#x6cdb;&#x5e94;&#x7528;&#x7684;&#x539f;&#x56e0;&#x3002;</p>
</blockquote>
<div class="section">
<h3><a name="a_GOF_Gang_of_Four"></a>&#x4ec0;&#x4e48;&#x662f; GOF&#xff08;&#x56db;&#x4eba;&#x5e2e;&#xff0c;&#x5168;&#x62fc; Gang of Four&#xff09;&#xff1f;</h3>

<blockquote>
<p>&#x5728; 1994 &#x5e74;&#xff0c;&#x7531; Erich Gamma&#x3001;Richard Helm&#x3001;Ralph Johnson &#x548c; John Vlissides &#x56db;&#x4eba;&#x5408;&#x8457;&#x51fa;&#x7248;&#x4e86;&#x4e00;&#x672c;&#x540d;&#x4e3a; Design Patterns - Elements of Reusable Object-Oriented Software&#xff08;&#x4e2d;&#x6587;&#x8bd1;&#x540d;&#xff1a;&#x8bbe;&#x8ba1;&#x6a21;&#x5f0f; - &#x53ef;&#x590d;&#x7528;&#x7684;&#x9762;&#x5411;&#x5bf9;&#x8c61;&#x8f6f;&#x4ef6;&#x5143;&#x7d20;&#xff09; &#x7684;&#x4e66;&#xff0c;&#x8be5;&#x4e66;&#x9996;&#x6b21;&#x63d0;&#x5230;&#x4e86;&#x8f6f;&#x4ef6;&#x5f00;&#x53d1;&#x4e2d;&#x8bbe;&#x8ba1;&#x6a21;&#x5f0f;&#x7684;&#x6982;&#x5ff5;&#x3002; &#x56db;&#x4f4d;&#x4f5c;&#x8005;&#x5408;&#x79f0; GOF&#xff08;&#x56db;&#x4eba;&#x5e2e;&#xff0c;&#x5168;&#x62fc; Gang of Four&#xff09;&#x3002;&#x4ed6;&#x4eec;&#x6240;&#x63d0;&#x51fa;&#x7684;&#x8bbe;&#x8ba1;&#x6a21;&#x5f0f;&#x4e3b;&#x8981;&#x662f;&#x57fa;&#x4e8e;&#x4ee5;&#x4e0b;&#x7684;&#x9762;&#x5411;&#x5bf9;&#x8c61;&#x8bbe;&#x8ba1;&#x539f;&#x5219;&#x3002; * &#x5bf9;&#x63a5;&#x53e3;&#x7f16;&#x7a0b;&#x800c;&#x4e0d;&#x662f;&#x5bf9;&#x5b9e;&#x73b0;&#x7f16;&#x7a0b; * &#x4f18;&#x5148;&#x4f7f;&#x7528;&#x5bf9;&#x8c61;&#x7ec4;&#x5408;&#x800c;&#x4e0d;&#x662f;&#x7ee7;&#x627f;</p>
</blockquote></div>
<div class="section">
<h3><a name="a"></a>&#x8bbe;&#x8ba1;&#x6a21;&#x5f0f;&#x7684;&#x4f7f;&#x7528;</h3>
<p>&#x8bbe;&#x8ba1;&#x6a21;&#x5f0f;&#x5728;&#x8f6f;&#x4ef6;&#x5f00;&#x53d1;&#x4e2d;&#x7684;&#x4e24;&#x4e2a;&#x4e3b;&#x8981;&#x7528;&#x9014;&#x3002; * #### &#x5f00;&#x53d1;&#x4eba;&#x5458;&#x7684;&#x5171;&#x540c;&#x5e73;&#x53f0;</p>

<blockquote>
<p>&#x8bbe;&#x8ba1;&#x6a21;&#x5f0f;&#x63d0;&#x4f9b;&#x4e86;&#x4e00;&#x4e2a;&#x6807;&#x51c6;&#x7684;&#x672f;&#x8bed;&#x7cfb;&#x7edf;&#xff0c;&#x4e14;&#x5177;&#x4f53;&#x5230;&#x7279;&#x5b9a;&#x7684;&#x60c5;&#x666f;&#x3002;&#x4f8b;&#x5982;&#xff0c;&#x5355;&#x4f8b;&#x8bbe;&#x8ba1;&#x6a21;&#x5f0f;&#x610f;&#x5473;&#x7740;&#x4f7f;&#x7528;&#x5355;&#x4e2a;&#x5bf9;&#x8c61;&#xff0c;&#x8fd9;&#x6837;&#x6240;&#x6709;&#x719f;&#x6089;&#x5355;&#x4f8b;&#x8bbe;&#x8ba1;&#x6a21;&#x5f0f;&#x7684;&#x5f00;&#x53d1;&#x4eba;&#x5458;&#x90fd;&#x80fd;&#x4f7f;&#x7528;&#x5355;&#x4e2a;&#x5bf9;&#x8c61;&#xff0c;&#x5e76;&#x4e14;&#x53ef;&#x4ee5;&#x901a;&#x8fc7;&#x8fd9;&#x79cd;&#x65b9;&#x5f0f;&#x544a;&#x8bc9;&#x5bf9;&#x65b9;&#xff0c;&#x7a0b;&#x5e8f;&#x4f7f;&#x7528;&#x7684;&#x662f;&#x5355;&#x4f8b;&#x6a21;&#x5f0f;&#x3002; * #### &#x6700;&#x4f73;&#x7684;&#x5b9e;&#x8df5; &#x8bbe;&#x8ba1;&#x6a21;&#x5f0f;&#x5df2;&#x7ecf;&#x7ecf;&#x5386;&#x4e86;&#x5f88;&#x957f;&#x4e00;&#x6bb5;&#x65f6;&#x95f4;&#x7684;&#x53d1;&#x5c55;&#xff0c;&#x5b83;&#x4eec;&#x63d0;&#x4f9b;&#x4e86;&#x8f6f;&#x4ef6;&#x5f00;&#x53d1;&#x8fc7;&#x7a0b;&#x4e2d;&#x9762;&#x4e34;&#x7684;&#x4e00;&#x822c;&#x95ee;&#x9898;&#x7684;&#x6700;&#x4f73;&#x89e3;&#x51b3;&#x65b9;&#x6848;&#x3002;&#x5b66;&#x4e60;&#x8fd9;&#x4e9b;&#x6a21;&#x5f0f;&#x6709;&#x52a9;&#x4e8e;&#x7ecf;&#x9a8c;&#x4e0d;&#x8db3;&#x7684;&#x5f00;&#x53d1;&#x4eba;&#x5458;&#x901a;&#x8fc7;&#x4e00;&#x79cd;&#x7b80;&#x5355;&#x5feb;&#x6377;&#x7684;&#x65b9;&#x5f0f;&#x6765;&#x5b66;&#x4e60;&#x8f6f;&#x4ef6;&#x8bbe;&#x8ba1;&#x3002;</p>
</blockquote></div></div>
<div class="section">
<h2><a name="a2_"></a>2 &#x8bbe;&#x8ba1;&#x6a21;&#x5f0f;&#x5206;&#x7c7b;</h2>

<blockquote>
<p>&#x6839;&#x636e;&#x8bbe;&#x8ba1;&#x6a21;&#x5f0f;&#x7684;&#x53c2;&#x8003;&#x4e66; Design Patterns - Elements of Reusable Object-Oriented Software&#xff08;&#x4e2d;&#x6587;&#x8bd1;&#x540d;&#xff1a;&#x8bbe;&#x8ba1;&#x6a21;&#x5f0f; - &#x53ef;&#x590d;&#x7528;&#x7684;&#x9762;&#x5411;&#x5bf9;&#x8c61;&#x8f6f;&#x4ef6;&#x5143;&#x7d20;&#xff09; &#x4e2d;&#x6240;&#x63d0;&#x5230;&#x7684;&#xff0c; &#x603b;&#x5171;&#x6709; 23 &#x79cd;&#x8bbe;&#x8ba1;&#x6a21;&#x5f0f;&#x3002; &#x8fd9;&#x4e9b;&#x6a21;&#x5f0f;&#x53ef;&#x4ee5;&#x5206;&#x4e3a;&#x4e09;&#x5927;&#x7c7b;&#xff1a;&#x521b;&#x5efa;&#x578b;&#x6a21;&#x5f0f;&#xff08;Creational Patterns&#xff09;&#x3001;&#x7ed3;&#x6784;&#x578b;&#x6a21;&#x5f0f;&#xff08;Structural Patterns&#xff09;&#x3001;&#x884c;&#x4e3a;&#x578b;&#x6a21;&#x5f0f;&#xff08;Behavioral Patterns&#xff09;&#x3002; &#x5f53;&#x7136;&#xff0c;&#x6211;&#x4eec;&#x8fd8;&#x4f1a;&#x8ba8;&#x8bba;&#x53e6;&#x4e00;&#x7c7b;&#x8bbe;&#x8ba1;&#x6a21;&#x5f0f;&#xff1a;J2EE &#x8bbe;&#x8ba1;&#x6a21;&#x5f0f;&#x3002;</p>
</blockquote>

<table border="0" class="bodyTable">
  <thead>
    
<tr class="a">
      
<th>&#x6a21;&#x5f0f;&amp;&#x63cf;&#x8ff0; </th>
      
<th>&#x5305;&#x62ec;</th>
    </tr>
  </thead>
  <tbody>
    
<tr class="b">
      
<td><b>&#x521b;&#x5efa;&#x578b;&#x6a21;&#x5f0f;</b><br />&#x8fd9;&#x4e9b;&#x8bbe;&#x8ba1;&#x6a21;&#x5f0f;&#x63d0;&#x4f9b;&#x4e86;&#x4e00;&#x79cd;&#x5728;&#x521b;&#x5efa;&#x5bf9;&#x8c61;&#x7684;&#x540c;&#x65f6;&#x9690;&#x85cf;&#x521b;&#x5efa;&#x903b;&#x8f91;&#x7684;&#x65b9;&#x5f0f;&#xff0c;<br />&#x800c;&#x4e0d;&#x662f;&#x4f7f;&#x7528; new &#x8fd0;&#x7b97;&#x7b26;&#x76f4;&#x63a5;&#x5b9e;&#x4f8b;&#x5316;&#x5bf9;&#x8c61;&#x3002;<br />&#x8fd9;&#x4f7f;&#x5f97;&#x7a0b;&#x5e8f;&#x5728;&#x5224;&#x65ad;&#x9488;&#x5bf9;&#x67d0;&#x4e2a;&#x7ed9;&#x5b9a;&#x5b9e;&#x4f8b;&#x9700;&#x8981;&#x521b;&#x5efa;&#x54ea;&#x4e9b;&#x5bf9;&#x8c61;&#x65f6;&#x66f4;&#x52a0;&#x7075;&#x6d3b;&#x3002;</td>
      
<td>&#x5de5;&#x5382;&#x6a21;&#x5f0f;&#xff08;Factory Pattern&#xff09;<br />&#x62bd;&#x8c61;&#x5de5;&#x5382;&#x6a21;&#x5f0f;&#xff08;Abstract Factory Pattern&#xff09;<br />&#x5355;&#x4f8b;&#x6a21;&#x5f0f;&#xff08;Singleton Pattern&#xff09;<br />&#x5efa;&#x9020;&#x8005;&#x6a21;&#x5f0f;&#xff08;Builder Pattern&#xff09;<br />&#x539f;&#x578b;&#x6a21;&#x5f0f;&#xff08;Prototype Pattern&#xff09;</td>
    </tr>
    
<tr class="a">
      
<td><b>&#x7ed3;&#x6784;&#x578b;&#x6a21;&#x5f0f;</b><br />&#x8fd9;&#x4e9b;&#x8bbe;&#x8ba1;&#x6a21;&#x5f0f;&#x5173;&#x6ce8;&#x7c7b;&#x548c;&#x5bf9;&#x8c61;&#x7684;&#x7ec4;&#x5408;&#x3002;<br />&#x7ee7;&#x627f;&#x7684;&#x6982;&#x5ff5;&#x88ab;&#x7528;&#x6765;&#x7ec4;&#x5408;&#x63a5;&#x53e3;&#x548c;&#x5b9a;&#x4e49;&#x7ec4;&#x5408;&#x5bf9;&#x8c61;&#x83b7;&#x5f97;&#x65b0;&#x529f;&#x80fd;&#x7684;&#x65b9;&#x5f0f;&#x3002;</td>
      
<td>&#x9002;&#x914d;&#x5668;&#x6a21;&#x5f0f;&#xff08;Adapter Pattern&#xff09;<br />&#x6865;&#x63a5;&#x6a21;&#x5f0f;&#xff08;Bridge Pattern&#xff09;<br />&#x8fc7;&#x6ee4;&#x5668;&#x6a21;&#x5f0f;&#xff08;Filter&#x3001;Criteria Pattern&#xff09;<br />&#x7ec4;&#x5408;&#x6a21;&#x5f0f;&#xff08;Composite Pattern&#xff09;<br />&#x88c5;&#x9970;&#x5668;&#x6a21;&#x5f0f;&#xff08;Decorator Pattern&#xff09;<br />&#x5916;&#x89c2;&#x6a21;&#x5f0f;&#xff08;Facade Pattern&#xff09;<br />&#x4eab;&#x5143;&#x6a21;&#x5f0f;&#xff08;Flyweight Pattern&#xff09;<br />&#x4ee3;&#x7406;&#x6a21;&#x5f0f;&#xff08;Proxy Pattern&#xff09;</td>
    </tr>
    
<tr class="b">
      
<td><b>&#x884c;&#x4e3a;&#x578b;&#x6a21;&#x5f0f;</b><br />&#x8fd9;&#x4e9b;&#x8bbe;&#x8ba1;&#x6a21;&#x5f0f;&#x7279;&#x522b;&#x5173;&#x6ce8;&#x5bf9;&#x8c61;&#x4e4b;&#x95f4;&#x7684;&#x901a;&#x4fe1;&#x3002;</td>
      
<td>&#x8d23;&#x4efb;&#x94fe;&#x6a21;&#x5f0f;&#xff08;Chain of Responsibility Pattern&#xff09;<br />&#x547d;&#x4ee4;&#x6a21;&#x5f0f;&#xff08;Command Pattern&#xff09;<br />&#x89e3;&#x91ca;&#x5668;&#x6a21;&#x5f0f;&#xff08;Interpreter Pattern&#xff09;<br />&#x8fed;&#x4ee3;&#x5668;&#x6a21;&#x5f0f;&#xff08;Iterator Pattern&#xff09;<br />&#x4e2d;&#x4ecb;&#x8005;&#x6a21;&#x5f0f;&#xff08;Mediator Pattern&#xff09;<br />&#x5907;&#x5fd8;&#x5f55;&#x6a21;&#x5f0f;&#xff08;Memento Pattern&#xff09;<br />&#x89c2;&#x5bdf;&#x8005;&#x6a21;&#x5f0f;&#xff08;Observer Pattern&#xff09;<br />&#x72b6;&#x6001;&#x6a21;&#x5f0f;&#xff08;State Pattern&#xff09;<br />&#x7a7a;&#x5bf9;&#x8c61;&#x6a21;&#x5f0f;&#xff08;Null Object Pattern&#xff09;<br />&#x7b56;&#x7565;&#x6a21;&#x5f0f;&#xff08;Strategy Pattern&#xff09;<br />&#x6a21;&#x677f;&#x6a21;&#x5f0f;&#xff08;Template Pattern&#xff09;<br />&#x8bbf;&#x95ee;&#x8005;&#x6a21;&#x5f0f;&#xff08;Visitor Pattern&#xff09;</td>
    </tr>
    
<tr class="a">
      
<td><b>J2EE &#x6a21;&#x5f0f;</b><br />&#x8fd9;&#x4e9b;&#x8bbe;&#x8ba1;&#x6a21;&#x5f0f;&#x7279;&#x522b;&#x5173;&#x6ce8;&#x8868;&#x793a;&#x5c42;&#x3002;&#x8fd9;&#x4e9b;&#x6a21;&#x5f0f;&#x662f;&#x7531; Sun Java Center &#x9274;&#x5b9a;&#x7684;&#x3002;</td>
      
<td>MVC &#x6a21;&#x5f0f;&#xff08;MVC Pattern&#xff09;<br />&#x4e1a;&#x52a1;&#x4ee3;&#x8868;&#x6a21;&#x5f0f;&#xff08;Business Delegate Pattern&#xff09;<br />&#x7ec4;&#x5408;&#x5b9e;&#x4f53;&#x6a21;&#x5f0f;&#xff08;Composite Entity Pattern&#xff09;<br />&#x6570;&#x636e;&#x8bbf;&#x95ee;&#x5bf9;&#x8c61;&#x6a21;&#x5f0f;&#xff08;Data Access Object Pattern&#xff09;<br />&#x524d;&#x7aef;&#x63a7;&#x5236;&#x5668;&#x6a21;&#x5f0f;&#xff08;Front Controller Pattern&#xff09;<br />&#x62e6;&#x622a;&#x8fc7;&#x6ee4;&#x5668;&#x6a21;&#x5f0f;&#xff08;Intercepting Filter Pattern&#xff09;<br />&#x670d;&#x52a1;&#x5b9a;&#x4f4d;&#x5668;&#x6a21;&#x5f0f;&#xff08;Service Locator Pattern&#xff09;<br />&#x4f20;&#x8f93;&#x5bf9;&#x8c61;&#x6a21;&#x5f0f;&#xff08;Transfer Object Pattern&#xff09;</td>
    </tr>
  </tbody>
</table></div>
<div class="section">
<h2><a name="a3_"></a>3 &#x8bbe;&#x8ba1;&#x6a21;&#x5f0f;&#x516d;&#x5927;&#x539f;&#x5219;</h2>

<table border="0" class="bodyTable">
  <thead>
    
<tr class="a">
      
<th>&#x539f;&#x5219; </th>
      
<th>&#x7b80;&#x8ff0;</th>
    </tr>
  </thead>
  <tbody>
    
<tr class="b">
      
<td>&#x5f00;&#x95ed;&#x539f;&#x5219; </td>
      
<td>&#x5b9e;&#x73b0;&#x70ed;&#x63d2;&#x62d4;&#xff0c;&#x63d0;&#x9ad8;&#x6269;&#x5c55;&#x6027;</td>
    </tr>
    
<tr class="a">
      
<td>&#x91cc;&#x6c0f;&#x4ee3;&#x6362;&#x539f;&#x5219; </td>
      
<td>&#x5b9e;&#x73b0;&#x62bd;&#x8c61;&#x7684;&#x89c4;&#x8303;&#xff0c;&#x5b9e;&#x73b0;&#x5b50;&#x7236;&#x7c7b;&#x4e92;&#x76f8;&#x66ff;&#x6362;</td>
    </tr>
    
<tr class="b">
      
<td>&#x4f9d;&#x8d56;&#x5012;&#x8f6c;&#x539f;&#x5219; </td>
      
<td>&#x9488;&#x5bf9;&#x63a5;&#x53e3;&#x7f16;&#x7a0b;&#xff0c;&#x5b9e;&#x73b0;&#x5f00;&#x95ed;&#x539f;&#x5219;&#x7684;&#x57fa;&#x7840;</td>
    </tr>
    
<tr class="a">
      
<td>&#x63a5;&#x53e3;&#x9694;&#x79bb;&#x539f;&#x5219; </td>
      
<td>&#x964d;&#x4f4e;&#x8026;&#x5408;&#x5ea6;&#xff0c;&#x63a5;&#x53e3;&#x5355;&#x72ec;&#x8bbe;&#x8ba1;&#xff0c;&#x4e92;&#x76f8;&#x9694;&#x79bb;</td>
    </tr>
    
<tr class="b">
      
<td>&#x8fea;&#x7c73;&#x7279;&#x6cd5;&#x5219; </td>
      
<td>&#x53c8;&#x79f0;&#x4e0d;&#x77e5;&#x9053;&#x539f;&#x5219;&#xff0c; &#x529f;&#x80fd;&#x6a21;&#x5757;&#x5c3d;&#x91cf;&#x72ec;&#x7acb;</td>
    </tr>
    
<tr class="a">
      
<td>&#x5408;&#x6210;&#x590d;&#x7528;&#x539f;&#x5219; </td>
      
<td>&#x5c3d;&#x91cf;&#x4f7f;&#x7528;&#x805a;&#x5408;&#xff0c;&#x7ec4;&#x5408;&#xff0c;&#x800c;&#x4e0d;&#x662f;&#x7ee7;&#x627f;</td>
    </tr>
  </tbody>
</table>
<div class="section">
<h3><a name="a3.1_Open_Close_Principle"></a>3.1 &#x5f00;&#x95ed;&#x539f;&#x5219;&#xff08;Open Close Principle&#xff09;</h3>

<blockquote>
<p>&#x5f00;&#x95ed;&#x539f;&#x5219;&#x7684;&#x610f;&#x601d;&#x662f;&#xff1a;&#x5bf9;&#x6269;&#x5c55;&#x5f00;&#x653e;&#xff0c;&#x5bf9;&#x4fee;&#x6539;&#x5173;&#x95ed;&#x3002;&#x5728;&#x7a0b;&#x5e8f;&#x9700;&#x8981;&#x8fdb;&#x884c;&#x62d3;&#x5c55;&#x7684;&#x65f6;&#x5019;&#xff0c;&#x4e0d;&#x80fd;&#x53bb;&#x4fee;&#x6539;&#x539f;&#x6709;&#x7684;&#x4ee3;&#x7801;&#xff0c;&#x5b9e;&#x73b0;&#x4e00;&#x4e2a;&#x70ed;&#x63d2;&#x62d4;&#x7684;&#x6548;&#x679c;&#x3002;&#x7b80;&#x8a00;&#x4e4b;&#xff0c;&#x662f;&#x4e3a;&#x4e86;&#x4f7f;&#x7a0b;&#x5e8f;&#x7684;&#x6269;&#x5c55;&#x6027;&#x597d;&#xff0c;&#x6613;&#x4e8e;&#x7ef4;&#x62a4;&#x548c;&#x5347;&#x7ea7;&#x3002;&#x60f3;&#x8981;&#x8fbe;&#x5230;&#x8fd9;&#x6837;&#x7684;&#x6548;&#x679c;&#xff0c;&#x6211;&#x4eec;&#x9700;&#x8981;&#x4f7f;&#x7528;&#x63a5;&#x53e3;&#x548c;&#x62bd;&#x8c61;&#x7c7b;&#xff0c;&#x540e;&#x9762;&#x7684;&#x5177;&#x4f53;&#x8bbe;&#x8ba1;&#x4e2d;&#x6211;&#x4eec;&#x4f1a;&#x63d0;&#x5230;&#x8fd9;&#x70b9;&#x3002;</p></div>
<div class="section">
<h3><a name="a3.2_Liskov_Substitution_Principle"></a>3.2 &#x91cc;&#x6c0f;&#x4ee3;&#x6362;&#x539f;&#x5219;&#xff08;Liskov Substitution Principle&#xff09;</h3>
<p>&#x91cc;&#x6c0f;&#x4ee3;&#x6362;&#x539f;&#x5219;&#x662f;&#x9762;&#x5411;&#x5bf9;&#x8c61;&#x8bbe;&#x8ba1;&#x7684;&#x57fa;&#x672c;&#x539f;&#x5219;&#x4e4b;&#x4e00;&#x3002; &#x91cc;&#x6c0f;&#x4ee3;&#x6362;&#x539f;&#x5219;&#x4e2d;&#x8bf4;&#xff0c;&#x4efb;&#x4f55;&#x57fa;&#x7c7b;&#x53ef;&#x4ee5;&#x51fa;&#x73b0;&#x7684;&#x5730;&#x65b9;&#xff0c;&#x5b50;&#x7c7b;&#x4e00;&#x5b9a;&#x53ef;&#x4ee5;&#x51fa;&#x73b0;&#x3002;LSP &#x662f;&#x7ee7;&#x627f;&#x590d;&#x7528;&#x7684;&#x57fa;&#x77f3;&#xff0c;&#x53ea;&#x6709;&#x5f53;&#x6d3e;&#x751f;&#x7c7b;&#x53ef;&#x4ee5;&#x66ff;&#x6362;&#x6389;&#x57fa;&#x7c7b;&#xff0c;&#x4e14;&#x8f6f;&#x4ef6;&#x5355;&#x4f4d;&#x7684;&#x529f;&#x80fd;&#x4e0d;&#x53d7;&#x5230;&#x5f71;&#x54cd;&#x65f6;&#xff0c;&#x57fa;&#x7c7b;&#x624d;&#x80fd;&#x771f;&#x6b63;&#x88ab;&#x590d;&#x7528;&#xff0c;&#x800c;&#x6d3e;&#x751f;&#x7c7b;&#x4e5f;&#x80fd;&#x591f;&#x5728;&#x57fa;&#x7c7b;&#x7684;&#x57fa;&#x7840;&#x4e0a;&#x589e;&#x52a0;&#x65b0;&#x7684;&#x884c;&#x4e3a;&#x3002;&#x91cc;&#x6c0f;&#x4ee3;&#x6362;&#x539f;&#x5219;&#x662f;&#x5bf9;&#x5f00;&#x95ed;&#x539f;&#x5219;&#x7684;&#x8865;&#x5145;&#x3002;&#x5b9e;&#x73b0;&#x5f00;&#x95ed;&#x539f;&#x5219;&#x7684;&#x5173;&#x952e;&#x6b65;&#x9aa4;&#x5c31;&#x662f;&#x62bd;&#x8c61;&#x5316;&#xff0c;&#x800c;&#x57fa;&#x7c7b;&#x4e0e;&#x5b50;&#x7c7b;&#x7684;&#x7ee7;&#x627f;&#x5173;&#x7cfb;&#x5c31;&#x662f;&#x62bd;&#x8c61;&#x5316;&#x7684;&#x5177;&#x4f53;&#x5b9e;&#x73b0;&#xff0c;&#x6240;&#x4ee5;&#x91cc;&#x6c0f;&#x4ee3;&#x6362;&#x539f;&#x5219;&#x662f;&#x5bf9;&#x5b9e;&#x73b0;&#x62bd;&#x8c61;&#x5316;&#x7684;&#x5177;&#x4f53;&#x6b65;&#x9aa4;&#x7684;&#x89c4;&#x8303;&#x3002;</p></div>
<div class="section">
<h3><a name="a3.3_Dependence_Inversion_Principle"></a>3.3 &#x4f9d;&#x8d56;&#x5012;&#x8f6c;&#x539f;&#x5219;&#xff08;Dependence Inversion Principle&#xff09;</h3>
<p>&#x8fd9;&#x4e2a;&#x539f;&#x5219;&#x662f;&#x5f00;&#x95ed;&#x539f;&#x5219;&#x7684;&#x57fa;&#x7840;&#xff0c;&#x5177;&#x4f53;&#x5185;&#x5bb9;&#xff1a;&#x9488;&#x5bf9;&#x63a5;&#x53e3;&#x7f16;&#x7a0b;&#xff0c;&#x4f9d;&#x8d56;&#x4e8e;&#x62bd;&#x8c61;&#x800c;&#x4e0d;&#x4f9d;&#x8d56;&#x4e8e;&#x5177;&#x4f53;&#x3002;</p></div>
<div class="section">
<h3><a name="a3.4_Interface_Segregation_Principle"></a>3.4 &#x63a5;&#x53e3;&#x9694;&#x79bb;&#x539f;&#x5219;&#xff08;Interface Segregation Principle&#xff09;</h3>
<p>&#x8fd9;&#x4e2a;&#x539f;&#x5219;&#x7684;&#x610f;&#x601d;&#x662f;&#xff1a;&#x4f7f;&#x7528;&#x591a;&#x4e2a;&#x9694;&#x79bb;&#x7684;&#x63a5;&#x53e3;&#xff0c;&#x6bd4;&#x4f7f;&#x7528;&#x5355;&#x4e2a;&#x63a5;&#x53e3;&#x8981;&#x597d;&#x3002;&#x5b83;&#x8fd8;&#x6709;&#x53e6;&#x5916;&#x4e00;&#x4e2a;&#x610f;&#x601d;&#x662f;&#xff1a;&#x964d;&#x4f4e;&#x7c7b;&#x4e4b;&#x95f4;&#x7684;&#x8026;&#x5408;&#x5ea6;&#x3002;&#x7531;&#x6b64;&#x53ef;&#x89c1;&#xff0c;&#x5176;&#x5b9e;&#x8bbe;&#x8ba1;&#x6a21;&#x5f0f;&#x5c31;&#x662f;&#x4ece;&#x5927;&#x578b;&#x8f6f;&#x4ef6;&#x67b6;&#x6784;&#x51fa;&#x53d1;&#x3001;&#x4fbf;&#x4e8e;&#x5347;&#x7ea7;&#x548c;&#x7ef4;&#x62a4;&#x7684;&#x8f6f;&#x4ef6;&#x8bbe;&#x8ba1;&#x601d;&#x60f3;&#xff0c;&#x5b83;&#x5f3a;&#x8c03;&#x964d;&#x4f4e;&#x4f9d;&#x8d56;&#xff0c;&#x964d;&#x4f4e;&#x8026;&#x5408;&#x3002;</p></div>
<div class="section">
<h3><a name="a3.5_Demeter_Principle"></a>3.5 &#x8fea;&#x7c73;&#x7279;&#x6cd5;&#x5219;&#xff0c;&#x53c8;&#x79f0;&#x6700;&#x5c11;&#x77e5;&#x9053;&#x539f;&#x5219;&#xff08;Demeter Principle&#xff09;</h3>
<p>&#x6700;&#x5c11;&#x77e5;&#x9053;&#x539f;&#x5219;&#x662f;&#x6307;&#xff1a;&#x4e00;&#x4e2a;&#x5b9e;&#x4f53;&#x5e94;&#x5f53;&#x5c3d;&#x91cf;&#x5c11;&#x5730;&#x4e0e;&#x5176;&#x4ed6;&#x5b9e;&#x4f53;&#x4e4b;&#x95f4;&#x53d1;&#x751f;&#x76f8;&#x4e92;&#x4f5c;&#x7528;&#xff0c;&#x4f7f;&#x5f97;&#x7cfb;&#x7edf;&#x529f;&#x80fd;&#x6a21;&#x5757;&#x76f8;&#x5bf9;&#x72ec;&#x7acb;&#x3002;</p></div>
<div class="section">
<h3><a name="a3.6_Composite_Reuse_Principle"></a>3.6 &#x5408;&#x6210;&#x590d;&#x7528;&#x539f;&#x5219;&#xff08;Composite Reuse Principle&#xff09;</h3>
<p>&#x5408;&#x6210;&#x590d;&#x7528;&#x539f;&#x5219;&#x662f;&#x6307;&#xff1a;&#x5c3d;&#x91cf;&#x4f7f;&#x7528;&#x5408;&#x6210;/&#x805a;&#x5408;&#x7684;&#x65b9;&#x5f0f;&#xff0c;&#x800c;&#x4e0d;&#x662f;&#x4f7f;&#x7528;&#x7ee7;&#x627f;&#x3002;</p>
</blockquote></div></div>
<div class="section">
<h2><a name="a4_UML"></a>4 UML&#x57fa;&#x7840;</h2>
<div class="section">
<h3><a name="a4.1_"></a>4.1 &#x7c7b;&#x56fe;</h3>

<blockquote>
<p>&#x7c7b;&#x56fe;&#x8868;&#x793a;&#x4e0d;&#x540c;&#x7684;&#x5b9e;&#x4f53;&#xff08;&#x4eba;&#x3001;&#x4e8b;&#x7269;&#x548c;&#x6570;&#x636e;&#xff09;&#x5982;&#x4f55;&#x5f7c;&#x6b64;&#x76f8;&#x5173;&#xff1b; &#x6362;&#x53e5;&#x8bdd;&#x8bf4;&#xff0c;&#x5b83;&#x663e;&#x793a;&#x4e86;&#x7cfb;&#x7edf;&#x7684;&#x9759;&#x6001;&#x7ed3;&#x6784;&#x3002;&#x7c7b;&#x56fe;&#x53ef;&#x7528;&#x4e8e;&#x8868;&#x793a;&#x903b;&#x8f91;&#x7c7b;&#xff0c; &#x903b;&#x8f91;&#x7c7b;&#x901a;&#x5e38;&#x5c31;&#x662f;&#x4e1a;&#x52a1;&#x4eba;&#x5458;&#x6240;&#x8c08;&#x53ca;&#x7684;&#x4e8b;&#x7269;&#x79cd;&#x7c7b;&#x2013;&#x6447;&#x6eda;&#x4e50;&#x961f;&#x3001;CD&#x3001;&#x5e7f;&#x64ad;&#x5267;&#xff1b;&#x6216;&#x8005;&#x8d37;&#x6b3e;&#x3001;&#x4f4f;&#x623f;&#x62b5;&#x62bc;&#x3001;&#x6c7d;&#x8f66;&#x4fe1;&#x8d37;&#x4ee5;&#x53ca;&#x5229;&#x7387;&#x3002; &#x7c7b;&#x56fe;&#x8fd8;&#x53ef;&#x7528;&#x4e8e;&#x8868;&#x793a;&#x5b9e;&#x73b0;&#x7c7b;&#xff0c;&#x5b9e;&#x73b0;&#x7c7b;&#x5c31;&#x662f;&#x7a0b;&#x5e8f;&#x5458;&#x5904;&#x7406;&#x7684;&#x5b9e;&#x4f53;&#x3002;&#x5b9e;&#x73b0;&#x7c7b;&#x56fe;&#x6216;&#x8bb8;&#x4f1a;&#x4e0e;&#x903b;&#x8f91;&#x7c7b;&#x56fe;&#x663e;&#x793a;&#x4e00;&#x4e9b;&#x76f8;&#x540c;&#x7684;&#x7c7b;&#x3002; &#x7136;&#x800c;&#xff0c;&#x5b9e;&#x73b0;&#x7c7b;&#x56fe;&#x4e0d;&#x4f1a;&#x4f7f;&#x7528;&#x76f8;&#x540c;&#x7684;&#x5c5e;&#x6027;&#x6765;&#x63cf;&#x8ff0;&#xff0c;&#x56e0;&#x4e3a;&#x5b83;&#x5f88;&#x53ef;&#x80fd;&#x5177;&#x6709;&#x5bf9;&#x8bf8;&#x5982;Vector&#x548c;HashMap&#x8fd9;&#x79cd;&#x4e8b;&#x7269;&#x7684;&#x5f15;&#x7528;&#x3002; &#x793a;&#x4f8b;(Intellij idea&#x4e2d;)&#xff1a;</p>
</blockquote>
<p><img src="image/class.png" alt="类图示例" /></p></div>
<div class="section">
<h3><a name="a4.2_"></a>4.2 &#x7c7b;&#x7684;&#x5173;&#x7cfb;</h3>
<p>&#x53c2;&#x8003;<a class="externalLink" href="http://blog.csdn.net/lpjishu/article/details/51491779">&#x3010;47&#x3011;java&#x7684;&#x7c7b;&#x4e4b;&#x95f4;&#x7684;&#x5173;&#x7cfb;&#xff1a;&#x6cdb;&#x5316;&#x3001;&#x4f9d;&#x8d56;&#x3001;&#x5173;&#x8054;&#x3001;&#x5b9e;&#x73b0;&#x3001;&#x805a;&#x5408;&#x3001;&#x7ec4;&#x5408;</a></p>

<ul>
  
<li>
<div class="section">
<h4><a name="a"></a>&#x7ee7;&#x627f;</h4>
  
<blockquote>&#x7ee7;&#x627f;&#x5173;&#x7cfb;&#x4e5f;&#x79f0;&#x6cdb;&#x5316;&#x5173;&#x7cfb;&#xff0c;&#x6307;&#x7684;&#x662f;&#x4e00;&#x4e2a;&#x7c7b;&#xff08;&#x79f0;&#x4e3a;&#x5b50;&#x7c7b;&#x3001;&#x5b50;&#x63a5;&#x53e3;&#xff09;&#x7ee7;&#x627f;&#x53e6;&#x5916;&#x7684;&#x4e00;&#x4e2a;&#x7c7b;&#xff08;&#x79f0;&#x4e3a;&#x7236;&#x7c7b;&#x3001;&#x7236;&#x63a5;&#x53e3;&#xff09;&#x7684;&#x529f;&#x80fd;&#xff0c;&#x5e76;&#x53ef;&#x4ee5;&#x589e;&#x52a0;&#x5b83;&#x81ea;&#x5df1;&#x7684;&#x65b0;&#x529f;&#x80fd;&#x7684;&#x80fd;&#x529b;&#xff0c;&#x7ee7;&#x627f;&#x662f;&#x7c7b;&#x4e0e;&#x7c7b;&#x6216;&#x8005;&#x63a5;&#x53e3;&#x4e0e;&#x63a5;&#x53e3;&#x4e4b;&#x95f4;&#x6700;&#x5e38;&#x89c1;&#x7684;&#x5173;&#x7cfb;&#xff1b;&#x5728;Java&#x4e2d;&#x6b64;&#x7c7b;&#x5173;&#x7cfb;&#x901a;&#x8fc7;&#x5173;&#x952e;&#x5b57;extends&#x660e;&#x786e;&#x6807;&#x8bc6;&#x3002; ![](image/extend.png)
  </blockquote></li>
</ul>

<blockquote>
<p>&#x5728;UML&#x5f53;&#x4e2d;&#xff0c;&#x5bf9;&#x6cdb;&#x5316;&#x5173;&#x7cfb;&#x6709;&#x4e09;&#x4e2a;&#x8981;&#x6c42;&#xff1a; * &#x5b50;&#x7c7b;&#x4e0e;&#x7236;&#x7c7b;&#x5e94;&#x8be5;&#x5b8c;&#x5168;&#x4e00;&#x81f4;&#xff0c;&#x7236;&#x7c7b;&#x6240;&#x5177;&#x6709;&#x7684;&#x5c5e;&#x6027;&#x3001;&#x64cd;&#x4f5c;&#xff0c;&#x5b50;&#x7c7b;&#x5e94;&#x8be5;&#x90fd;&#x6709;&#xff1b; * &#x5b50;&#x7c7b;&#x4e2d;&#x9664;&#x4e86;&#x4e0e;&#x7236;&#x7c7b;&#x4e00;&#x81f4;&#x7684;&#x4fe1;&#x606f;&#x4ee5;&#x5916;&#xff0c;&#x8fd8;&#x5305;&#x62ec;&#x989d;&#x5916;&#x7684;&#x4fe1;&#x606f;&#xff1b; * &#x53ef;&#x4ee5;&#x4f7f;&#x7528;&#x7236;&#x7c7b;&#x7684;&#x5b9e;&#x4f8b;&#x7684;&#x5730;&#x65b9;&#xff0c;&#x4e5f;&#x53ef;&#x4ee5;&#x4f7f;&#x7528;&#x5b50;&#x7c7b;&#x7684;&#x5b9e;&#x4f8b;&#xff1b;</p>
</blockquote>

<ul>
  
<li></div>
<div class="section">
<h4><a name="a"></a>&#x5b9e;&#x73b0;</h4>
  
<blockquote>&#x6307;&#x7684;&#x662f;&#x4e00;&#x4e2a;class&#x7c7b;&#x5b9e;&#x73b0;interface&#x63a5;&#x53e3;&#xff08;&#x53ef;&#x4ee5;&#x662f;&#x591a;&#x4e2a;&#xff09;&#x7684;&#x529f;&#x80fd;&#xff1b;&#x5b9e;&#x73b0;&#x662f;&#x7c7b;&#x4e0e;&#x63a5;&#x53e3;&#x4e4b;&#x95f4;&#x6700;&#x5e38;&#x89c1;&#x7684;&#x5173;&#x7cfb;&#xff1b;&#x5728;Java&#x4e2d;&#x6b64;&#x7c7b;&#x5173;&#x7cfb;&#x901a;&#x8fc7;&#x5173;&#x952e;&#x5b57;implements&#x660e;&#x786e;&#x6807;&#x8bc6;
  </blockquote></li>
</ul>
<p>![](image/impl.png)</p>

<ul>
  
<li></div>
<div class="section">
<h4><a name="a"></a>&#x4f9d;&#x8d56;</h4>
  
<blockquote>&#x4f9d;&#x8d56;&#x5173;&#x7cfb;(Dependency) &#x662f;&#x4e00;&#x79cd;&#x4f7f;&#x7528;&#x5173;&#x7cfb;&#xff0c;&#x7279;&#x5b9a;&#x4e8b;&#x7269;&#x7684;&#x6539;&#x53d8;&#x6709;&#x53ef;&#x80fd;&#x4f1a;&#x5f71;&#x54cd;&#x5230;&#x4f7f;&#x7528;&#x8be5;&#x4e8b;&#x7269;&#x7684;&#x5176;&#x4ed6;&#x4e8b;&#x7269;&#xff0c;&#x5728;&#x9700;&#x8981;&#x8868;&#x793a;&#x4e00;&#x4e2a;&#x4e8b;&#x7269;&#x4f7f;&#x7528;&#x53e6;&#x4e00;&#x4e2a;&#x4e8b;&#x7269;&#x65f6;&#x4f7f;&#x7528;&#x4f9d;&#x8d56;&#x5173;&#x7cfb;&#x3002;&#x5927;&#x591a;&#x6570;&#x60c5;&#x51b5;&#x4e0b;&#xff0c;&#x4f9d; &#x8d56;&#x5173;&#x7cfb;&#x4f53;&#x73b0;&#x5728;&#x67d0;&#x4e2a;&#x7c7b;&#x7684;&#x65b9;&#x6cd5;&#x4f7f;&#x7528;&#x53e6;&#x4e00;&#x4e2a;&#x7c7b;&#x7684;&#x5bf9;&#x8c61;&#x4f5c;&#x4e3a;&#x53c2;&#x6570;&#x3002;
  </blockquote></li>
</ul>
<p>![](image/dependency.png)</p>

<blockquote>
<p>&#x4f9d;&#x8d56;&#x5173;&#x7cfb;&#x6709;&#x5982;&#x4e0b;&#x4e09;&#x79cd;&#x60c5;&#x51b5;&#xff1a; * A&#x7c7b;&#x662f;B&#x7c7b;&#x4e2d;&#x7684;&#xff08;&#x67d0;&#x4e2d;&#x65b9;&#x6cd5;&#x7684;&#xff09;&#x5c40;&#x90e8;&#x53d8;&#x91cf;&#xff1b; * A&#x7c7b;&#x662f;B&#x7c7b;&#x65b9;&#x6cd5;&#x5f53;&#x4e2d;&#x7684;&#x4e00;&#x4e2a;&#x53c2;&#x6570;&#xff1b; * A&#x7c7b;&#x5bf9;B&#x7c7b;&#x7684;&#x9759;&#x6001;&#x65b9;&#x6cd5;&#x8c03;&#x7528;&#xff1b; * A&#x7c7b;&#x5411;B&#x7c7b;&#x53d1;&#x9001;&#x6d88;&#x606f;&#xff0c;&#x4ece;&#x800c;&#x5f71;&#x54cd;B&#x7c7b;&#x53d1;&#x751f;&#x53d8;&#x5316;&#xff1b;</p>
</blockquote>

<ul>
  
<li></div>
<div class="section">
<h4><a name="a"></a>&#x5173;&#x8054;</h4>
  
<blockquote>&#x5173;&#x7cfb;&#x662f;&#x7c7b;&#x4e0e;&#x7c7b;&#x4e4b;&#x95f4;&#x7684;&#x8054;&#x63a5;&#xff0c;&#x5b83;&#x4f7f;&#x4e00;&#x4e2a;&#x7c7b;&#x77e5;&#x9053;&#x53e6;&#x4e00;&#x4e2a;&#x7c7b;&#x7684;&#x5c5e;&#x6027;&#x548c;&#x65b9;&#x6cd5;&#x3002;&#x5173;&#x8054;&#x53ef;&#x4ee5;&#x662f;&#x53cc;&#x5411;&#x7684;&#xff0c;&#x4e5f;&#x53ef;&#x4ee5;&#x662f;&#x5355;&#x5411;&#x7684;&#x3002;
  </blockquote></li>
</ul>

<blockquote>
<p>&#x7ed9;&#x5b9a;&#x6709;&#x5173;&#x8054;&#x7684;&#x4e24;&#x4e2a;&#x7c7b;&#xff0c;&#x53ef;&#x4ee5;&#x4ece;&#x4e00;&#x4e2a;&#x7c7b;&#x7684;&#x5bf9;&#x8c61;&#x5f97;&#x5230;&#x53e6;&#x4e00;&#x4e2a;&#x7c7b;&#x7684;&#x5bf9;&#x8c61;&#x3002;&#x5173;&#x8054;&#x6709;&#x4e24;&#x5143;&#x5173;&#x7cfb;&#x548c;&#x591a;&#x5143;&#x5173;&#x7cfb;&#x3002;&#x4e24;&#x5143;&#x5173;&#x7cfb;&#x662f;&#x6307;&#x4e00;&#x79cd;&#x4e00;&#x5bf9;&#x4e00;&#x7684;&#x5173;&#x7cfb;&#xff0c;&#x591a;&#x5143;&#x5173;&#x7cfb;&#x662f;&#x4e00;&#x5bf9;&#x591a;&#x6216;&#x591a;&#x5bf9;&#x4e00;&#x7684;&#x5173;&#x7cfb;&#x3002;&#x4e24;&#x4e2a;&#x7c7b;&#x4e4b;&#x95f4;&#x7684;&#x7b80;&#x5355;&#x5173;&#x8054;&#x8868;&#x793a;&#x4e86;&#x4e24;&#x4e2a;&#x540c;&#x7b49;&#x5730;&#x4f4d;&#x7c7b;&#x4e4b;&#x95f4;&#x7684;&#x7ed3;&#x6784;&#x5173;&#x7cfb;&#x3002;&#x5f53;&#x4f60;&#x60f3;&#x8981;&#x8868;&#x793a;&#x7ed3;&#x6784;&#x5316;&#x5173;&#x7cfb;&#x65f6;&#x4f7f;&#x7528;&#x5173;&#x8054;&#x3002;</p>
<p><b>&#x5728;Java&#x8bed;&#x8a00;&#x4e2d;&#xff0c;&#x5173;&#x8054;&#x5173;&#x7cfb;&#x4e00;&#x822c;&#x4f7f;&#x7528;&#x6210;&#x5458;&#x53d8;&#x91cf;&#x6765;&#x5b9e;&#x73b0;&#x3002;</b></p>
</blockquote>
<p>![](image/association.png)</p>

<ul>
  
<li></div>
<div class="section">
<h4><a name="a"></a>&#x805a;&#x5408;</h4>
  
<blockquote>&#x805a;&#x5408;&#x5173;&#x7cfb;&#x662f;&#x5173;&#x8054;&#x5173;&#x7cfb;&#x7684;&#x4e00;&#x79cd;&#xff0c;&#x662f;&#x5f3a;&#x7684;&#x5173;&#x8054;&#x5173;&#x7cfb;&#x3002; &#x805a;&#x5408;&#x662f;&#x6574;&#x4f53;&#x548c;&#x4e2a;&#x4f53;&#x4e4b;&#x95f4;&#x7684;&#x5173;&#x7cfb;&#x3002;&#x4f8b;&#x5982;&#xff0c;School&#x7c7b;&#x4e0e;Student&#x7c7b;&#x7684;&#x5173;&#x7cfb;&#x4fbf;&#x6574;&#x4f53;&#x548c;&#x4e2a;&#x4f53;&#x7684;&#x5173;&#x7cfb;&#x3002; &#x4e0e;&#x5173;&#x8054;&#x5173;&#x7cfb;&#x4e00;&#x6837;&#xff0c;&#x805a;&#x5408;&#x5173;&#x7cfb;&#x4e5f;&#x662f;&#x901a;&#x8fc7;&#x5b9e;&#x4f8b;&#x53d8;&#x91cf;&#x5b9e;&#x73b0;&#x7684;&#x3002; &#x4f46;&#x662f;&#x5173;&#x8054;&#x5173;&#x7cfb;&#x6240;&#x6d89;&#x53ca;&#x7684;&#x4e24;&#x4e2a;&#x7c7b;&#x662f;&#x5904;&#x5728;&#x540c;&#x4e00;&#x5c42;&#x6b21;&#x4e0a;&#x7684;&#xff0c;&#x800c;&#x5728;&#x805a;&#x5408;&#x5173;&#x7cfb;&#x4e2d;&#xff0c;&#x4e24;&#x4e2a;&#x7c7b;&#x662f;&#x5904;&#x5728;&#x4e0d;&#x5e73;&#x7b49;&#x5c42;&#x6b21;&#x4e0a;&#x7684;&#xff0c; &#x4e00;&#x4e2a;&#x4ee3;&#x8868;&#x6574;&#x4f53;&#xff0c;&#x53e6;&#x4e00;&#x4e2a;&#x4ee3;&#x8868;&#x90e8;&#x5206;&#x3002;
  </blockquote></li>
</ul>
<p>![](image/aggregation.png)</p>

<ul>
  
<li></div>
<div class="section">
<h4><a name="a"></a>&#x7ec4;&#x5408;</h4>
  
<blockquote>&#x7ec4;&#x5408;&#x5173;&#x7cfb;&#x4e5f;&#x8868;&#x793a;&#x7c7b;&#x4e4b;&#x95f4;&#x6574;&#x4f53;&#x548c;&#x90e8;&#x5206;&#x7684;&#x5173;&#x7cfb;&#xff0c;&#x4f46;&#x662f;&#x7ec4;&#x5408;&#x5173;&#x7cfb;&#x4e2d;&#x90e8;&#x5206;&#x548c;&#x6574;&#x4f53;&#x5177;&#x6709;&#x7edf;&#x4e00;&#x7684;&#x751f;&#x5b58;&#x671f;&#x3002; &#x4e00;&#x65e6;&#x6574;&#x4f53;&#x5bf9;&#x8c61;&#x4e0d;&#x5b58;&#x5728;&#xff0c;&#x90e8;&#x5206;&#x5bf9;&#x8c61;&#x4e5f;&#x5c06;&#x4e0d;&#x5b58;&#x5728;&#xff0c;&#x90e8;&#x5206;&#x5bf9;&#x8c61;&#x4e0e;&#x6574;&#x4f53;&#x5bf9;&#x8c61;&#x4e4b;&#x95f4;&#x5177;&#x6709; <b>&#x540c;&#x751f;&#x5171;&#x6b7b;</b> &#x7684;&#x5173;&#x7cfb;&#x3002;
  </blockquote></li>
</ul>
<p>![](image/composition.png)</p></div></div>
<div class="section">
<h3><a name="a4.3_"></a>4.3 &#x65f6;&#x5e8f;&#x56fe;</h3>

<blockquote>
<p>&#x65f6;&#x5e8f;&#x56fe;&#x663e;&#x793a;&#x5177;&#x4f53;&#x7528;&#x4f8b;&#xff08;&#x6216;&#x8005;&#x662f;&#x7528;&#x4f8b;&#x7684;&#x4e00;&#x90e8;&#x5206;&#xff09;&#x7684;&#x8be6;&#x7ec6;&#x6d41;&#x7a0b;&#x3002; &#x5b83;&#x51e0;&#x4e4e;&#x662f;&#x81ea;&#x63cf;&#x8ff0;&#x7684;&#xff0c;&#x5e76;&#x4e14;&#x663e;&#x793a;&#x4e86;&#x6d41;&#x7a0b;&#x4e2d;&#x4e2d;&#x4e0d;&#x540c;&#x5bf9;&#x8c61;&#x4e4b;&#x95f4;&#x7684;&#x8c03;&#x7528;&#x5173;&#x7cfb;&#xff0c;&#x540c;&#x65f6;&#x8fd8;&#x53ef;&#x4ee5;&#x5f88;&#x8be6;&#x7ec6;&#x5730;&#x663e;&#x793a;&#x5bf9;&#x4e0d;&#x540c;&#x5bf9;&#x8c61;&#x7684;&#x4e0d;&#x540c;&#x8c03;&#x7528;&#x3002;</p>
</blockquote></div></div>
      </div>
    </div>
    <div class="clear">
      <hr/>
    </div>
    <div id="footer">
      <div class="xright">
              Copyright &#169;                   2017.
          All rights reserved.    
                  </div>
      <div class="clear">
        <hr/>
      </div>
    </div>
  </body>
</html>
